{
    "Afghanistan": "Capital: Kabul. Population: ~40.1 million. Languages: Pashto, Dari. Famous food: Kabuli pulao. Most famous person: Ahmad Shah Massoud. Famous landmarks: Buddhas of Bamiyan, Blue Mosque. Known for: rugged mountainous terrain, historic Silk Road location, and decades of conflict.",
    "Albania": "Capital: Tirana. Population: ~2.8 million. Languages: Albanian. Famous food: Byrek. Most famous person: Mother Teresa. Famous landmarks: Butrint National Park, Berat Castle. Known for: beautiful beaches, bunkers from communist era, and unique language isolate.",
    "Algeria": "Capital: Algiers. Population: ~44.6 million. Languages: Arabic, Berber. Famous food: Couscous. Most famous person: Albert Camus. Famous landmarks: Timgad, Casbah of Algiers. Known for: being the largest country in Africa, Sahara Desert, and oil and gas reserves.",
    "Andorra": "Capital: Andorra la Vella. Population: ~77,000. Languages: Catalan. Famous food: Escudella. Most famous person: Marc Forné Molné. Famous landmarks: Sant Joan de Caselles Church. Known for: ski resorts, tax haven, and tiny mountainous principality.",
    "Angola": "Capital: Luanda. Population: ~34.5 million. Languages: Portuguese. Famous food: Muamba de galinha. Most famous person: Agostinho Neto. Famous landmarks: Kissama National Park. Known for: oil production, Portuguese colonial architecture, and long civil war.",
    "Antigua and Barbuda": "Capital: Saint John's. Population: ~98,000. Languages: English. Famous food: Fungee and pepperpot. Most famous person: Viv Richards. Famous landmarks: Nelson's Dockyard. Known for: 365 beaches, sailing destinations, and Carnival celebrations.",
    "Argentina": "Capital: Buenos Aires. Population: ~45.8 million. Languages: Spanish. Famous food: Asado. Most famous person: Lionel Messi. Famous landmarks: Perito Moreno Glacier, Iguazu Falls. Known for: tango, beef production, Patagonia region, and Maradona and Messi.",
    "Armenia": "Capital: Yerevan. Population: ~2.9 million. Languages: Armenian. Famous food: Khorovats. Most famous person: Charles Aznavour. Famous landmarks: Tatev Monastery, Mount Ararat. Known for: being the first Christian nation, chess masters, and Armenian Genocide memory.",
    "Australia": "Capital: Canberra. Population: ~26.0 million. Languages: English. Famous food: Meat pie. Most famous person: Hugh Jackman. Famous landmarks: Sydney Opera House, Great Barrier Reef. Known for: the Outback, kangaroos, Great Barrier Reef, and surfing culture.",
    "Austria": "Capital: Vienna. Population: ~9.0 million. Languages: German. Famous food: Wiener Schnitzel. Most famous person: Wolfgang Amadeus Mozart. Famous landmarks: Schönbrunn Palace, Hofburg Palace. Known for: the Alps, classical music (Mozart, Strauss), skiing, and coffeehouse culture.",
    "Azerbaijan": "Capital: Baku. Population: ~10.1 million. Languages: Azerbaijani. Famous food: Plov. Most famous person: Garry Kasparov. Famous landmarks: Flame Towers, Old City Baku. Known for: oil reserves, fire mountain (Yanar Dag), and Eurovision 2011 winner.",
    "Bahamas": "Capital: Nassau. Population: ~400,000. Languages: English. Famous food: Conch salad. Most famous person: Sidney Poitier. Famous landmarks: Pink Sands Beach, Atlantis Paradise Island. Known for: crystal clear waters, luxury resorts, and swimming pigs.",
    "Bahrain": "Capital: Manama. Population: ~1.5 million. Languages: Arabic. Famous food: Machboos. Most famous person: Rashid Al Khalifa. Famous landmarks: Bahrain Fort, Al Fateh Grand Mosque. Known for: pearl diving history, Formula 1 Grand Prix, and financial hub.",
    "Bangladesh": "Capital: Dhaka. Population: ~169.4 million. Languages: Bengali. Famous food: Biryani. Most famous person: Muhammad Yunus. Famous landmarks: Sundarbans Mangrove Forest, Lalbagh Fort. Known for: the world's largest river delta, garment industry, and frequent flooding.",
    "Barbados": "Capital: Bridgetown. Population: ~287,000. Languages: English. Famous food: Cou-cou and flying fish. Most famous person: Rihanna. Famous landmarks: Harrison's Cave, Carlisle Bay. Known for: Rihanna, rum production, cricket, and British colonial history.",
    "Belarus": "Capital: Minsk. Population: ~9.3 million. Languages: Belarusian, Russian. Famous food: Draniki. Most famous person: Marc Chagall. Famous landmarks: Mir Castle, Białowieża Forest. Known for: being the last dictatorship in Europe, vast forests, and IT outsourcing hub.",
    "Belgium": "Capital: Brussels. Population: ~11.6 million. Languages: Dutch, French, German. Famous food: Moules-frites. Most famous person: Hergé. Famous landmarks: Grand Place, Atomium. Known for: EU headquarters, chocolate, beer, and comic books (Tintin, Smurfs).",
    "Belize": "Capital: Belmopan. Population: ~400,000. Languages: English. Famous food: Rice and beans with stewed chicken. Most famous person: George Price. Famous landmarks: Great Blue Hole, Xunantunich. Known for: the barrier reef, being an English-speaking country in Central America, and jungle wildlife.",
    "Benin": "Capital: Porto-Novo. Population: ~12.5 million. Languages: French. Famous food: Akpan. Most famous person: Angélique Kidjo. Famous landmarks: Royal Palaces of Abomey, Pendjari National Park. Known for: being the birthplace of voodoo, slave coast history, and cotton production.",
    "Bhutan": "Capital: Thimphu. Population: ~780,000. Languages: Dzongkha. Famous food: Ema datshi. Most famous person: Jigme Singye Wangchuck. Famous landmarks: Tiger's Nest Monastery, Punakha Dzong. Known for: Gross National Happiness index, Buddhist culture, and Himalayan landscapes.",
    "Bolivia": "Capital: Sucre (official), La Paz (administrative). Population: ~11.8 million. Languages: Spanish, Quechua, Aymara. Famous food: Salteñas. Most famous person: Evo Morales. Famous landmarks: Salar de Uyuni, Tiwanaku. Known for: the highest capital city (La Paz), indigenous cultures, and lithium reserves.",
    "Bosnia and Herzegovina": "Capital: Sarajevo. Population: ~3.3 million. Languages: Bosnian, Serbian, Croatian. Famous food: Ćevapi. Most famous person: Ivo Andrić. Famous landmarks: Stari Most, Sarajevo Tunnel. Known for: 1990s war, ethnic diversity, and beautiful old towns.",
    "Botswana": "Capital: Gaborone. Population: ~2.4 million. Languages: English, Tswana. Famous food: Seswaa. Most famous person: Seretse Khama. Famous landmarks: Okavango Delta, Chobe National Park. Known for: diamond mining, stable democracy, and wildlife safaris.",
    "Brazil": "Capital: Brasília. Population: ~214 million. Languages: Portuguese. Famous food: Feijoada. Most famous person: Pelé. Famous landmarks: Christ the Redeemer, Amazon Rainforest. Known for: Carnival, soccer (Pelé, Ronaldo), samba, and vast biodiversity.",
    "Brunei Darussalam": "Capital: Bandar Seri Begawan. Population: ~440,000. Languages: Malay. Famous food: Ambuyat. Most famous person: Hassanal Bolkiah. Famous landmarks: Omar Ali Saifuddien Mosque, Kampong Ayer. Known for: oil wealth, absolute monarchy, and strict Islamic laws.",
    "Bulgaria": "Capital: Sofia. Population: ~6.8 million. Languages: Bulgarian. Famous food: Banitsa. Most famous person: Hristo Stoichkov. Famous landmarks: Rila Monastery, Alexander Nevsky Cathedral. Known for: rose oil production, Cyrillic alphabet, and yogurt.",
    "Burkina Faso": "Capital: Ouagadougou. Population: ~21.5 million. Languages: French. Famous food: Riz gras. Most famous person: Thomas Sankara. Famous landmarks: Ruins of Loropéni, W National Park. Known for: gold production, film festival, and Sahel region droughts.",
    "Burundi": "Capital: Gitega. Population: ~12.6 million. Languages: Kirundi, French. Famous food: Ugali. Most famous person: Melchior Ndadaye. Famous landmarks: Kibira National Park, Lake Tanganyika. Known for: coffee production, ethnic conflicts, and being one of world's poorest countries.",
    "Cambodia": "Capital: Phnom Penh. Population: ~16.9 million. Languages: Khmer. Famous food: Amok. Most famous person: Norodom Sihanouk. Famous landmarks: Angkor Wat, Royal Palace. Known for: the Khmer Empire, Killing Fields, and traditional Apsara dance.",
    "Cameroon": "Capital: Yaoundé. Population: ~27.2 million. Languages: French, English. Famous food: Ndolé. Most famous person: Samuel Eto'o. Famous landmarks: Mount Cameroon, Waza National Park. Known for: diverse geography (beaches, deserts, mountains), and football team.",
    "Canada": "Capital: Ottawa. Population: ~38.0 million. Languages: English, French. Famous food: Poutine. Most famous person: Justin Trudeau. Famous landmarks: CN Tower, Niagara Falls. Known for: maple syrup, hockey, politeness, and vast wilderness areas.",
    "Cape Verde": "Capital: Praia. Population: ~560,000. Languages: Portuguese. Famous food: Cachupa. Most famous person: Cesária Évora. Famous landmarks: Pico do Fogo, Santa Maria Beach. Known for: Creole culture, morna music, and Atlantic archipelago.",
    "Central African Republic": "Capital: Bangui. Population: ~4.9 million. Languages: French, Sango. Famous food: Kanda. Most famous person: Barthélemy Boganda. Famous landmarks: Dzanga-Sangha Reserve, Boali Falls. Known for: diamonds, political instability, and rainforests.",
    "Chad": "Capital: N'Djamena. Population: ~16.9 million. Languages: French, Arabic. Famous food: La Bouillie. Most famous person: Idriss Déby. Famous landmarks: Zakouma National Park, Ennedi Plateau. Known for: desert landscapes, oil reserves, and being one of poorest countries.",
    "Chile": "Capital: Santiago. Population: ~19.5 million. Languages: Spanish. Famous food: Empanadas. Most famous person: Pablo Neruda. Famous landmarks: Easter Island, Torres del Paine. Known for: long narrow shape, Atacama Desert, and wine production.",
    "China": "Capital: Beijing. Population: ~1.4 billion. Languages: Mandarin. Famous food: Peking duck. Most famous person: Confucius. Famous landmarks: Great Wall, Forbidden City. Known for: ancient civilization, manufacturing hub, pandas, and rapid economic growth.",
    "Colombia": "Capital: Bogotá. Population: ~51.5 million. Languages: Spanish. Famous food: Bandeja paisa. Most famous person: Gabriel García Márquez. Famous landmarks: Ciudad Perdida, Salt Cathedral. Known for: coffee, emeralds, Gabriel García Márquez, and diverse landscapes.",
    "Comoros": "Capital: Moroni. Population: ~900,000. Languages: Comorian, French, Arabic. Famous food: Langouste a la vanille. Most famous person: Azali Assoumani. Famous landmarks: Mount Karthala, Mohéli Marine Park. Known for: volcanic islands, perfume production, and political instability.",
    "Congo (Democratic Republic)": "Capital: Kinshasa. Population: ~95.2 million. Languages: French. Famous food: Moambe chicken. Most famous person: Patrice Lumumba. Famous landmarks: Virunga National Park, Congo River. Known for: rainforests, mineral wealth, and long civil conflicts.",
    "Congo (Republic)": "Capital: Brazzaville. Population: ~5.8 million. Languages: French. Famous food: Poulet à la moambé. Most famous person: Denis Sassou Nguesso. Famous landmarks: Odzala-Kokoua National Park, Basilique Sainte-Anne. Known for: oil production, rainforests, and French colonial architecture.",
    "Costa Rica": "Capital: San José. Population: ~5.2 million. Languages: Spanish. Famous food: Gallo pinto. Most famous person: Óscar Arias. Famous landmarks: Arenal Volcano, Monteverde Cloud Forest. Known for: ecotourism, no standing army, and high quality of life.",
    "Croatia": "Capital: Zagreb. Population: ~4.0 million. Languages: Croatian. Famous food: Peka. Most famous person: Nikola Tesla. Famous landmarks: Plitvice Lakes, Dubrovnik Old Town. Known for: Dalmatian Coast, Game of Thrones filming locations, and football talent.",
    "Cuba": "Capital: Havana. Population: ~11.3 million. Languages: Spanish. Famous food: Ropa vieja. Most famous person: Fidel Castro. Famous landmarks: Old Havana, Varadero Beach. Known for: communist revolution, classic cars, cigars, and salsa music.",
    "Cyprus": "Capital: Nicosia. Population: ~1.2 million. Languages: Greek, Turkish. Famous food: Halloumi. Most famous person: Archbishop Makarios III. Famous landmarks: Petra tou Romiou, Kykkos Monastery. Known for: divided capital, Aphrodite's birthplace, and strategic Mediterranean location.",
    "Czech Republic": "Capital: Prague. Population: ~10.7 million. Languages: Czech. Famous food: Svíčková. Most famous person: Václav Havel. Famous landmarks: Prague Castle, Charles Bridge. Known for: Pilsner beer, Bohemian culture, and medieval architecture.",
    "Denmark": "Capital: Copenhagen. Population: ~5.8 million. Languages: Danish. Famous food: Smørrebrød. Most famous person: Hans Christian Andersen. Famous landmarks: Little Mermaid, Tivoli Gardens. Known for: LEGO, Andersen's fairy tales, hygge, and bicycle culture.",
    "Djibouti": "Capital: Djibouti City. Population: ~1.0 million. Languages: French, Arabic. Famous food: Skoudehkaris. Most famous person: Abdourahman Waberi. Famous landmarks: Lake Assal, Day Forest National Park. Known for: strategic port location, salt lakes, and French military base.",
    "Dominica": "Capital: Roseau. Population: ~72,000. Languages: English. Famous food: Callaloo soup. Most famous person: Jean Rhys. Famous landmarks: Boiling Lake, Morne Trois Pitons. Known for: Nature Island, volcanic features, and lush rainforests.",
    "Dominican Republic": "Capital: Santo Domingo. Population: ~11.1 million. Languages: Spanish. Famous food: La Bandera. Most famous person: Juan Luis Guerra. Famous landmarks: Colonial Zone, Punta Cana. Known for: baseball talent, merengue music, and all-inclusive resorts.",
    "Ecuador": "Capital: Quito. Population: ~17.8 million. Languages: Spanish. Famous food: Ceviche. Most famous person: Oswaldo Guayasamín. Famous landmarks: Galápagos Islands, Cotopaxi. Known for: biodiversity, equatorial line monument, and Panama hats (actually Ecuadorian).",
    "Egypt": "Capital: Cairo. Population: ~109 million. Languages: Arabic. Famous food: Koshari. Most famous person: Cleopatra. Famous landmarks: Pyramids of Giza, Nile River. Known for: ancient civilization, Nile River, Suez Canal, and Arab Spring.",
    "El Salvador": "Capital: San Salvador. Population: ~6.5 million. Languages: Spanish. Famous food: Pupusas. Most famous person: Óscar Romero. Famous landmarks: Joya de Cerén, Santa Ana Volcano. Known for: pupusas, surfing spots, and gang violence challenges.",
    "Equatorial Guinea": "Capital: Malabo. Population: ~1.5 million. Languages: Spanish, French, Portuguese. Famous food: Succotash. Most famous person: Teodoro Obiang Nguema. Famous landmarks: Monte Alen National Park, Arena Blanca. Known for: oil wealth, being a Spanish-speaking African country, and authoritarian government.",
    "Eritrea": "Capital: Asmara. Population: ~3.6 million. Languages: Tigrinya, Arabic, English. Famous food: Zigni. Most famous person: Isaias Afwerki. Famous landmarks: Asmara architecture, Dahlak Archipelago. Known for: military conscription, Red Sea location, and Italian colonial heritage.",
    "Estonia": "Capital: Tallinn. Population: ~1.3 million. Languages: Estonian. Famous food: Verivorst. Most famous person: Arvo Pärt. Famous landmarks: Tallinn Old Town, Lahemaa National Park. Known for: digital society, medieval architecture, and Baltic singing tradition.",
    "Eswatini": "Capital: Mbabane (administrative), Lobamba (royal). Population: ~1.2 million. Languages: Swazi, English. Famous food: Sishwala. Most famous person: Mswati III. Famous landmarks: Mlilwane Wildlife Sanctuary, Mantenga Falls. Known for: absolute monarchy, HIV/AIDS challenges, and traditional reed dance.",
    "Ethiopia": "Capital: Addis Ababa. Population: ~120 million. Languages: Amharic. Famous food: Injera. Most famous person: Haile Selassie. Famous landmarks: Lalibela churches, Simien Mountains. Known for: coffee origin, ancient Christian tradition, and African Union headquarters.",
    "Fiji": "Capital: Suva. Population: ~900,000. Languages: English, Fijian, Hindi. Famous food: Kokoda. Most famous person: Waisale Serevi. Famous landmarks: Mamanuca Islands, Sigatoka Sand Dunes. Known for: rugby team, tropical paradise, and Indo-Fijian culture.",
    "Finland": "Capital: Helsinki. Population: ~5.5 million. Languages: Finnish, Swedish. Famous food: Karjalanpiirakka. Most famous person: Jean Sibelius. Famous landmarks: Suomenlinna, Northern Lights. Known for: saunas, education system, Nokia, and Santa Claus Village.",
    "France": "Capital: Paris. Population: ~67.8 million. Languages: French. Famous food: Croissant. Most famous person: Napoleon Bonaparte. Famous landmarks: Eiffel Tower, Louvre Museum. Known for: wine, fashion, art museums, revolution, and haute cuisine.",
    "Gabon": "Capital: Libreville. Population: ~2.3 million. Languages: French. Famous food: Nyembwe. Most famous person: Omar Bongo. Famous landmarks: Loango National Park, Ivindo National Park. Known for: oil wealth, rainforests, and low population density.",
    "Gambia": "Capital: Banjul. Population: ~2.5 million. Languages: English. Famous food: Domoda. Most famous person: Kunta Kinteh. Famous landmarks: Kunta Kinteh Island, Abuko Nature Reserve. Known for: being the smallest mainland African country, river Gambia, and ecotourism.",
    "Georgia": "Capital: Tbilisi. Population: ~3.7 million. Languages: Georgian. Famous food: Khachapuri. Most famous person: Joseph Stalin. Famous landmarks: Svetitskhoveli Cathedral, Uplistsikhe. Known for: wine birthplace, Caucasus mountains, and unique alphabet.",
    "Germany": "Capital: Berlin. Population: ~83.2 million. Languages: German. Famous food: Bratwurst. Most famous person: Albert Einstein. Famous landmarks: Brandenburg Gate, Neuschwanstein Castle. Known for: beer, cars (BMW, Mercedes), Oktoberfest, and Berlin Wall history.",
    "Ghana": "Capital: Accra. Population: ~32.1 million. Languages: English. Famous food: Jollof rice. Most famous person: Kwame Nkrumah. Famous landmarks: Cape Coast Castle, Kakum National Park. Known for: Gold Coast history, stable democracy, and kente cloth.",
    "Greece": "Capital: Athens. Population: ~10.7 million. Languages: Greek. Famous food: Moussaka. Most famous person: Alexander the Great. Famous landmarks: Acropolis, Santorini. Known for: ancient philosophy, mythology, island beauty, and financial crisis.",
    "Grenada": "Capital: St. George's. Population: ~113,000. Languages: English. Famous food: Oil down. Most famous person: Kirani James. Famous landmarks: Grand Anse Beach, Underwater Sculpture Park. Known for: Spice Island (nutmeg), Caribbean beauty, and 1983 US invasion.",
    "Guatemala": "Capital: Guatemala City. Population: ~17.6 million. Languages: Spanish. Famous food: Pepián. Most famous person: Rigoberta Menchú. Famous landmarks: Tikal, Lake Atitlán. Known for: Mayan heritage, coffee, volcanoes, and colorful textiles.",
    "Guinea": "Capital: Conakry. Population: ~13.5 million. Languages: French. Famous food: Poulet Yassa. Most famous person: Sékou Touré. Famous landmarks: Mount Nimba, Îles de Los. Known for: bauxite reserves, Ebola outbreak, and West African music.",
    "Guinea-Bissau": "Capital: Bissau. Population: ~2.0 million. Languages: Portuguese. Famous food: Jollof rice. Most famous person: Amílcar Cabral. Famous landmarks: Bijagós Archipelago, Orango Islands National Park. Known for: cashew production, political instability, and Creole culture.",
    "Guyana": "Capital: Georgetown. Population: ~790,000. Languages: English. Famous food: Pepperpot. Most famous person: Walter Rodney. Famous landmarks: Kaieteur Falls, St. George's Cathedral. Known for: being the only English-speaking South American country, Caribbean culture, and rainforests.",
    "Haiti": "Capital: Port-au-Prince. Population: ~11.4 million. Languages: French, Haitian Creole. Famous food: Griot. Most famous person: Toussaint Louverture. Famous landmarks: Citadelle Laferrière, Labadee. Known for: being the first black republic, voodoo religion, and poverty and natural disasters.",
    "Honduras": "Capital: Tegucigalpa. Population: ~10.1 million. Languages: Spanish. Famous food: Baleadas. Most famous person: Francisco Morazán. Famous landmarks: Copán Ruins, Roatán. Known for: banana exports, violence challenges, and Mayan heritage.",
    "Hungary": "Capital: Budapest. Population: ~9.6 million. Languages: Hungarian. Famous food: Goulash. Most famous person: Franz Liszt. Famous landmarks: Hungarian Parliament Building, Buda Castle. Known for: thermal spas, paprika, 1956 revolution, and Rubik's cube.",
    "Iceland": "Capital: Reykjavik. Population: ~370,000. Languages: Icelandic. Famous food: Hákarl. Most famous person: Björk. Famous landmarks: Blue Lagoon, Gullfoss. Known for: volcanoes, geysers, Nordic welfare model, and small population.",
    "India": "Capital: New Delhi. Population: ~1.4 billion. Languages: Hindi, English. Famous food: Butter chicken. Most famous person: Mahatma Gandhi. Famous landmarks: Taj Mahal, Varanasi. Known for: Bollywood, IT industry, spices, and diverse cultures and religions.",
    "Indonesia": "Capital: Jakarta. Population: ~276 million. Languages: Indonesian. Famous food: Nasi goreng. Most famous person: Sukarno. Famous landmarks: Borobudur, Bali. Known for: being the world's largest archipelago, diverse cultures, and Komodo dragons.",
    "Iran": "Capital: Tehran. Population: ~85 million. Languages: Persian. Famous food: Chelow kabab. Most famous person: Rumi. Famous landmarks: Persepolis, Naqsh-e Jahan Square. Known for: ancient Persian Empire, Islamic Revolution, and nuclear program.",
    "Iraq": "Capital: Baghdad. Population: ~42 million. Languages: Arabic, Kurdish. Famous food: Masgouf. Most famous person: Saddam Hussein. Famous landmarks: Ziggurat of Ur, Erbil Citadel. Known for: Mesopotamia cradle of civilization, oil reserves, and recent conflicts.",
    "Ireland": "Capital: Dublin. Population: ~5.0 million. Languages: Irish, English. Famous food: Irish stew. Most famous person: James Joyce. Famous landmarks: Cliffs of Moher, Guinness Storehouse. Known for: Celtic culture, pubs, literature (Yeats, Joyce), and emigration history.",
    "Israel": "Capital: Jerusalem (disputed). Population: ~9.3 million. Languages: Hebrew, Arabic. Famous food: Falafel. Most famous person: David Ben-Gurion. Famous landmarks: Western Wall, Masada. Known for: Holy Land, tech startup nation, kibbutzim, and Israeli-Palestinian conflict.",
    "Italy": "Capital: Rome. Population: ~60.3 million. Languages: Italian. Famous food: Pizza. Most famous person: Leonardo da Vinci. Famous landmarks: Colosseum, Venice Canals. Known for: Roman Empire, Renaissance art, fashion, opera, and cuisine.",
    "Jamaica": "Capital: Kingston. Population: ~2.8 million. Languages: English, Patois. Famous food: Jerk chicken. Most famous person: Bob Marley. Famous landmarks: Dunn's River Falls, Blue Mountains. Known for: reggae music (Bob Marley), sprint athletes, and all-inclusive resorts.",
    "Japan": "Capital: Tokyo. Population: ~125 million. Languages: Japanese. Famous food: Sushi. Most famous person: Emperor Hirohito. Famous landmarks: Mount Fuji, Fushimi Inari Shrine. Known for: technology, anime, bullet trains, cherry blossoms, and longevity.",
    "Jordan": "Capital: Amman. Population: ~11 million. Languages: Arabic. Famous food: Mansaf. Most famous person: King Abdullah II. Famous landmarks: Petra, Dead Sea. Known for: ancient Nabatean civilization, refugee hosting, and desert landscapes.",
    "Kazakhstan": "Capital: Nur-Sultan (Astana). Population: ~19 million. Languages: Kazakh, Russian. Famous food: Beshbarmak. Most famous person: Nursultan Nazarbayev. Famous landmarks: Bayterek Tower, Charyn Canyon. Known for: being the largest landlocked country, oil reserves, and Borat stereotypes.",
    "Kenya": "Capital: Nairobi. Population: ~55 million. Languages: Swahili, English. Famous food: Ugali. Most famous person: Wangari Maathai. Famous landmarks: Maasai Mara, Mount Kenya. Known for: safari destinations, marathon runners, and Great Rift Valley.",
    "Kiribati": "Capital: South Tarawa. Population: ~120,000. Languages: Gilbertese, English. Famous food: Palusami. Most famous person: Anote Tong. Famous landmarks: Christmas Island, Phoenix Islands. Known for: being first to see new year, climate change vulnerability, and Pacific atolls.",
    "Korea, North": "Capital: Pyongyang. Population: ~25 million. Languages: Korean. Famous food: Naengmyeon. Most famous person: Kim Jong-un. Famous landmarks: Juche Tower, Kumsusan Palace. Known for: isolated communist regime, nuclear program, and DMZ border.",
    "Korea, South": "Capital: Seoul. Population: ~51 million. Languages: Korean. Famous food: Kimchi. Most famous person: BTS. Famous landmarks: Gyeongbokgung Palace, Jeju Island. Known for: K-pop, technology (Samsung), rapid development, and Korean Wave.",
    "Kosovo": "Capital: Pristina. Population: ~1.8 million. Languages: Albanian, Serbian. Famous food: Flija. Most famous person: Mother Teresa. Famous landmarks: Gračanica Monastery, Rugova Canyon. Known for: 2008 independence declaration, ethnic tensions, and young population.",
    "Kuwait": "Capital: Kuwait City. Population: ~4.3 million. Languages: Arabic. Famous food: Machboos. Most famous person: Sheikh Jaber Al-Ahmad Al-Sabah. Famous landmarks: Kuwait Towers, Liberation Tower. Known for: oil wealth, Gulf War, high temperatures, and expat majority population.",
    "Kyrgyzstan": "Capital: Bishkek. Population: ~6.7 million. Languages: Kyrgyz, Russian. Famous food: Laghman. Most famous person: Chinghiz Aitmatov. Famous landmarks: Issyk-Kul Lake, Ala-Too Square. Known for: nomadic traditions, mountain landscapes, and Silk Road history.",
    "Laos": "Capital: Vientiane. Population: ~7.4 million. Languages: Lao. Famous food: Larb. Most famous person: Kaysone Phomvihane. Famous landmarks: Luang Prabang, Plain of Jars. Known for: being a landlocked Southeast Asian country, Buddhist culture, and UXO legacy.",
    "Latvia": "Capital: Riga. Population: ~1.9 million. Languages: Latvian. Famous food: Rupjmaize. Most famous person: Mikhail Baryshnikov. Famous landmarks: Riga Old Town, Gauja National Park. Known for: Art Nouveau architecture, Baltic culture, and song and dance festivals.",
    "Lebanon": "Capital: Beirut. Population: ~5.6 million. Languages: Arabic, French. Famous food: Kibbeh. Most famous person: Khalil Gibran. Famous landmarks: Jeita Grotto, Byblos. Known for: cedar trees, diverse religious groups, civil war history, and cuisine.",
    "Lesotho": "Capital: Maseru. Population: ~2.1 million. Languages: Sesotho, English. Famous food: Papa. Most famous person: Moshoeshoe I. Famous landmarks: Maletsunyane Falls, Thaba Bosiu. Known for: mountain kingdom, being entirely surrounded by South Africa, and textiles.",
    "Liberia": "Capital: Monrovia. Population: ~5.2 million. Languages: English. Famous food: Jollof rice. Most famous person: Ellen Johnson Sirleaf. Famous landmarks: Providence Island, Sapo National Park. Known for: being founded by freed American slaves, civil wars, and Ebola outbreak.",
    "Libya": "Capital: Tripoli. Population: ~6.9 million. Languages: Arabic. Famous food: Bazin. Most famous person: Muammar Gaddafi. Famous landmarks: Leptis Magna, Tadrart Acacus. Known for: oil reserves, 2011 revolution, desert landscapes, and Roman ruins.",
    "Liechtenstein": "Capital: Vaduz. Population: ~39,000. Languages: German. Famous food: Käsknöpfle. Most famous person: Hans-Adam II. Famous landmarks: Vaduz Castle, Kunstmuseum Liechtenstein. Known for: being a microstate, banking, alpine scenery, and constitutional monarchy.",
    "Lithuania": "Capital: Vilnius. Population: ~2.8 million. Languages: Lithuanian. Famous food: Cepelinai. Most famous person: Vytautas the Great. Famous landmarks: Trakai Island Castle, Hill of Crosses. Known for: being a Baltic state, basketball passion, and medieval old towns.",
    "Luxembourg": "Capital: Luxembourg City. Population: ~640,000. Languages: Luxembourgish, French, German. Famous food: Judd mat Gaardebounen. Most famous person: Robert Schuman. Famous landmarks: Vianden Castle, Casemates du Bock. Known for: being a wealthy EU country, finance sector, and multilingual population.",
    "Madagascar": "Capital: Antananarivo. Population: ~28.9 million. Languages: Malagasy, French. Famous food: Romazava. Most famous person: Ranavalona I. Famous landmarks: Avenue of the Baobabs, Tsingy de Bemaraha. Known for: unique wildlife (lemurs), vanilla production, and island biodiversity.",
    "Malawi": "Capital: Lilongwe. Population: ~19.6 million. Languages: English, Chichewa. Famous food: Nsima. Most famous person: Hastings Banda. Famous landmarks: Lake Malawi, Mulanje Mountain. Known for: being the Warm Heart of Africa, freshwater lake, and tobacco production.",
    "Malaysia": "Capital: Kuala Lumpur. Population: ~33.6 million. Languages: Malay. Famous food: Nasi lemak. Most famous person: Mahathir Mohamad. Famous landmarks: Petronas Towers, Batu Caves. Known for: multicultural society, rainforests, and electronics manufacturing.",
    "Maldives": "Capital: Malé. Population: ~521,000. Languages: Dhivehi. Famous food: Mas huni. Most famous person: Mohamed Nasheed. Famous landmarks: Maldives beaches, Vaadhoo Island. Known for: luxury resorts, climate change threat, and coral atolls.",
    "Mali": "Capital: Bamako. Population: ~21.9 million. Languages: French. Famous food: Tiguadege Na. Most famous person: Mansa Musa. Famous landmarks: Djenné Mosque, Timbuktu. Known for: ancient Mali Empire, music traditions, and desert landscapes.",
    "Malta": "Capital: Valletta. Population: ~520,000. Languages: Maltese, English. Famous food: Pastizzi. Most famous person: Dom Mintoff. Famous landmarks: Megalithic Temples, Blue Grotto. Known for: Knights of Malta, Game of Thrones filming locations, and Mediterranean history.",
    "Marshall Islands": "Capital: Majuro. Population: ~59,000. Languages: Marshallese, English. Famous food: Bwebwenato. Most famous person: Hilda Heine. Famous landmarks: Bikini Atoll, Kwajalein Atoll. Known for: nuclear testing legacy, climate change vulnerability, and atoll nation.",
    "Mauritania": "Capital: Nouakchott. Population: ~4.6 million. Languages: Arabic. Famous food: Thieboudienne. Most famous person: Moktar Ould Daddah. Famous landmarks: Banc d'Arguin National Park, Chinguetti. Known for: Saharan landscapes, slavery issues, and Islamic republic.",
    "Mauritius": "Capital: Port Louis. Population: ~1.3 million. Languages: English, French. Famous food: Dholl puri. Most famous person: Jean-Marie Le Clézio. Famous landmarks: Le Morne Brabant, Seven Colored Earths. Known for: sugar production, multicultural society, and luxury tourism.",
    "Mexico": "Capital: Mexico City. Population: ~128.9 million. Languages: Spanish. Famous food: Tacos. Most famous person: Frida Kahlo. Famous landmarks: Chichen Itza, Teotihuacan. Known for: ancient civilizations (Aztec, Maya), tequila, and vibrant culture.",
    "Micronesia": "Capital: Palikir. Population: ~115,000. Languages: English. Famous food: Pohnpei breadfruit. Most famous person: Peter Christian. Famous landmarks: Nan Madol, Chuuk Lagoon. Known for: being a Pacific island nation, WWII wrecks, and traditional navigation.",
    "Moldova": "Capital: Chisinau. Population: ~2.6 million. Languages: Romanian. Famous food: Mămăligă. Most famous person: Eugen Doga. Famous landmarks: Orheiul Vechi, Cricova Winery. Known for: wine production, breakaway Transnistria region, and agricultural economy.",
    "Monaco": "Capital: Monaco. Population: ~39,000. Languages: French. Famous food: Barbagiuan. Most famous person: Grace Kelly. Famous landmarks: Monte Carlo Casino, Prince's Palace. Known for: being a wealthy microstate, Grand Prix, tax haven, and Grimaldi family.",
    "Mongolia": "Capital: Ulaanbaatar. Population: ~3.3 million. Languages: Mongolian. Famous food: Buuz. Most famous person: Genghis Khan. Famous landmarks: Gobi Desert, Erdene Zuu Monastery. Known for: nomadic culture, vast steppes, and Genghis Khan legacy.",
    "Montenegro": "Capital: Podgorica. Population: ~620,000. Languages: Montenegrin. Famous food: Njeguški pršut. Most famous person: Milo Đukanović. Famous landmarks: Bay of Kotor, Durmitor National Park. Known for: Adriatic coastline, mountainous terrain, and recent independence (2006).",
    "Morocco": "Capital: Rabat. Population: ~37.1 million. Languages: Arabic, Berber. Famous food: Tagine. Most famous person: Ibn Battuta. Famous landmarks: Hassan II Mosque, Chefchaouen. Known for: Atlas Mountains, Sahara desert, imperial cities, and souks.",
    "Mozambique": "Capital: Maputo. Population: ~32.1 million. Languages: Portuguese. Famous food: Piri piri chicken. Most famous person: Samora Machel. Famous landmarks: Bazaruto Archipelago, Gorongosa National Park. Known for: Indian Ocean coastline, Portuguese influence, and post-war recovery.",
    "Myanmar": "Capital: Naypyidaw. Population: ~54.4 million. Languages: Burmese. Famous food: Mohinga. Most famous person: Aung San Suu Kyi. Famous landmarks: Shwedagon Pagoda, Bagan. Known for: military rule, Buddhist culture, golden pagodas, and Aung San Suu Kyi.",
    "Namibia": "Capital: Windhoek. Population: ~2.6 million. Languages: English. Famous food: Kapana. Most famous person: Sam Nujoma. Famous landmarks: Sossusvlei, Etosha National Park. Known for: desert landscapes, German colonial heritage, and wildlife conservation.",
    "Nauru": "Capital: Yaren (de facto). Population: ~11,000. Languages: Nauruan, English. Famous food: Coconut fish. Most famous person: Baron Waqa. Famous landmarks: Command Ridge, Buada Lagoon. Known for: being the world's smallest republic, phosphate mining, and obesity issues.",
    "Nepal": "Capital: Kathmandu. Population: ~30 million. Languages: Nepali. Famous food: Momo. Most famous person: Buddha. Famous landmarks: Mount Everest, Pashupatinath Temple. Known for: the Himalayas, birthplace of Buddha, and trekking destination.",
    "Netherlands": "Capital: Amsterdam. Population: ~17.5 million. Languages: Dutch. Famous food: Stroopwafel. Most famous person: Vincent van Gogh. Famous landmarks: Keukenhof, Rijksmuseum. Known for: windmills, tulips, cycling culture, and liberal policies.",
    "New Zealand": "Capital: Wellington. Population: ~5.1 million. Languages: English, Māori. Famous food: Pavlova. Most famous person: Sir Edmund Hillary. Famous landmarks: Milford Sound, Hobbiton. Known for: Lord of the Rings films, rugby (All Blacks), and kiwi birds.",
    "Nicaragua": "Capital: Managua. Population: ~6.7 million. Languages: Spanish. Famous food: Gallo pinto. Most famous person: Rubén Darío. Famous landmarks: Masaya Volcano, Granada. Known for: being the largest Central American country, lakes and volcanoes, and political unrest.",
    "Niger": "Capital: Niamey. Population: ~25.1 million. Languages: French. Famous food: Djerma stew. Most famous person: Mano Dayak. Famous landmarks: W National Park, Agadez Mosque. Known for: Saharan landscapes, uranium mining, and high fertility rate.",
    "Nigeria": "Capital: Abuja. Population: ~219 million. Languages: English. Famous food: Jollof rice. Most famous person: Chinua Achebe. Famous landmarks: Zuma Rock, Yankari National Park. Known for: being Africa's largest economy, Nollywood, oil production, and diverse cultures.",
    "North Macedonia": "Capital: Skopje. Population: ~2.1 million. Languages: Macedonian. Famous food: Tavče gravče. Most famous person: Mother Teresa. Famous landmarks: Lake Ohrid, Matka Canyon. Known for: ancient history (Alexander the Great), and name dispute with Greece.",
    "Norway": "Capital: Oslo. Population: ~5.4 million. Languages: Norwegian. Famous food: Rakfisk. Most famous person: Edvard Munch. Famous landmarks: Geirangerfjord, Viking Ship Museum. Known for: fjords, Vikings, oil wealth, midnight sun, and winter sports.",
    "Oman": "Capital: Muscat. Population: ~5.1 million. Languages: Arabic. Famous food: Shuwa. Most famous person: Qaboos bin Said. Famous landmarks: Sultan Qaboos Grand Mosque, Wahiba Sands. Known for: frankincense trade, desert forts, maritime history, and peaceful diplomacy.",
    "Pakistan": "Capital: Islamabad. Population: ~231 million. Languages: Urdu, English. Famous food: Biryani. Most famous person: Muhammad Ali Jinnah. Famous landmarks: Badshahi Mosque, K2. Known for: Indus Valley civilization, nuclear power, and Kashmir conflict.",
    "Palau": "Capital: Ngerulmud. Population: ~18,000. Languages: Palauan, English. Famous food: Fruit bat soup. Most famous person: Tommy Remengesau. Famous landmarks: Rock Islands, Jellyfish Lake. Known for: marine biodiversity, WWII wrecks, and pristine diving spots.",
    "Panama": "Capital: Panama City. Population: ~4.4 million. Languages: Spanish. Famous food: Sancocho. Most famous person: Rubén Blades. Famous landmarks: Panama Canal, Casco Viejo. Known for: the canal connecting oceans, biodiversity, and offshore banking.",
    "Papua New Guinea": "Capital: Port Moresby. Population: ~9.9 million. Languages: English, Tok Pisin. Famous food: Mumu. Most famous person: Michael Somare. Famous landmarks: Kokoda Track, Mount Wilhelm. Known for: cultural diversity, rainforests, tribal traditions, and bird of paradise.",
    "Paraguay": "Capital: Asunción. Population: ~7.3 million. Languages: Spanish, Guarani. Famous food: Sopa paraguaya. Most famous person: José Gaspar Rodríguez de Francia. Famous landmarks: Itaipu Dam, Jesuit Missions. Known for: being landlocked, Guarani culture, and yerba mate production.",
    "Peru": "Capital: Lima. Population: ~33.7 million. Languages: Spanish, Quechua. Famous food: Ceviche. Most famous person: Mario Vargas Llosa. Famous landmarks: Machu Picchu, Nazca Lines. Known for: Inca Empire, Andean landscapes, Amazon rainforest, and diverse cuisine.",
    "Philippines": "Capital: Manila. Population: ~113.9 million. Languages: Filipino, English. Famous food: Adobo. Most famous person: José Rizal. Famous landmarks: Chocolate Hills, Mayon Volcano. Known for: being an island nation, overseas workers, Catholicism in Asia, and karaoke culture.",
    "Poland": "Capital: Warsaw. Population: ~37.8 million. Languages: Polish. Famous food: Pierogi. Most famous person: Marie Curie. Famous landmarks: Wawel Castle, Auschwitz-Birkenau. Known for: Solidarity movement, WWII history, and Copernicus and Chopin.",
    "Portugal": "Capital: Lisbon. Population: ~10.3 million. Languages: Portuguese. Famous food: Bacalhau. Most famous person: Cristiano Ronaldo. Famous landmarks: Belém Tower, Pena Palace. Known for: Age of Discovery, fado music, cork production, and Cristiano Ronaldo.",
    "Qatar": "Capital: Doha. Population: ~2.9 million. Languages: Arabic. Famous food: Machboos. Most famous person: Sheikh Tamim bin Hamad Al Thani. Famous landmarks: Museum of Islamic Art, The Pearl-Qatar. Known for: natural gas wealth, 2022 FIFA World Cup, and Al Jazeera media.",
    "Romania": "Capital: Bucharest. Population: ~19 million. Languages: Romanian. Famous food: Sarmale. Most famous person: Vlad the Impaler. Famous landmarks: Bran Castle, Palace of Parliament. Known for: Transylvania, Dracula legend, Carpathian Mountains, and EU membership.",
    "Russia": "Capital: Moscow. Population: ~143.4 million. Languages: Russian. Famous food: Borscht. Most famous person: Vladimir Putin. Famous landmarks: Red Square, Hermitage Museum. Known for: being the largest country, vodka, space program, and literature (Dostoevsky, Tolstoy).",
    "Rwanda": "Capital: Kigali. Population: ~13.5 million. Languages: Kinyarwanda, French, English. Famous food: Ugali. Most famous person: Paul Kagame. Famous landmarks: Volcanoes National Park, Kigali Genocide Memorial. Known for: 1994 genocide, mountain gorillas, rapid development, and cleanliness.",
    "Saint Kitts and Nevis": "Capital: Basseterre. Population: ~53,000. Languages: English. Famous food: Goat water stew. Most famous person: Kim Collins. Famous landmarks: Brimstone Hill Fortress, Pinney's Beach. Known for: being the smallest American country, sugar plantation history, and citizenship by investment.",
    "Saint Lucia": "Capital: Castries. Population: ~184,000. Languages: English. Famous food: Green fig and saltfish. Most famous person: Derek Walcott. Famous landmarks: Pitons, Sulphur Springs. Known for: volcanic landscapes, jazz festival, and luxury resorts.",
    "Saint Vincent and the Grenadines": "Capital: Kingstown. Population: ~111,000. Languages: English. Famous food: Roasted breadfruit and jackfish. Most famous person: SVG Air. Famous landmarks: Tobago Cays, La Soufrière. Known for: Grenadines islands, sailing destinations, and banana production.",
    "Samoa": "Capital: Apia. Population: ~200,000. Languages: Samoan, English. Famous food: Palusami. Most famous person: Dwayne 'The Rock' Johnson. Famous landmarks: To Sua Ocean Trench, Robert Louis Stevenson Museum. Known for: Fa'a Samoa traditions, rugby, being first to see new day, and natural beauty.",
    "San Marino": "Capital: San Marino. Population: ~34,000. Languages: Italian. Famous food: Torta Tre Monti. Most famous person: Saint Marinus. Famous landmarks: Guaita Tower, Basilica di San Marino. Known for: being the oldest republic, microstate, Mount Titano, and philately.",
    "Sao Tome and Principe": "Capital: São Tomé. Population: ~223,000. Languages: Portuguese. Famous food: Calulu. Most famous person: Manuel Pinto da Costa. Famous landmarks: Obo National Park, Pico Cão Grande. Known for: chocolate production, island biodiversity, and Portuguese colonial architecture.",
    "Saudi Arabia": "Capital: Riyadh. Population: ~35.9 million. Languages: Arabic. Famous food: Kabsa. Most famous person: King Salman. Famous landmarks: Masmak Fortress, Al-Ula. Known for: being the birthplace of Islam, oil reserves, and conservative monarchy.",
    "Senegal": "Capital: Dakar. Population: ~17.2 million. Languages: French. Famous food: Thieboudienne. Most famous person: Léopold Sédar Senghor. Famous landmarks: Gorée Island, Lake Retba. Known for: Teranga hospitality, music scene, and Dakar Rally.",
    "Serbia": "Capital: Belgrade. Population: ~6.7 million. Languages: Serbian. Famous food: Ćevapi. Most famous person: Nikola Tesla. Famous landmarks: Belgrade Fortress, Studenica Monastery. Known for: Balkan crossroads, Novak Djokovic, and Orthodox Christian heritage.",
    "Seychelles": "Capital: Victoria. Population: ~99,000. Languages: Seychellois Creole, English, French. Famous food: Ladob. Most famous person: France-Albert René. Famous landmarks: Anse Source d'Argent, Vallée de Mai. Known for: luxury tourism, giant tortoises, pristine beaches, and coco de mer.",
    "Sierra Leone": "Capital: Freetown. Population: ~8.4 million. Languages: English. Famous food: Cassava leaves. Most famous person: Bai Bureh. Famous landmarks: Tacugama Chimpanzee Sanctuary, Bunce Island. Known for: blood diamond history, civil war, and founding home for freed slaves.",
    "Singapore": "Capital: Singapore. Population: ~5.9 million. Languages: English, Malay, Mandarin, Tamil. Famous food: Hainanese chicken rice. Most famous person: Lee Kuan Yew. Famous landmarks: Marina Bay Sands, Gardens by the Bay. Known for: strict laws, financial hub, multicultural society, and efficiency.",
    "Slovakia": "Capital: Bratislava. Population: ~5.5 million. Languages: Slovak. Famous food: Bryndzové halušky. Most famous person: Alexander Dubček. Famous landmarks: Bratislava Castle, High Tatras. Known for: Carpathian Mountains, EU membership, and medieval castles.",
    "Slovenia": "Capital: Ljubljana. Population: ~2.1 million. Languages: Slovenian. Famous food: Kranjska klobasa. Most famous person: Melania Trump. Famous landmarks: Lake Bled, Postojna Cave. Known for: Alpine scenery, EU membership, and Triglav National Park.",
    "Solomon Islands": "Capital: Honiara. Population: ~720,000. Languages: English. Famous food: Poi. Most famous person: Nathaniel Waena. Famous landmarks: Marovo Lagoon, Kennedy Island. Known for: WWII history, coral reefs, and Melanesian culture.",
    "Somalia": "Capital: Mogadishu. Population: ~17.1 million. Languages: Somali, Arabic. Famous food: Canjeero. Most famous person: Iman. Famous landmarks: Laas Geel, Mogadishu Cathedral. Known for: long coastline, civil war, piracy, and nomadic traditions.",
    "South Africa": "Capital: Pretoria (administrative), Cape Town (legislative), Bloemfontein (judicial). Population: ~60.1 million. Languages: 11 official including Zulu, Xhosa, Afrikaans, English. Famous food: Braai. Most famous person: Nelson Mandela. Famous landmarks: Table Mountain, Kruger National Park. Known for: Apartheid history, Nelson Mandela, biodiversity, and wine production.",
    "South Sudan": "Capital: Juba. Population: ~11.4 million. Languages: English. Famous food: Kisra. Most famous person: Salva Kiir Mayardit. Famous landmarks: Boma National Park, Sudd wetlands. Known for: being the world's newest country (2011), civil conflicts, and oil reserves.",
    "Spain": "Capital: Madrid. Population: ~47.4 million. Languages: Spanish. Famous food: Paella. Most famous person: Pablo Picasso. Famous landmarks: Sagrada Familia, Alhambra. Known for: flamenco, siesta culture, football (La Liga), and diverse regions.",
    "Sri Lanka": "Capital: Colombo (executive), Sri Jayawardenepura Kotte (legislative). Population: ~22.2 million. Languages: Sinhala, Tamil. Famous food: Rice and curry. Most famous person: Mahinda Rajapaksa. Famous landmarks: Sigiriya, Temple of the Tooth. Known for: tea production, civil war, beaches, and biodiversity.",
    "Sudan": "Capital: Khartoum. Population: ~45.7 million. Languages: Arabic, English. Famous food: Ful medames. Most famous person: Omar al-Bashir. Famous landmarks: Meroë Pyramids, Jebel Barkal. Known for: ancient Nubian civilization, Darfur conflict, and recent division.",
    "Suriname": "Capital: Paramaribo. Population: ~612,000. Languages: Dutch. Famous food: Pom. Most famous person: Ronnie Brunswijk. Famous landmarks: Brownsberg Nature Park, Central Suriname Nature Reserve. Known for: rainforests, Dutch colonial heritage, and diverse ethnic groups.",
    "Sweden": "Capital: Stockholm. Population: ~10.4 million. Languages: Swedish. Famous food: Köttbullar. Most famous person: Greta Thunberg. Famous landmarks: Vasa Museum, Icehotel. Known for: IKEA, ABBA, welfare state, Nobel Prize, and midnight sun.",
    "Switzerland": "Capital: Bern. Population: ~8.7 million. Languages: German, French, Italian, Romansh. Famous food: Fondue. Most famous person: Roger Federer. Famous landmarks: Matterhorn, Château de Chillon. Known for: neutrality, watches, banking, Alps, and chocolate.",
    "Syria": "Capital: Damascus. Population: ~21.3 million. Languages: Arabic. Famous food: Kibbeh. Most famous person: Hafez al-Assad. Famous landmarks: Palmyra, Umayyad Mosque. Known for: ancient civilizations, ongoing civil war, and Damascus steel.",
    "Taiwan": "Capital: Taipei. Population: ~23.6 million. Languages: Mandarin. Famous food: Beef noodle soup. Most famous person: Ang Lee. Famous landmarks: Taipei 101, Taroko Gorge. Known for: semiconductor industry, disputed sovereignty, and night markets.",
    "Tajikistan": "Capital: Dushanbe. Population: ~9.8 million. Languages: Tajik. Famous food: Plov. Most famous person: Emomali Rahmon. Famous landmarks: Pamir Highway, Iskanderkul. Known for: mountainous terrain, civil war history, and Persian culture.",
    "Tanzania": "Capital: Dodoma. Population: ~63.6 million. Languages: Swahili, English. Famous food: Ugali. Most famous person: Julius Nyerere. Famous landmarks: Mount Kilimanjaro, Serengeti National Park. Known for: wildlife safaris, Zanzibar, Ngorongoro Crater, and Swahili language.",
    "Thailand": "Capital: Bangkok. Population: ~70.0 million. Languages: Thai. Famous food: Pad Thai. Most famous person: King Bhumibol Adulyadej. Famous landmarks: Grand Palace, Wat Arun. Known for: Buddhist temples, beaches, cuisine, and Land of Smiles.",
    "Togo": "Capital: Lomé. Population: ~8.6 million. Languages: French. Famous food: Fufu. Most famous person: Gnassingbé Eyadéma. Famous landmarks: Koutammakou, Togoville. Known for: voodoo traditions, phosphate mining, and colonial architecture.",
    "Tonga": "Capital: Nuku'alofa. Population: ~106,000. Languages: Tongan, English. Famous food: Lu pulu. Most famous person: Tupou VI. Famous landmarks: Mapu'a 'a Vaea blowholes, Ha'amonga 'a Maui. Known for: being the last Polynesian monarchy, rugby, and missionary influence.",
    "Trinidad and Tobago": "Capital: Port of Spain. Population: ~1.4 million. Languages: English. Famous food: Doubles. Most famous person: Brian Lara. Famous landmarks: Maracas Beach, Pitch Lake. Known for: Carnival, steelpan music, oil and gas, and diverse culture.",
    "Tunisia": "Capital: Tunis. Population: ~11.9 million. Languages: Arabic. Famous food: Couscous. Most famous person: Habib Bourguiba. Famous landmarks: Amphitheatre of El Jem, Sidi Bou Said. Known for: Arab Spring origin, ancient Carthage, and Mediterranean beaches.",
    "Turkey": "Capital: Ankara. Population: ~85.0 million. Languages: Turkish. Famous food: Kebab. Most famous person: Mustafa Kemal Atatürk. Famous landmarks: Hagia Sophia, Cappadocia. Known for: Ottoman Empire, bridge between continents, and Turkish delight.",
    "Turkmenistan": "Capital: Ashgabat. Population: ~6.3 million. Languages: Turkmen. Famous food: Plov. Most famous person: Saparmurat Niyazov. Famous landmarks: Darvaza Gas Crater, Ancient Merv. Known for: gas reserves, authoritarian government, and white marble buildings.",
    "Tuvalu": "Capital: Funafuti. Population: ~11,000. Languages: Tuvaluan, English. Famous food: Pulaka. Most famous person: Kausea Natano. Famous landmarks: Funafuti Conservation Area, Nanumea Atoll. Known for: climate change vulnerability, .tv domain, and remote Pacific atolls.",
    "Uganda": "Capital: Kampala. Population: ~47.1 million. Languages: English, Swahili. Famous food: Matoke. Most famous person: Idi Amin. Famous landmarks: Bwindi Impenetrable Forest, Murchison Falls. Known for: mountain gorillas, Pearl of Africa, and Nile River source.",
    "Ukraine": "Capital: Kyiv. Population: ~43.8 million. Languages: Ukrainian. Famous food: Borscht. Most famous person: Volodymyr Zelensky. Famous landmarks: Saint Sophia's Cathedral, Chernobyl Exclusion Zone. Known for: being the breadbasket of Europe, ongoing war with Russia, and Orthodox churches.",
    "United Arab Emirates": "Capital: Abu Dhabi. Population: ~9.9 million. Languages: Arabic. Famous food: Shawarma. Most famous person: Sheikh Zayed bin Sultan Al Nahyan. Famous landmarks: Burj Khalifa, Sheikh Zayed Grand Mosque. Known for: oil wealth, luxury shopping, expat majority, and futuristic cities.",
    "United Kingdom": "Capital: London. Population: ~67.3 million. Languages: English. Famous food: Fish and chips. Most famous person: Queen Elizabeth II. Famous landmarks: Big Ben, Stonehenge. Known for: British Empire, monarchy, Shakespeare, The Beatles, and football.",
    "United States": "Capital: Washington, D.C.. Population: ~331 million. Languages: English. Famous food: Hamburger. Most famous person: Abraham Lincoln. Famous landmarks: Statue of Liberty, Grand Canyon. Known for: being a global superpower, Hollywood, diverse landscapes, and innovation hub.",
    "Uruguay": "Capital: Montevideo. Population: ~3.5 million. Languages: Spanish. Famous food: Chivito. Most famous person: Luis Suárez. Famous landmarks: Punta del Este, Colonia del Sacramento. Known for: progressive policies, football (Suárez, Forlán), and mate drinking.",
    "Uzbekistan": "Capital: Tashkent. Population: ~35.6 million. Languages: Uzbek. Famous food: Plov. Most famous person: Amir Timur. Famous landmarks: Registan, Samarkand. Known for: Silk Road cities, Islamic architecture, and cotton production.",
    "Vanuatu": "Capital: Port Vila. Population: ~315,000. Languages: Bislama, English, French. Famous food: Lap lap. Most famous person: Walter Lini. Famous landmarks: Mount Yasur, Millennium Cave. Known for: volcanic islands, happy planet index, and land diving ritual.",
    "Vatican City": "Capital: Vatican City. Population: ~800. Languages: Latin, Italian. Famous food: N/A. Most famous person: Pope Francis. Famous landmarks: St. Peter's Basilica, Sistine Chapel. Known for: being the smallest country, center of Catholicism, Pope, and Swiss Guard.",
    "Venezuela": "Capital: Caracas. Population: ~28.4 million. Languages: Spanish. Famous food: Arepa. Most famous person: Simón Bolívar. Famous landmarks: Angel Falls, Mount Roraima. Known for: oil reserves, economic crisis, Miss Universe winners, and baseball.",
    "Vietnam": "Capital: Hanoi. Population: ~98.2 million. Languages: Vietnamese. Famous food: Phở. Most famous person: Ho Chi Minh. Famous landmarks: Ha Long Bay, Hoi An Ancient Town. Known for: Vietnam War, economic growth, ao dai dresses, and coffee culture.",
    "Yemen": "Capital: Sana'a. Population: ~33 million. Languages: Arabic. Famous food: Saltah. Most famous person: Ali Abdullah Saleh. Famous landmarks: Old City of Sana'a, Socotra Island. Known for: ancient civilization, ongoing civil war, coffee origin, and frankincense.",
    "Zambia": "Capital: Lusaka. Population: ~19.5 million. Languages: English. Famous food: Nshima. Most famous person: Kenneth Kaunda. Famous landmarks: Victoria Falls, South Luangwa National Park. Known for: copper mining, wildlife safaris, and Zambezi River.",
    "Zimbabwe": "Capital: Harare. Population: ~15.1 million. Languages: English, Shona, Ndebele. Famous food: Sadza. Most famous person: Robert Mugabe. Famous landmarks: Victoria Falls, Great Zimbabwe Ruins. Known for: hyperinflation, Robert Mugabe legacy, and wildlife conservation.",
    "American Samoa": "Capital: Pago Pago. Population: ~45,000. Languages: Samoan, English. Famous food: Palusami. Most famous person: Dwayne 'The Rock' Johnson (part-Samoan heritage). Famous landmarks: National Park of American Samoa. Known for: traditional Polynesian culture, tuna canneries, and stunning natural beauty.",
    "United States Minor Outlying Islands": "Capital: N/A. Population: ~300. Languages: English. Famous food: N/A. Most famous person: N/A. Famous landmarks: N/A. Known for: being scattered Pacific islands with military and scientific importance.",
    "Cook Islands": "Capital: Avarua. Population: ~17,000. Languages: Cook Islands Māori, English. Famous food: Ika mata. Most famous person: Makiuti Tongia. Famous landmarks: Aitutaki Lagoon. Known for: Polynesian culture, beautiful lagoons, and association with New Zealand.",
    "French Polynesia": "Capital: Papeete. Population: ~280,000. Languages: French, Tahitian. Famous food: Poisson cru. Most famous person: Paul Gauguin. Famous landmarks: Bora Bora lagoon. Known for: overwater bungalows, black pearls, and French overseas territory status.",
    "Niue": "Capital: Alofi. Population: ~1,600. Languages: Niuean, English. Famous food: Takihi. Most famous person: Toke Talagi. Famous landmarks: Limu Pools. Known for: being one of world's smallest countries, coral island, and free WiFi nationwide.",
    "Pitcairn": "Capital: Adamstown. Population: ~50. Languages: English, Pitkern. Famous food: Breadfruit dishes. Most famous person: Fletcher Christian. Famous landmarks: Bounty Bay. Known for: being the least populous jurisdiction, mutiny on the Bounty descendants, and remote island.",
    "Tokelau": "Capital: N/A. Population: ~1,500. Languages: Tokelauan, English. Famous food: Coconut crab. Most famous person: N/A. Famous landmarks: Nukunonu Lagoon. Known for: being a New Zealand territory, atoll islands, and smallest economy.",
    "Wallis and Futuna": "Capital: Mata-Utu. Population: ~11,000. Languages: French, Wallisian, Futunan. Famous food: Po'e. Most famous person: N/A. Famous landmarks: Lake Lalolalo. Known for: French overseas collectivity, traditional kingdoms, and Polynesian culture.",
    "Falkland Islands": "Capital: Stanley. Population: ~3,500. Languages: English. Famous food: Fish and chips. Most famous person: N/A. Famous landmarks: Gypsy Cove. Known for: British overseas territory, penguin colonies, and 1982 war with Argentina.",
    "South Georgia and South Sandwich Islands": "Capital: King Edward Point. Population: ~30. Languages: English. Famous food: N/A. Most famous person: Ernest Shackleton. Famous landmarks: Grytviken whaling station. Known for: British overseas territory, subantarctic wildlife, and scientific research.",
    "Antarctica": "Capital: N/A. Population: ~1,000-5,000 (seasonal). Languages: Various. Famous food: N/A. Most famous person: Roald Amundsen. Famous landmarks: Mount Erebus, South Pole. Known for: being the southernmost continent, scientific research, and extreme climate.",
    "Saint Helena": "Capital: Jamestown. Population: ~4,500. Languages: English. Famous food: Fishcakes. Most famous person: Napoleon Bonaparte. Famous landmarks: Longwood House. Known for: British overseas territory, Napoleon's exile, and remote island.",
    "Anguilla": "Capital: The Valley. Population: ~15,000. Languages: English. Famous food: Pigeon peas and rice. Most famous person: Bankie Banx. Famous landmarks: Shoal Bay East. Known for: British overseas territory, luxury tourism, and coral reefs.",
    "Aruba": "Capital: Oranjestad. Population: ~107,000. Languages: Dutch, Papiamento. Famous food: Keshi yena. Most famous person: Dave Benton. Famous landmarks: Eagle Beach. Known for: Dutch constituent country, white sand beaches, and tourism.",
    "Bermuda": "Capital: Hamilton. Population: ~64,000. Languages: English. Famous food: Bermuda fish chowder. Most famous person: Lena Headey. Famous landmarks: Horseshoe Bay Beach. Known for: British overseas territory, Bermuda Triangle, and pink sand beaches.",
    "Bonaire": "Capital: Kralendijk. Population: ~20,000. Languages: Dutch, Papiamento. Famous food: Kabritu stoba. Most famous person: N/A. Famous landmarks: Washington Slagbaai National Park. Known for: Dutch special municipality, scuba diving, and flamingos.",
    "British Virgin Islands": "Capital: Road Town. Population: ~30,000. Languages: English. Famous food: Fish and fungi. Most famous person: N/A. Famous landmarks: The Baths. Known for: British overseas territory, sailing destination, and offshore finance.",
    "Cayman Islands": "Capital: George Town. Population: ~66,000. Languages: English. Famous food: Turtle stew. Most famous person: N/A. Famous landmarks: Seven Mile Beach. Known for: British overseas territory, financial services, and diving.",
    "Curacao": "Capital: Willemstad. Population: ~163,000. Languages: Dutch, Papiamento. Famous food: Stoba. Most famous person: N/A. Famous landmarks: Queen Emma Bridge. Known for: Dutch constituent country, colorful architecture, and beaches.",
    "French Guiana": "Capital: Cayenne. Population: ~300,000. Languages: French. Famous food: Bouillon d'awara. Most famous person: N/A. Famous landmarks: Devil's Island. Known for: French overseas department, spaceport, and Amazon rainforest.",
    "Guadeloupe": "Capital: Basse-Terre. Population: ~400,000. Languages: French. Famous food: Colombo. Most famous person: N/A. Famous landmarks: La Soufrière. Known for: French overseas region, Creole culture, and beaches.",
    "Martinique": "Capital: Fort-de-France. Population: ~375,000. Languages: French. Famous food: Accras. Most famous person: Aimé Césaire. Famous landmarks: Mount Pelée. Known for: French overseas region, rum production, and Creole culture.",
    "Montserrat": "Capital: Plymouth (abandoned), Brades (de facto). Population: ~5,000. Languages: English. Famous food: Goat water. Most famous person: N/A. Famous landmarks: Soufrière Hills volcano. Known for: British overseas territory, volcanic eruptions, and Irish heritage.",
    "Puerto Rico": "Capital: San Juan. Population: ~3.2 million. Languages: Spanish, English. Famous food: Mofongo. Most famous person: Ricky Martin. Famous landmarks: El Morro. Known for: U.S. territory, tropical climate, and bioluminescent bays.",
    "Saba": "Capital: The Bottom. Population: ~2,000. Languages: Dutch, English. Famous food: N/A. Most famous person: N/A. Famous landmarks: Mount Scenery. Known for: Dutch special municipality, smallest island in Caribbean, and diving.",
    "Saint Barthelemy": "Capital: Gustavia. Population: ~10,000. Languages: French. Famous food: Lobster. Most famous person: N/A. Famous landmarks: Shell Beach. Known for: French overseas collectivity, luxury tourism, and beaches.",
    "Saint Eustatius": "Capital: Oranjestad. Population: ~3,200. Languages: Dutch, English. Famous food: N/A. Most famous person: N/A. Famous landmarks: The Quill. Known for: Dutch special municipality, historic trade center, and diving.",
    "Saint Martin": "Capital: Marigot. Population: ~38,000. Languages: French. Famous food: N/A. Most famous person: N/A. Famous landmarks: Orient Bay Beach. Known for: French overseas collectivity, divided island with Netherlands, and beaches.",
    "Saint Pierre and Miquelon": "Capital: Saint-Pierre. Population: ~6,000. Languages: French. Famous food: N/A. Most famous person: N/A. Famous landmarks: L'Île-aux-Marins. Known for: French overseas collectivity, last French territory in North America, and fishing.",
    "Sint Maarten": "Capital: Philipsburg. Population: ~42,000. Languages: Dutch, English. Famous food: N/A. Most famous person: N/A. Famous landmarks: Maho Beach. Known for: Dutch constituent country, divided island with France, and beaches.",
    "Turks and Caicos Islands": "Capital: Cockburn Town. Population: ~39,000. Languages: English. Famous food: Conch fritters. Most famous person: N/A. Famous landmarks: Grace Bay Beach. Known for: British overseas territory, luxury tourism, and diving.",
    "US Virgin Islands": "Capital: Charlotte Amalie. Population: ~105,000. Languages: English. Famous food: Pate. Most famous person: N/A. Famous landmarks: Trunk Bay. Known for: U.S. territory, beaches, and duty-free shopping.",
    "Gibraltar": "Capital: Gibraltar. Population: ~34,000. Languages: English. Famous food: Calentita. Most famous person: N/A. Famous landmarks: Rock of Gibraltar. Known for: British overseas territory, strategic location, and Barbary macaques.",
    "Faroe Islands": "Capital: Tórshavn. Population: ~53,000. Languages: Faroese, Danish. Famous food: Ræst kjøt. Most famous person: N/A. Famous landmarks: Múlafossur Waterfall. Known for: Danish autonomous territory, sheep farming, and remote islands.",
    "Svalbard": "Capital: Longyearbyen. Population: ~2,600. Languages: Norwegian. Famous food: N/A. Most famous person: N/A. Famous landmarks: Global Seed Vault. Known for: Norwegian territory, Arctic research, and polar bears.",
    "Bouvet Island": "Capital: N/A. Population: 0. Languages: N/A. Famous food: N/A. Most famous person: N/A. Famous landmarks: N/A. Known for: Norwegian dependency, uninhabited subantarctic island, and research.",
    "Juan De Nova Island": "Capital: N/A. Population: ~15 (military). Languages: French. Famous food: N/A. Most famous person: N/A. Famous landmarks: N/A. Known for: French territory, guano mining, and wildlife sanctuary.",
    "Glorioso Islands": "Capital: N/A. Population: 0. Languages: French. Famous food: N/A. Most famous person: N/A. Famous landmarks: N/A. Known for: French territory, uninhabited atoll, and nature reserve.",
    "Réunion": "Capital: Saint-Denis. Population: ~860,000. Languages: French. Famous food: Rougail saucisse. Most famous person: N/A. Famous landmarks: Piton de la Fournaise. Known for: French overseas department, volcanic island, and Creole culture.",
    "Mayotte": "Capital: Mamoudzou. Population: ~280,000. Languages: French, Shimaore. Famous food: Mataba. Most famous person: N/A. Famous landmarks: Saziley National Park. Known for: French overseas department, Comoros claim, and coral reefs.",
    "British Indian Ocean Territory": "Capital: N/A. Population: ~3,000 (military). Languages: English. Famous food: N/A. Most famous person: N/A. Famous landmarks: Diego Garcia. Known for: British overseas territory, military base, and coral atolls."
}