{
    "Afghanistan": "Capital: Kabul. Languages: Pashto, Dari. Population: ~40.1 million. Currency: Afghani (AFN). Known for rugged mountainous terrain, historic Silk Road location, and decades of conflict. Also famous for: Buzkashi (sport), carpets, and dried fruits. Food: Kabuli Palaw (rice dish). Religion: Islam (predominantly Sunni). Climate: Arid to semiarid; cold winters and hot summers. Brief History: Crossroads of civilizations; invaded by many empires; recent decades marked by Soviet invasion, civil war, and Taliban rule.",
    "Albania": "Capital: Tirana. Languages: Albanian. Population: ~2.8 million. Currency: Albanian Lek (ALL). Known for beautiful beaches, bunkers from communist era, and unique language isolate. Also famous for: Balkan cuisine, Albanian Riviera, and Ismail Kadare (writer). Food: Byrek (savory pie). Religion: Islam, Christianity (Orthodox and Catholic). Climate: Mediterranean; mild winters and hot, dry summers. Brief History: Part of Ottoman Empire; independent in 1912; communist regime until 1990s; now a parliamentary republic.",
    "Algeria": "Capital: Algiers. Languages: Arabic, Berber. Population: ~44.6 million. Currency: Algerian Dinar (DZD). Known for being the largest country in Africa, Sahara Desert, and oil and gas reserves. Also famous for: Casbah of Algiers, rai music, and Couscous. Food: Couscous. Religion: Islam (Sunni). Climate: Arid to semiarid; mild, wet winters and hot, dry summers along the coast. Brief History: Part of Ottoman Empire, then French colony; gained independence in 1962 after a war; significant Berber population.",
    "Andorra": "Capital: Andorra la Vella. Languages: Catalan. Population: ~77,000. Currency: Euro (€). Known for ski resorts, tax haven status, and being a tiny mountainous principality. Also famous for: duty-free shopping, Pyrenees Mountains, and Romanesque architecture. Food: Trinxat (potato and cabbage dish). Religion: Christianity (Catholic). Climate: Alpine; cold winters and mild summers. Brief History: Founded as a buffer state by Charlemagne; co-principality ruled by French president and Spanish bishop since 1278; transformed from poor country to wealthy tourist destination in 20th century.",
    "Angola": "Capital: Luanda. Languages: Portuguese. Population: ~34.5 million. Currency: Angolan Kwanza (AOA). Known for oil production, Portuguese colonial architecture, and long civil war. Also famous for: Angolan Civil War, beaches near Luanda, and Kizomba dance. Food: Moamba de Galinha (chicken stew). Religion: Christianity (Catholic, Protestant). Climate: Tropical to subtropical; dry season (May to October) and rainy season (November to April). Brief History: Portuguese colony for centuries; gained independence in 1975; civil war lasted until 2002; now a republic focused on oil export.",
    "Antigua and Barbuda": "Capital: St. John's. Languages: English. Population: ~98,000. Currency: East Caribbean Dollar (XCD). Known for 365 beaches, luxury resorts, and sailing destinations. Also famous for: Nelson's Dockyard (UNESCO site), Carnival celebrations, and cricket (producing world-class players). Food: Fungi and pepperpot (cornmeal and stew). Religion: Christianity (Anglican majority). Climate: Tropical maritime; warm year-round with rainy season (September-November). Brief History: British colony; gained independence in 1981; economy heavily reliant on tourism; named by Columbus in 1493.",
    "Argentina": "Capital: Buenos Aires. Languages: Spanish. Population: ~45.8 million. Currency: Argentine Peso (ARS). Known for tango, beef production, Patagonia region, and Maradona and Messi. Also famous for: wine (Malbec), Iguazu Falls, and Evita Perón. Food: Asado (barbecue). Religion: Christianity (Catholic). Climate: Varied; subtropical in the north, arid in the Andes, and subpolar in Patagonia. Brief History: Spanish colony; gained independence in 1816; experienced periods of military rule and economic instability; known for its European heritage.",
    "Armenia": "Capital: Yerevan. Languages: Armenian. Population: ~2.9 million. Currency: Armenian Dram (AMD). Known for being the first Christian nation, chess masters, and Armenian Genocide memory. Also famous for: Mount Ararat views, ancient monasteries, and brandy production. Food: Harissa (wheat and meat porridge). Religion: Armenian Apostolic Church (Christianity). Climate: Highland continental; cold winters and warm summers. Brief History: First Christian nation in 301 AD; part of various empires; Armenian Genocide in early 20th century; independent republic since 1991.",
    "Australia": "Capital: Canberra. Languages: English. Population: ~26.0 million. Currency: Australian Dollar (AUD). Known for the Outback, kangaroos, the Great Barrier Reef, and surfing culture. Also famous for: Sydney Opera House, unique wildlife (koalas, wombats), and Aboriginal culture. Food: Meat pie, Vegemite. Religion: No religion, Christianity. Climate: Varied; arid in the interior, tropical in the north, temperate in the southeast. Brief History: Inhabited by Aboriginal Australians for tens of thousands of years; British colony from 1788; independent nation since 1901.",
    "Austria": "Capital: Vienna. Languages: German. Population: ~9.0 million. Currency: Euro (€). Known for the Alps, classical music (Mozart, Strauss), skiing, and coffeehouse culture. Also famous for: sacher torte, schnitzel, and imperial palaces. Food: Wiener Schnitzel (breaded veal cutlet). Religion: Christianity (Catholic). Climate: Temperate; cold winters and warm summers. Brief History: Center of the Habsburg Empire for centuries; part of the Austro-Hungarian Empire; neutral republic since World War II.",
    "Azerbaijan": "Capital: Baku. Languages: Azerbaijani. Population: ~10.1 million. Currency: Azerbaijani Manat (AZN). Known for oil reserves, fire mountain (Yanar Dag), and Eurovision 2011 winner. Also famous for: mud volcanoes, carpets, and Mugham music. Food: Plov (rice pilaf). Religion: Islam (Shia). Climate: Varied; subtropical to temperate; dry to humid. Brief History: Part of Persian and Russian empires; independent in 1918; Soviet republic; independent republic since 1991; conflict with Armenia over Nagorno-Karabakh.",
    "The Bahamas": "Capital: Nassau. Languages: English. Population: ~400,000. Currency: Bahamian Dollar (BSD). Known for crystal clear waters, luxury resorts, and swimming pigs. Also famous for: straw markets, Junkanoo festival, and conch. Food: Conch salad. Religion: Christianity (Baptist, other Protestant). Climate: Tropical marine; warm and sunny year-round with a hurricane season (June to November). Brief History: British colony; gained independence in 1973; relies heavily on tourism and offshore banking.",
    "Bahrain": "Capital: Manama. Languages: Arabic. Population: ~1.5 million. Currency: Bahraini Dinar (BHD). Known for pearl diving history, Formula 1 Grand Prix, and financial hub status. Also famous for: Dilmun civilization ruins, traditional dhow boats, and dates. Food: Machboos (spiced meat and rice). Religion: Islam (Shia and Sunni). Climate: Arid; hot summers and mild winters. Brief History: Ancient Dilmun civilization; British protectorate; independent in 1971; financial and commercial hub in the Gulf region.",
    "Bangladesh": "Capital: Dhaka. Languages: Bengali. Population: ~169.4 million. Currency: Bangladeshi Taka (BDT). Known for the world's largest river delta, garment industry, and frequent flooding. Also famous for: rickshaws, mangrove forests (Sundarbans), and hilsa fish. Food: Rice and fish curry. Religion: Islam. Climate: Tropical monsoon; hot, humid summers and mild winters. Brief History: Part of British India (Bengal); East Pakistan after partition in 1947; independent Bangladesh in 1971 after a liberation war; densely populated and prone to natural disasters.",
    "Barbados": "Capital: Bridgetown. Languages: English. Population: ~287,000. Currency: Barbadian Dollar (BBD). Known for Rihanna, rum production, cricket, and British colonial history. Also famous for: beaches, Crop Over festival, and flying fish. Food: Cou-Cou and Flying Fish. Religion: Christianity (Anglican, other Protestant). Climate: Tropical marine; warm and sunny year-round with a rainy season (June to November). Brief History: British colony; gained independence in 1966; strong parliamentary democracy; relies on tourism and sugarcane production.",
    "Belarus": "Capital: Minsk. Languages: Belarusian, Russian. Population: ~9.3 million. Currency: Belarusian Ruble (BYN). Known for being the last dictatorship in Europe, vast forests, and an IT outsourcing hub. Also famous for: World War II history, tractors, and potato dishes. Food: Draniki (potato pancakes). Religion: Eastern Orthodox Christianity. Climate: Continental; cold winters and cool summers. Brief History: Part of the Grand Duchy of Lithuania and Polish-Lithuanian Commonwealth; part of the Soviet Union; independent since 1991; close ties with Russia.",
    "Belgium": "Capital: Brussels. Languages: Dutch, French, German. Population: ~11.6 million. Currency: Euro (€). Known for EU headquarters, chocolate, beer, and comic books (Tintin, Smurfs). Also famous for: waffles, medieval cities (Bruges, Ghent), and surrealist art. Food: Moules-frites (mussels and fries). Religion: Christianity (Catholic). Climate: Temperate maritime; mild winters and cool summers. Brief History: Crossroads of Europe; part of the Burgundian Netherlands; independent kingdom since 1830; played a significant role in both World Wars; hosts many international organizations.",
    "Belize": "Capital: Belmopan. Languages: English (official), Spanish, Kriol. Population: ~400,000. Currency: Belize Dollar (BZD). Known for the Belize Barrier Reef (2nd largest in world), Mayan ruins, and being the only Central American country with English as official language. Also famous for: Great Blue Hole, diverse wildlife (jaguars, manatees), and Garifuna culture. Food: Rice and beans with stewed chicken. Religion: Christianity (Catholic, Protestant). Climate: Tropical; hot and humid with rainy season (June-November). Brief History: Heart of Mayan civilization; British Honduras until 1973; name changed to Belize in 1973; territorial dispute with Guatemala.",
    "Benin": "Capital: Porto-Novo. Languages: French. Population: ~12.5 million. Currency: West African CFA franc (XOF). Known for being the birthplace of voodoo, slave coast history, and cotton production. Also famous for: Pendjari National Park, Ganvie floating village, and Tata Somba fortified houses. Food: Amiwo (cornmeal porridge). Religion: Voodoo, Christianity, Islam. Climate: Tropical; hot and humid with a rainy season (April to October). Brief History: Part of Dahomey kingdom (slave trade); French colony; gained independence in 1960; transitioned to a multi-party democracy.",
    "Bhutan": "Capital: Thimphu. Languages: Dzongkha. Population: ~780,000. Currency: Bhutanese Ngultrum (BTN). Known for Gross National Happiness index, Buddhist culture, and Himalayan landscapes. Also famous for: Tiger's Nest Monastery, strict tourism policies, and environmental conservation. Food: Ema datshi (chili cheese stew). Religion: Buddhism (Vajrayana). Climate: Varies with altitude; subtropical in south to alpine in north. Brief History: Unified in 17th century; never colonized; monarchy established 1907; transitioned to constitutional monarchy in 2008.",
    "Bolivia": "Capital: Sucre (official), La Paz (administrative). Languages: Spanish, Quechua, Aymara. Population: ~11.8 million. Currency: Bolivian Boliviano (BOB). Known for having the highest capital city (La Paz), indigenous cultures, and lithium reserves. Also famous for: Salar de Uyuni (salt flats), Lake Titicaca, and coca production. Food: Salteñas (savory pastries). Religion: Christianity (Catholic), Indigenous beliefs. Climate: Varied; tropical in the lowlands, arid in the Altiplano, and temperate in the valleys. Brief History: Spanish colony; gained independence in 1825; named after Simón Bolívar; historically unstable politically; significant indigenous population.",
    "Bosnia and Herzegovina": "Capital: Sarajevo. Languages: Bosnian, Serbian, Croatian. Population: ~3.3 million. Currency: Convertible Mark (BAM). Known for ethnic diversity, 1990s war, and beautiful Ottoman-era architecture. Also famous for: Stari Most bridge in Mostar, Winter Olympics (1984), and coffee culture. Food: Ćevapi (grilled minced meat). Religion: Islam, Orthodox Christianity, Catholicism. Climate: Continental; cold winters and warm summers. Brief History: Part of Ottoman Empire; annexed by Austria-Hungary 1878; part of Yugoslavia; independence 1992 followed by devastating war; remains ethnically divided.",
    "Botswana": "Capital: Gaborone. Languages: English, Setswana. Population: ~2.4 million. Currency: Botswana Pula (BWP). Known for diamond mining, stable democracy, and wildlife safaris. Also famous for: Okavango Delta, Chobe National Park, and San people culture. Food: Seswaa (pounded meat). Religion: Christianity, Traditional beliefs. Climate: Semiarid; hot and dry with a rainy season (November to March). Brief History: British protectorate (Bechuanaland); gained independence in 1966; stable democracy and strong economy based on diamond mining.",
    "Brazil": "Capital: Brasília. Languages: Portuguese. Population: ~214 million. Currency: Brazilian Real (BRL). Known for Carnival, soccer (Pelé, Ronaldo), samba, and vast biodiversity. Also famous for: Amazon rainforest, Christ the Redeemer statue, and beaches (Copacabana, Ipanema). Food: Feijoada (black bean stew). Religion: Christianity (Catholic, Protestant). Climate: Varied; tropical in the north, temperate in the south. Brief History: Portuguese colony; gained independence in 1822; largest country in South America; significant economic and social inequality.",
    "Brunei": "Capital: Bandar Seri Begawan. Languages: Malay. Population: ~440,000. Currency: Brunei Dollar (BND). Known for oil wealth, absolute monarchy, and strict Islamic laws. Also famous for: Omar Ali Saifuddien Mosque, rainforest conservation, and no income tax. Food: Ambuyat (tapioca starch dish). Religion: Islam (official). Climate: Tropical rainforest; hot and humid year-round. Brief History: Powerful sultanate (14th-16th century); British protectorate (1888-1984); gained independence in 1984; wealth from oil/gas reserves.",
    "Bulgaria": "Capital: Sofia. Languages: Bulgarian. Population: ~6.8 million. Currency: Bulgarian Lev (BGN). Known for rose oil production, the Cyrillic alphabet, and yogurt. Also famous for: Black Sea resorts, Thracian tombs, and Rila Monastery. Food: Banitsa (cheese pastry). Religion: Eastern Orthodox Christianity. Climate: Temperate continental; cold winters and warm summers. Brief History: Part of the Ottoman Empire; independent in 1908; communist regime after World War II; member of the European Union.",
    "Burkina Faso": "Capital: Ouagadougou. Languages: French. Population: ~21.5 million. Currency: West African CFA franc (XOF). Known for gold production, film festival (FESPACO), and Sahel region droughts. Also famous for: traditional mossi culture, handicrafts, and music. Food: Tô (millet porridge). Religion: Islam, indigenous beliefs. Climate: Tropical savanna; hot with rainy season (June-September). Brief History: Part of ancient West African empires; French colony (Upper Volta); independence 1960; name changed to Burkina Faso in 1984; faces challenges with poverty and extremism.",
    "Burundi": "Capital: Gitega. Languages: Kirundi, French. Population: ~12.6 million. Currency: Burundian Franc (BIF). Known for coffee production, ethnic conflicts, and being landlocked. Also famous for: drumming traditions, Lake Tanganyika, and being one of world's poorest countries. Food: Ubugali (cassava porridge). Religion: Christianity (Catholic majority). Climate: Tropical highland; moderate due to altitude. Brief History: Kingdom existed for centuries; German then Belgian rule; independence 1962; ethnic violence between Hutu and Tutsi; recovering from civil war.",
    "Cambodia": "Capital: Phnom Penh. Languages: Khmer. Population: ~16.9 million. Currency: Cambodian Riel (KHR). Known for the Khmer Empire, Killing Fields, and traditional Apsara dance. Also famous for: Angkor Wat temple complex, silk weaving, and river dolphin. Food: Amok (fish curry). Religion: Buddhism (Theravada). Climate: Tropical monsoon; hot and humid with a rainy season (May to October). Brief History: Part of the Khmer Empire (Angkor); French protectorate; gained independence in 1953; Khmer Rouge regime (1975-1979) resulted in genocide; now a constitutional monarchy.",
    "Cameroon": "Capital: Yaoundé. Languages: French, English. Population: ~27.2 million. Currency: Central African CFA franc (XAF). Known for diverse geography (beaches, deserts, mountains) and the football team. Also famous for: Mount Cameroon, wildlife, and Baka pygmies. Food: Ndole (bitterleaf stew). Religion: Christianity, Islam, Traditional beliefs. Climate: Varied; tropical in the south, semiarid in the north. Brief History: German colony; divided between France and Britain after World War I; gained independence in 1960-1961; diverse ethnic groups and languages.",
    "Canada": "Capital: Ottawa. Languages: English, French. Population: ~38.0 million. Currency: Canadian Dollar (CAD). Known for maple syrup, hockey, politeness, and vast wilderness areas. Also famous for: the Rocky Mountains, Niagara Falls, and multiculturalism. Food: Poutine (fries, cheese curds, and gravy). Religion: Christianity, No religion. Climate: Varied; cold winters and warm summers; arctic climate in the north. Brief History: Inhabited by indigenous peoples for millennia; French and British colonies; confederation in 1867; multicultural society with strong social programs.",
    "Cape Verde": "Capital: Praia. Languages: Portuguese, Cape Verdean Creole. Population: ~560,000. Currency: Cape Verdean Escudo (CVE). Known for Creole culture, morna music, and being an Atlantic archipelago. Also famous for: beaches, volcanic landscapes, and windsurfing. Food: Catchupa (stew). Religion: Christianity (Catholic). Climate: Mild dry tropical; little seasonal temperature variation. Brief History: Uninhabited until the 15th century; Portuguese colony; gained independence in 1975; stable democracy; relies on tourism and fishing.",
    "Central African Republic": "Capital: Bangui. Languages: Sango, French. Population: ~4.9 million. Currency: Central African CFA franc (XAF). Known for diamonds, political instability, and rainforests. Also famous for: Dzanga-Sangha National Park, wildlife, and poverty. Food: Fufu (cassava dough). Religion: Christianity, Traditional beliefs, Islam. Climate: Tropical savanna; hot with a rainy season (May to October). Brief History: French colony; gained independence in 1960; experienced frequent coups and civil conflicts; one of the poorest countries in the world.",
    "Chad": "Capital: N'Djamena. Languages: French, Arabic. Population: ~16.9 million. Currency: Central African CFA franc (XAF). Known for desert landscapes, oil reserves, and being one of the poorest countries. Also famous for: Lake Chad, Zakouma National Park, and Toumai hominid fossil. Food: Boule (millet porridge). Religion: Islam, Christianity, Traditional beliefs. Climate: Arid in the north, tropical in the south; hot and dry with a rainy season (May to October). Brief History: French colony; gained independence in 1960; experienced frequent conflicts; large desert area and nomadic populations.",
    "Chile": "Capital: Santiago. Languages: Spanish. Population: ~19.5 million. Currency: Chilean Peso (CLP). Known for its long narrow shape, the Atacama Desert, and wine production. Also famous for: the Andes Mountains, Patagonia, and copper mining. Food: Empanadas (savory pastries). Religion: Christianity (Catholic, Protestant). Climate: Varied; arid in the north, Mediterranean in the center, and temperate in the south. Brief History: Spanish colony; gained independence in 1818; relatively stable politically and economically; significant copper reserves.",
    "China": "Capital: Beijing. Languages: Mandarin Chinese. Population: ~1.4 billion. Currency: Chinese Yuan (CNY). Known for being an ancient civilization, a manufacturing hub, pandas, and rapid economic growth. Also famous for: the Great Wall, Forbidden City, and terracotta army. Food: Peking duck, dumplings. Religion: Atheism, Buddhism, Taoism, Confucianism. Climate: Varied; tropical in the south, temperate in the east, and arid in the west. Brief History: One of the world's oldest civilizations; imperial dynasties; communist revolution in 1949; rapid economic growth since the late 20th century; global superpower.",
    "Colombia": "Capital: Bogotá. Languages: Spanish. Population: ~51.5 million. Currency: Colombian Peso (COP). Known for coffee, emeralds, Gabriel García Márquez, and diverse landscapes. Also famous for: Medellín, salsa music, and carnivals. Food: Bandeja Paisa (platter with meat, beans, rice). Religion: Christianity (Catholic). Climate: Tropical; varied with altitude. Brief History: Spanish colony; gained independence in 1819; experienced long periods of internal conflict; known for coffee and emeralds.",
    "Comoros": "Capital: Moroni. Languages: Comorian, French, Arabic. Population: ~900,000. Currency: Comorian Franc (KMF). Known for volcanic islands, perfume production, and political instability. Also famous for: ylang-ylang flowers, coelacanth fish, and beaches. Food: Langouste à la vanille (vanilla lobster). Religion: Islam. Climate: Tropical marine; hot and humid with a rainy season (November to May). Brief History: French colony; gained independence in 1975; experienced frequent coups and political instability; relies on agriculture (vanilla, cloves, ylang-ylang).",
    "Congo (Democratic Republic)": "Capital: Kinshasa. Languages: French. Population: ~95.2 million. Currency: Congolese Franc (CDF). Known for rainforests, mineral wealth, and long civil conflicts. Also famous for: Okapi, Virunga National Park, and Lingala music. Food: Fufu (cassava dough). Religion: Christianity (Catholic), Traditional beliefs. Climate: Tropical; hot and humid with a rainy season (March to May and September to November). Brief History: Belgian Congo; gained independence in 1960; experienced long periods of conflict and instability; vast mineral resources but widespread poverty.",
    "Republic of the Congo": "Capital: Brazzaville. Languages: French. Population: ~5.8 million. Currency: Central African CFA franc (XAF). Known for oil production, rainforests, and French colonial architecture. Also famous for: Odzala-Kokoua National Park, chimpanzees, and sapeur culture. Food: Moambe (chicken or fish stew). Religion: Christianity, Traditional beliefs. Climate: Tropical; hot and humid with a rainy season (October to May). Brief History: French colony; gained independence in 1960; relies on oil production; relatively stable compared to its neighbor (DR Congo).",
    "Costa Rica": "Capital: San José. Languages: Spanish. Population: ~5.2 million. Currency: Costa Rican Colón (CRC). Known for ecotourism, no standing army, and a high quality of life. Also famous for: rainforests, beaches, and coffee production. Food: Gallo Pinto (rice and beans). Religion: Christianity (Catholic). Climate: Tropical; hot and humid year-round with a rainy season (May to November). Brief History: Spanish colony; gained independence in 1821; stable democracy and economy; known for environmental conservation.",
    "Croatia": "Capital: Zagreb. Languages: Croatian. Population: ~4.0 million. Currency: Euro (€). Known for the Dalmatian Coast, Game of Thrones filming locations, and football talent. Also famous for: Dubrovnik, Plitvice Lakes National Park, and olive oil. Food: Peka (meat and vegetables cooked under a bell). Religion: Christianity (Catholic). Climate: Mediterranean along the coast, continental inland; mild winters and warm summers. Brief History: Part of Austro-Hungarian Empire; part of Yugoslavia; gained independence in 1991; member of the European Union; popular tourist destination.",
    "Cuba": "Capital: Havana. Languages: Spanish. Population: ~11.3 million. Currency: Cuban Peso (CUP). Known for the communist revolution, classic cars, cigars, and salsa music. Also famous for: beaches, Che Guevara, and art. Food: Ropa Vieja (shredded beef). Religion: Santería, Christianity (Catholic). Climate: Tropical; warm and humid year-round with a rainy season (May to October). Brief History: Spanish colony; gained independence in 1898; communist revolution in 1959 led by Fidel Castro; strained relations with the United States.",
    "Cyprus": "Capital: Nicosia. Languages: Greek, Turkish. Population: ~1.2 million. Currency: Euro (€). Known for a divided capital, Aphrodite's birthplace, and its strategic Mediterranean location. Also famous for: beaches, ancient ruins, and halloumi cheese. Food: Souvlaki (grilled meat skewers). Religion: Greek Orthodox Christianity, Islam. Climate: Mediterranean; hot, dry summers and mild, wet winters. Brief History: Divided between Greek Cypriot and Turkish Cypriot communities; British colony; gained independence in 1960; Turkish invasion in 1974 led to the de facto partition of the island.",
    "Czech Republic": "Capital: Prague. Languages: Czech. Population: ~10.7 million. Currency: Czech Koruna (CZK). Known for Pilsner beer, Bohemian culture, and medieval architecture. Also famous for: Prague Castle, Charles Bridge, and glassmaking. Food: Svíčková (beef sirloin in cream sauce). Religion: No religion, Christianity. Climate: Temperate continental; warm summers and cold winters. Brief History: Part of Austro-Hungarian Empire; Czechoslovakia after World War I; split into Czech Republic and Slovakia in 1993; member of the European Union.",
    "Denmark": "Capital: Copenhagen. Languages: Danish. Population: ~5.8 million. Currency: Danish Krone (DKK). Known for LEGO, Andersen's fairy tales, hygge, and bicycle culture. Also famous for: Tivoli Gardens, Viking history, and design. Food: Smørrebrød (open-faced sandwiches). Religion: Lutheran Christianity. Climate: Temperate maritime; mild winters and cool summers. Brief History: Viking Age; powerful kingdom in the Middle Ages; constitutional monarchy today; strong welfare state.",
    "Djibouti": "Capital: Djibouti City. Languages: French, Arabic, Somali, Afar. Population: ~1.1 million. Currency: Djiboutian Franc (DJF). Known for its strategic location on the Red Sea, hosting foreign military bases (US, China, France), and being a key shipping route. Also famous for: Lake Assal (Africa's lowest point and saltiest lake), desert landscapes, and being a gateway to the Suez Canal. Food: Skudahkaris (spiced rice with meat), Fah-fah (spicy soup). Religion: Islam (Sunni majority). Climate: Arid desert; extremely hot year-round. Brief History: French colony (French Somaliland); gained independence in 1977; economic hub due to its ports and geopolitical significance; relies on foreign military leases and trade.",
    "Dominica": "Capital: Roseau. Languages: English, Dominican Creole French. Population: ~72,000. Currency: East Caribbean Dollar (XCD). Known for being the Nature Island, its volcanic features, and lush rainforests. Also famous for: Boiling Lake, diving, and hiking. Food: Mountain chicken (frog legs). Religion: Christianity (Catholic). Climate: Tropical rainforest; hot and humid with a rainy season (June to November). Brief History: British colony; gained independence in 1978; known for its natural beauty and ecotourism.",
    "Dominican Republic": "Capital: Santo Domingo. Languages: Spanish. Population: ~11.1 million. Currency: Dominican Peso (DOP). Known for baseball talent, merengue music, and all-inclusive resorts. Also famous for: beaches, colonial architecture, and amber. Food: La Bandera (rice, beans, and meat). Religion: Christianity (Catholic). Climate: Tropical marine; warm and humid year-round with a rainy season (May to November). Brief History: Spanish colony; gained independence in 1844; shares the island of Hispaniola with Haiti; relies on tourism and agriculture.",
    "Ecuador": "Capital: Quito. Languages: Spanish. Population: ~17.8 million. Currency: US Dollar (USD). Known for biodiversity, the equatorial line monument, and Panama hats (actually Ecuadorian). Also famous for: the Galápagos Islands, the Andes Mountains, and chocolate production. Food: Ceviche (seafood marinated in citrus). Religion: Christianity (Catholic). Climate: Varied; tropical in the lowlands, temperate in the highlands. Brief History: Part of the Inca Empire; Spanish colony; gained independence in 1822; diverse geography and culture.",
    "Egypt": "Capital: Cairo. Languages: Arabic. Population: ~109 million. Currency: Egyptian Pound (EGP). Known for its ancient civilization, the Nile River, the Suez Canal, and the Arab Spring. Also famous for: the pyramids, pharaohs, and Islamic art. Food: Kushari (rice, lentils, and pasta). Religion: Islam. Climate: Arid; hot and dry with mild winters. Brief History: One of the world's oldest civilizations; ancient pharaohs; part of the Ottoman Empire; British protectorate; independent republic since 1953; strategic location on the Suez Canal.",
    "El Salvador": "Capital: San Salvador. Languages: Spanish. Population: ~6.5 million. Currency: US Dollar (USD). Known for pupusas, surfing spots, and gang violence challenges. Also famous for: volcanoes, coffee production, and Mayan ruins. Food: Pupusas (stuffed flatbread). Religion: Christianity (Catholic, Protestant). Climate: Tropical; hot and humid with a rainy season (May to October). Brief History: Spanish colony; gained independence in 1821; experienced a civil war in the 1980s; faces challenges with gang violence.",
    "Equatorial Guinea": "Capital: Malabo. Languages: Spanish, French, Portuguese. Population: ~1.5 million. Currency: Central African CFA franc (XAF). Known for oil wealth, being a Spanish-speaking African country, and its authoritarian government. Also famous for: Bioko Island, rainforests, and cocoa production. Food: Pepesup (fish soup). Religion: Christianity (Catholic). Climate: Tropical rainforest; hot and humid year-round. Brief History: Spanish colony; gained independence in 1968; oil reserves have brought wealth but also corruption and authoritarian rule.",
    "Eritrea": "Capital: Asmara. Languages: Tigrinya, Arabic, English. Population: ~3.6 million. Currency: Eritrean Nakfa (ERN). Known for military conscription, its Red Sea location, and Italian colonial heritage. Also famous for: Asmara architecture, the Dahlak Archipelago, and the liberation struggle. Food: Injera (flatbread) with stews. Religion: Christianity (Orthodox), Islam. Climate: Arid; hot and dry with mild winters. Brief History: Part of Ethiopia; gained independence in 1993 after a long war; authoritarian government and mandatory military service.",
    "Estonia": "Capital: Tallinn. Languages: Estonian. Population: ~1.3 million. Currency: Euro (€). Known for its digital society, medieval architecture, and Baltic singing tradition. Also famous for: Skype, e-Residency, and national parks. Food: Verivorst (blood sausage). Religion: No religion, Lutheran Christianity. Climate: Temperate maritime; mild winters and cool summers. Brief History: Part of various empires; independent in 1918; occupied by the Soviet Union during World War II; independent republic since 1991; digital society with advanced technology.",
    "Eswatini": "Capital: Mbabane (administrative), Lobamba (royal and legislative). Languages: Swazi, English. Population: ~1.2 million. Currency: Lilangeni (SZL), pegged to South African Rand. Known for being Africa's last absolute monarchy, vibrant cultural festivals (Incwala and Umhlanga reed dance), and high HIV/AIDS prevalence. Also famous for: stunning mountain landscapes, wildlife reserves, and traditional handicrafts (basketry, glassware). Food: Sishwala (thick maize porridge), sidvudvu (pumpkin mash), and grilled meats. Religion: Christianity (majority), indigenous beliefs. Climate: Temperate to subtropical; rainy summers (October-March), dry winters. Brief History: Protected from British and Boer rule by King Mswati II; British protectorate (1906-1968); gained independence as Swaziland (1968); renamed Eswatini (2018); faces challenges of poverty and health crises despite middle-income status.",
    "Ethiopia": "Capital: Addis Ababa. Languages: Amharic. Population: ~120 million. Currency: Ethiopian Birr (ETB). Known for coffee origin, ancient Christian tradition, and the African Union headquarters. Also famous for: Lalibela rock-hewn churches, the Simien Mountains, and Injera. Food: Injera (flatbread) with stews. Religion: Christianity (Orthodox), Islam. Climate: Varied; tropical monsoon with wide topographic-induced variation. Brief History: One of the oldest civilizations; ancient Christian kingdom; never fully colonized; African Union headquarters; diverse ethnic groups and languages.",
    "Falkland Islands": "Capital: Stanley. Languages: English. Population: ~3,700. Currency: Falkland Islands Pound (FKP). Known for its remote South Atlantic location, penguin colonies, and 1982 war between Britain and Argentina. Also famous for: rugged natural beauty, sheep farming, and as a gateway to Antarctica. Food: Lamb dishes, fish and chips, and traditional British cuisine. Religion: Christianity (predominantly Anglican). Climate: Cold maritime; windy year-round with cool summers and mild winters. Brief History: British territory since 1833; contested by Argentina; site of 1982 Falklands War; currently a self-governing British Overseas Territory with a thriving fishing and tourism industry.",
    "Fiji": "Capital: Suva. Languages: Fijian, English, Hindi. Population: ~900,000. Currency: Fijian Dollar (FJD). Known for its rugby team, tropical paradise, and Indo-Fijian culture. Also famous for: Soft coral capital, beaches, and the friendly locals. Food: Kokoda (marinated raw fish). Religion: Christianity, Hinduism. Climate: Tropical marine; warm, humid, and wet year-round. Brief History: British colony; gained independence in 1970; blend of Fijian and Indian cultures; tourism and sugar production are key.",
    "Finland": "Capital: Helsinki. Languages: Finnish, Swedish. Population: ~5.5 million. Currency: Euro (€). Known for saunas, its education system, Nokia, and Santa Claus Village. Also famous for: aurora borealis, design, and winter sports. Food: Karjalanpiirakka (rice pastry). Religion: Lutheran Christianity, No Religion. Climate: Subarctic; cold winters and mild summers. Brief History: Part of Sweden and Russia; gained independence in 1917; known for its high standard of living and progressive social policies.",
    "France": "Capital: Paris. Languages: French. Population: ~67.8 million. Currency: Euro (€). Known for wine, fashion, art museums, revolution, and haute cuisine. Also famous for: Eiffel Tower, Louvre Museum, and the French Riviera. Food: Crêpes, Coq au Vin (chicken in wine). Religion: Christianity (Catholic), No Religion. Climate: Temperate; mild winters and warm summers. Brief History: Powerful kingdom for centuries; French Revolution in 1789; former colonial power; influential in European politics and culture.",
    "French Southern and Antarctic Lands": "Capital: Port-aux-Français (Kerguelen Islands, de facto). Languages: French. Population: No permanent inhabitants (~150 seasonal researchers). Currency: Euro (€). Known for being a French overseas territory consisting of remote islands and Antarctic claims, including the Kerguelen Islands, Crozet Islands, and Adélie Land. Also famous for: extreme isolation, rich marine ecosystems, and scientific research stations. Food: Mostly imported supplies; some local seafood. Religion: N/A (non-permanent population). Climate: Subantarctic to polar; harsh winds and freezing temperatures year-round. Brief History: Established as a French territory in 1955; primarily used for scientific research and environmental conservation; Adélie Land claim suspended under Antarctic Treaty.",
    "Gabon": "Capital: Libreville. Languages: French. Population: ~2.3 million. Currency: Central African CFA franc (XAF). Known for oil wealth, rainforests, and low population density. Also famous for: Loango National Park, surfing hippos, and pan-African music. Food: Poulet Nyembwe (chicken in palm butter sauce). Religion: Christianity, Traditional beliefs. Climate: Tropical rainforest; hot and humid year-round. Brief History: French colony; gained independence in 1960; oil wealth has not eliminated poverty; committed to rainforest conservation.",
    "Gambia": "Capital: Banjul. Languages: English. Population: ~2.5 million. Currency: Gambian Dalasi (GMD). Known for being the smallest mainland African country, the River Gambia, and ecotourism. Also famous for: birdwatching, Kunta Kinteh Island (slave trade history), and peanut production. Food: Domoda (peanut stew). Religion: Islam (majority). Climate: Tropical savanna; hot with distinct dry/wet seasons. Brief History: British colony; gained independence 1965; briefly formed confederation with Senegal; relies on agriculture and tourism.",
    "Georgia": "Capital: Tbilisi. Languages: Georgian. Population: ~3.7 million. Currency: Georgian Lari (GEL). Known for being the birthplace of wine, the Caucasus mountains, and its unique alphabet. Also famous for: khachapuri (cheese bread), ancient churches, and hospitality. Food: Khachapuri (cheese bread). Religion: Orthodox Christianity. Climate: Varied; subtropical to alpine. Brief History: Ancient kingdom; part of the Russian Empire and Soviet Union; independent republic since 1991; strategic location in the Caucasus region.",
    "Germany": "Capital: Berlin. Languages: German. Population: ~83.2 million. Currency: Euro (€). Known for beer, cars (BMW, Mercedes), Oktoberfest, and Berlin Wall history. Also famous for: castles, classical music, and Christmas markets. Food: Bratwurst (sausage). Religion: Christianity (Protestant, Catholic), No Religion. Climate: Temperate; mild winters and warm summers. Brief History: Part of the Holy Roman Empire; unified in 1871; played a central role in both World Wars; divided after World War II; reunified in 1990; economic powerhouse in Europe.",
    "Ghana": "Capital: Accra. Languages: English. Population: ~32.1 million. Currency: Ghanaian Cedi (GHS). Known for its Gold Coast history, stable democracy, and Kente cloth. Also famous for: cocoa production, Elmina Castle, and Pan-Africanism. Food: Fufu (pounded yam or cassava) with soup. Religion: Christianity, Traditional beliefs, Islam. Climate: Tropical; hot and humid with a rainy season (April to July and September to November). Brief History: Gold Coast; British colony; gained independence in 1957; a pioneer of African independence and democracy.",
    "Greece": "Capital: Athens. Languages: Greek. Population: ~10.7 million. Currency: Euro (€). Known for its ancient philosophy, mythology, island beauty, and financial crisis. Also famous for: the Acropolis, Delphi, and Santorini. Food: Souvlaki (grilled meat skewers). Religion: Orthodox Christianity. Climate: Mediterranean; hot, dry summers and mild, wet winters. Brief History: Cradle of Western civilization; ancient city-states; part of the Ottoman Empire; independent kingdom since the 19th century; member of the European Union.",
    "Grenada": "Capital: St. George's. Languages: English. Population: ~113,000. Currency: East Caribbean Dollar (XCD). Known as the 'Spice Isle' for nutmeg production, beautiful beaches, and the 1983 US invasion. Also famous for: Grand Anse Beach, underwater sculpture park, and chocolate production. Food: Oil down (national dish with breadfruit and salted meat). Religion: Christianity (Catholic majority). Climate: Tropical maritime; warm year-round with rainy season (June-November). Brief History: French then British colony; independence 1974; Marxist coup led to US invasion; now stable democracy.",
    "Guatemala": "Capital: Guatemala City. Languages: Spanish. Population: ~17.6 million. Currency: Guatemalan Quetzal (GTQ). Known for its Mayan heritage, coffee, volcanoes, and colorful textiles. Also famous for: Tikal, Lake Atitlán, and Semana Santa celebrations. Food: Pepian (meat stew). Religion: Christianity (Catholic, Protestant). Climate: Varied; tropical in the lowlands, temperate in the highlands. Brief History: Mayan civilization; Spanish colony; gained independence in 1821; civil war in the 20th century; large indigenous population.",
    "Guinea": "Capital: Conakry. Languages: French. Population: ~13.5 million. Currency: Guinean Franc (GNF). Known for bauxite reserves, Ebola outbreaks, and West African music. Also famous for: Mount Nimba, waterfalls, and traditional dance. Food: Fufu (cassava dough). Religion: Islam, Traditional beliefs, Christianity. Climate: Tropical; hot and humid with a rainy season (May to November). Brief History: French colony; gained independence in 1958; rich in minerals but faces challenges with poverty and political instability.",
    "Guinea-Bissau": "Capital: Bissau. Languages: Portuguese. Population: ~2.0 million. Currency: West African CFA franc (XOF). Known for cashew production, political instability, and Bijagós Archipelago. Also famous for: Carnival traditions, Portuguese colonial architecture, and being a drug trafficking hub. Food: Jollof rice with fish. Religion: Islam, indigenous beliefs. Climate: Tropical; hot and humid. Brief History: Portuguese colony; independence war (1963-1974); ongoing political instability; one of world's poorest nations.",
    "Guyana": "Capital: Georgetown. Languages: English. Population: ~790,000. Currency: Guyanese Dollar (GYD). Known for being the only English-speaking South American country, Caribbean culture, and rainforests. Also famous for: Kaieteur Falls, cricket, and diverse ethnic groups. Food: Pepperpot (meat stew). Religion: Christianity, Hinduism, Islam. Climate: Tropical; hot and humid with a rainy season (May to August and November to January). Brief History: British colony; gained independence in 1966; diverse ethnic groups (Indian, African, indigenous); relies on natural resources and agriculture.",
    "Haiti": "Capital: Port-au-Prince. Languages: Haitian Creole, French. Population: ~11.4 million. Currency: Haitian Gourde (HTG). Known for being the first black republic, voodoo religion, and poverty and natural disasters. Also famous for: Citadelle Laferrière, art, and music. Food: Griot (fried pork). Religion: Voodoo, Christianity (Catholic). Climate: Tropical; hot and humid with a rainy season (May to October). Brief History: French colony; slave rebellion; gained independence in 1804; first black republic; experienced political instability, poverty, and natural disasters.",
    "Honduras": "Capital: Tegucigalpa. Languages: Spanish. Population: ~10.1 million. Currency: Honduran Lempira (HNL). Known for banana exports, violence challenges, and Mayan heritage. Also famous for: Copán ruins, beaches, and coffee production. Food: Baleadas (flour tortilla with beans and cheese). Religion: Christianity (Catholic, Protestant). Climate: Subtropical to tropical; hot and humid with a rainy season (May to November). Brief History: Spanish colony; gained independence in 1821; faces challenges with poverty and violence; relies on agriculture.",
    "Hungary": "Capital: Budapest. Languages: Hungarian. Population: ~9.6 million. Currency: Hungarian Forint (HUF). Known for thermal spas, paprika, the 1956 revolution, and Rubik's Cube. Also famous for: Budapest architecture, goulash, and Lake Balaton. Food: Goulash (meat stew). Religion: Christianity (Catholic, Protestant). Climate: Temperate continental; cold winters and warm summers. Brief History: Part of the Austro-Hungarian Empire; independent kingdom; communist regime after World War II; member of the European Union.",
    "Iceland": "Capital: Reykjavik. Languages: Icelandic. Population: ~370,000. Currency: Icelandic Króna (ISK). Known for volcanoes, geysers, the Nordic welfare model, and small population. Also famous for: aurora borealis, Blue Lagoon, and Viking history. Food: Hákarl (fermented shark). Religion: No religion, Lutheran Christianity. Climate: Subpolar oceanic; mild winters and cool summers. Brief History: Settled by Vikings; independent republic since the 10th century; known for its geothermal energy and stunning landscapes.",
    "India": "Capital: New Delhi. Languages: Hindi, English. Population: ~1.4 billion. Currency: Indian Rupee (INR). Known for Bollywood, the IT industry, spices, and diverse cultures and religions. Also famous for: Taj Mahal, Himalayas, and yoga. Food: Curry, Biryani (rice dish). Religion: Hinduism, Islam, Sikhism, Christianity, Buddhism, Jainism. Climate: Varied; tropical monsoon in the south, temperate in the north. Brief History: Indus Valley Civilization; part of the British Empire; gained independence in 1947; diverse and populous democracy; rapidly growing economy.",
    "Indonesia": "Capital: Jakarta. Languages: Indonesian. Population: ~276 million. Currency: Indonesian Rupiah (IDR). Known for being the world's largest archipelago, diverse cultures, and Komodo dragons. Also famous for: Bali, temples, and volcanoes. Food: Nasi Goreng (fried rice). Religion: Islam, Christianity, Hinduism, Buddhism. Climate: Tropical; hot and humid year-round. Brief History: Dutch East Indies; gained independence in 1949; largest Muslim-majority country; diverse ethnic groups and languages.",
    "Iran": "Capital: Tehran. Languages: Persian (Farsi). Population: ~85 million. Currency: Iranian Rial (IRR). Known for the ancient Persian Empire, the Islamic Revolution, and its nuclear program. Also famous for: Persepolis, carpets, and saffron. Food: Chelo Kebab (rice with kebab). Religion: Islam (Shia). Climate: Arid to semiarid; hot summers and cold winters. Brief History: Ancient Persian Empire; Islamic Revolution in 1979; significant role in Middle Eastern politics and energy markets.",
    "Iraq": "Capital: Baghdad. Languages: Arabic, Kurdish. Population: ~42 million. Currency: Iraqi Dinar (IQD). Known for being Mesopotamia, the cradle of civilization, its oil reserves, and recent conflicts. Also famous for: ancient ruins (Babylon), Baghdad, and hospitality. Food: Masgouf (grilled fish). Religion: Islam (Shia and Sunni). Climate: Arid to semiarid; hot summers and mild winters. Brief History: Mesopotamia; part of the Ottoman Empire; British mandate; independent republic; experienced conflicts in recent decades; rich in oil resources.",
    "Ireland": "Capital: Dublin. Languages: Irish, English. Population: ~5.0 million. Currency: Euro (€). Known for Celtic culture, pubs, literature (Yeats, Joyce), and emigration history. Also famous for: Guinness, music, and landscapes. Food: Irish stew. Religion: Christianity (Catholic). Climate: Temperate maritime; mild winters and cool summers. Brief History: Celtic culture; part of the British Empire; gained independence in 1922; rich literary and musical traditions; known for its landscapes and pubs.",
    "Israel": "Capital: Jerusalem (disputed). Languages: Hebrew, Arabic. Population: ~9.3 million. Currency: Israeli New Shekel (ILS). Known for the Holy Land, its tech startup nation, kibbutzim, and the Israeli-Palestinian conflict. Also famous for: Tel Aviv, Dead Sea, and innovation. Food: Hummus. Religion: Judaism, Islam, Christianity. Climate: Mediterranean; hot, dry summers and mild, wet winters. Brief History: Ancient Israel; Roman rule; part of the Ottoman Empire; British mandate; independent state in 1948; ongoing conflict with Palestinians.",
    "Italy": "Capital: Rome. Languages: Italian. Population: ~60.3 million. Currency: Euro (€). Known for the Roman Empire, Renaissance art, fashion, opera, and cuisine. Also famous for: Colosseum, Venice, and pizza. Food: Pizza, pasta. Religion: Christianity (Catholic). Climate: Mediterranean; hot, dry summers and mild, wet winters. Brief History: Roman Empire; Renaissance; unified in the 19th century; influential in art, culture, and politics.",
    "Jamaica": "Capital: Kingston. Languages: English. Population: ~2.8 million. Currency: Jamaican Dollar (JMD). Known for reggae music (Bob Marley), sprint athletes, and all-inclusive resorts. Also famous for: beaches, Blue Mountains, and Jerk Chicken. Food: Jerk chicken. Religion: Christianity, Rastafarianism. Climate: Tropical marine; warm and sunny year-round with a rainy season (May to October). Brief History: Spanish and British colony; gained independence in 1962; known for its music, culture, and athletic achievements.",
    "Japan": "Capital: Tokyo. Languages: Japanese. Population: ~125 million. Currency: Japanese Yen (JPY). Known for its technology, anime, bullet trains, cherry blossoms, and longevity. Also famous for: Mount Fuji, temples, and sushi. Food: Sushi. Religion: Shinto, Buddhism. Climate: Temperate; varied with four distinct seasons. Brief History: Ancient civilization; feudal system; modernization in the 19th century; economic powerhouse; known for its technology and culture.",
    "Jordan": "Capital: Amman. Languages: Arabic. Population: ~11 million. Currency: Jordanian Dinar (JOD). Known for its ancient Nabatean civilization, refugee hosting, and desert landscapes. Also famous for: Petra, Dead Sea, and hospitality. Food: Mansaf (lamb with rice and yogurt sauce). Religion: Islam. Climate: Arid to semiarid; hot summers and mild winters. Brief History: Ancient civilizations; part of the Ottoman Empire; British mandate; independent kingdom; plays a role in regional politics; known for hosting refugees.",
    "Kazakhstan": "Capital: Nur-Sultan (Astana). Languages: Kazakh, Russian. Population: ~19 million. Currency: Kazakhstani Tenge (KZT). Known for being the largest landlocked country, its oil reserves, and Borat stereotypes. Also famous for: Baikonur Cosmodrome, vast steppes, and nomadic traditions. Food: Beshbarmak (boiled meat with noodles). Religion: Islam, Christianity. Climate: Continental; cold winters and hot summers. Brief History: Nomadic peoples; part of the Russian Empire and Soviet Union; independent republic; rich in natural resources (oil, gas).",
    "Kenya": "Capital: Nairobi. Languages: Swahili, English. Population: ~55 million. Currency: Kenyan Shilling (KES). Known for its safari destinations, marathon runners, and the Great Rift Valley. Also famous for: Maasai people, wildlife, and coffee. Food: Ugali (maize flour porridge). Religion: Christianity, Islam, Traditional beliefs. Climate: Tropical; varied with altitude. Brief History: British colony; gained independence in 1963; known for its wildlife, safaris, and diverse cultures.",
    "Kiribati": "Capital: South Tarawa. Languages: Gilbertese, English. Population: ~120,000. Currency: Australian Dollar (AUD). Known for being first country to see new day, climate change vulnerability, and Pacific atolls. Also famous for: WWII battles, fishing traditions, and remote location. Food: Seafood (especially tuna), coconut. Religion: Christianity (majority). Climate: Tropical marine; hot and humid. Brief History: British colony (Gilbert Islands); independence 1979; faces existential threat from rising sea levels.",
    "North Korea": "Capital: Pyongyang. Languages: Korean. Population: ~25 million. Currency: North Korean Won (KPW). Known for its isolated communist regime, nuclear program, and the DMZ border. Also famous for: Juche ideology, Kim dynasty, and mass games. Food: Pyongyang Raengmyeon (cold noodles). Religion: Atheism, Korean shamanism. Climate: Continental; cold winters and warm summers. Brief History: Divided after World War II; Korean War; isolated communist regime; nuclear program tensions.",
    "South Korea": "Capital: Seoul. Languages: Korean. Population: ~51 million. Currency: South Korean Won (KRW). Known for K-pop, its technology (Samsung), rapid development, and the Korean Wave. Also famous for: Gangnam, kimchi, and K-dramas. Food: Kimchi. Religion: No religion, Christianity, Buddhism. Climate: Temperate; four distinct seasons. Brief History: Divided after World War II; Korean War; rapid economic growth; technological innovation; known for its culture and entertainment (K-pop, K-dramas).",
    "Kosovo": "Capital: Pristina. Languages: Albanian, Serbian. Population: ~1.8 million. Currency: Euro (€). Known for its 2008 independence declaration, ethnic tensions, and young population. Also famous for: Newborn monument, coffee culture, and Ottoman heritage. Food: Flija (layered pancake dish). Religion: Islam, Orthodox Christianity, Catholicism. Climate: Continental; warm summers and cold winters. Brief History: Part of Yugoslavia; conflict with Serbia; declared independence in 2008; recognized by many countries but not all.",
    "Kuwait": "Capital: Kuwait City. Languages: Arabic. Population: ~4.3 million. Currency: Kuwaiti Dinar (KWD). Known for its oil wealth, the Gulf War, high temperatures, and expat majority population. Also famous for: Kuwait Towers, Grand Mosque, and pearl diving history. Food: Machboos (spiced meat and rice). Religion: Islam. Climate: Arid; hot summers and mild winters. Brief History: Ancient trade route; British protectorate; gained independence in 1961; major oil producer; experienced the Gulf War in 1990-1991.",
    "Kyrgyzstan": "Capital: Bishkek. Languages: Kyrgyz (state), Russian (official). Population: ~6.7 million. Currency: Kyrgyzstani som (KGS). Known for its stunning Tian Shan mountain ranges (covering 80% of territory), nomadic traditions, and being Central Asia's only democracy. Also famous for: the epic of Manas (world's longest poem), Issyk-Kul Lake (second largest alpine lake), and traditional felt yurts. Food: Beshbarmak (boiled meat with noodles), manti (dumplings), and kumis (fermented mare's milk). Religion: Sunni Islam (majority), with Russian Orthodox minority. Climate: Continental; extreme temperature variations from -30°C in winter to 40°C in summer. Brief History: Part of Silk Road; Russian Empire (1864); Soviet republic (1936); gained independence (1991); experienced revolutions (2005, 2010); maintains nomadic cultural identity while urbanizing rapidly.",
    "Laos": "Capital: Vientiane. Languages: Lao. Population: ~7.4 million. Currency: Lao Kip (LAK). Known for being a landlocked Southeast Asian country, its Buddhist culture, and the UXO legacy. Also famous for: Luang Prabang, waterfalls, and Laotian hospitality. Food: Laap (minced meat salad). Religion: Buddhism. Climate: Tropical monsoon; hot and humid with a rainy season (May to October). Brief History: French colony; gained independence in 1953; communist government; known for its Buddhist culture and scenic landscapes.",
    "Latvia": "Capital: Riga. Languages: Latvian. Population: ~1.9 million. Currency: Euro (€). Known for its Art Nouveau architecture, Baltic culture, and song and dance festivals. Also famous for: Riga Old Town, beaches, and forests. Food: Pelmeni (dumplings). Religion: Lutheran Christianity, Russian Orthodox. Climate: Temperate maritime; mild winters and cool summers. Brief History: Part of various empires; independent in 1918; occupied by the Soviet Union during World War II; independent republic since 1991.",
    "Lebanon": "Capital: Beirut. Languages: Arabic, French. Population: ~5.6 million. Currency: Lebanese Pound (LBP). Known for cedar trees, diverse religious groups, civil war history, and cuisine. Also famous for: Baalbek ruins, nightlife, and beaches. Food: Hummus, Falafel. Religion: Islam, Christianity. Climate: Mediterranean; hot, dry summers and mild, wet winters. Brief History: Ancient Phoenicia; part of the Ottoman Empire; French mandate; independent republic; civil war (1975-1990); diverse religious communities.",
    "Lesotho": "Capital: Maseru. Languages: Sesotho, English. Population: ~2.1 million. Currency: Lesotho Loti (LSL). Known for being a mountain kingdom, being entirely surrounded by South Africa, and textiles. Also famous for: Drakensberg Mountains, skiing, and Sotho culture. Food: Motoho (fermented sorghum porridge). Religion: Christianity, Traditional beliefs. Climate: Subalpine; cool summers and cold winters. Brief History: Mountain kingdom; British protectorate; gained independence in 1966; entirely surrounded by South Africa.",
    "Liberia": "Capital: Monrovia. Languages: English. Population: ~5.2 million. Currency: Liberian Dollar (LRD). Known for being founded by freed American slaves, its civil wars, and Ebola outbreaks. Also famous for: beaches, Sapo National Park, and history. Food: Rice and pepper soup. Religion: Christianity, Islam, Traditional beliefs. Climate: Tropical monsoon; hot and humid with a rainy season (May to October). Brief History: Founded by freed American slaves in 1822; experienced civil wars in the late 20th century; faces challenges with poverty and development.",
    "Libya": "Capital: Tripoli. Languages: Arabic. Population: ~6.9 million. Currency: Libyan Dinar (LYD). Known for its oil reserves, the 2011 revolution, desert landscapes, and Roman ruins. Also famous for: Leptis Magna, Sahara Desert, and traditional Berber culture. Food: Couscous. Religion: Islam. Climate: Arid; hot summers and mild winters. Brief History: Part of the Ottoman Empire; Italian colony; independent kingdom; Gaddafi regime; 2011 revolution; political instability.",
    "Liechtenstein": "Capital: Vaduz. Languages: German. Population: ~39,000. Currency: Swiss Franc (CHF). Known for being a wealthy microstate, alpine scenery, and tax haven. Also famous for: postage stamps, winter sports, and Vaduz Castle. Food: Käsknöpfle (cheese dumplings). Religion: Christianity (Catholic majority). Climate: Alpine; cold winters, mild summers. Brief History: Established 1719; closely tied to Switzerland; constitutional monarchy; high standard of living.",
    "Lithuania": "Capital: Vilnius. Languages: Lithuanian. Population: ~2.8 million. Currency: Euro (€). Known for being a Baltic state, its basketball passion, and medieval old towns. Also famous for: Trakai Castle, Curonian Spit, and amber. Food: Cepelinai (potato dumplings). Religion: Christianity (Catholic). Climate: Temperate maritime; mild winters and cool summers. Brief History: Part of various empires; independent in 1918; occupied by the Soviet Union during World War II; independent republic since 1991.",
    "Luxembourg": "Capital: Luxembourg City. Languages: Luxembourgish, French, German. Population: ~640,000. Currency: Euro (€). Known for being a wealthy EU country, its finance sector, and multilingual population. Also famous for: castles, picturesque towns, and EU institutions. Food: Judd mat Gaardebounen (smoked pork with broad beans). Religion: Christianity (Catholic). Climate: Temperate maritime; mild winters and cool summers. Brief History: Part of the Holy Roman Empire; independent grand duchy; known for its finance sector and role in the European Union.",
    "Madagascar": "Capital: Antananarivo. Languages: Malagasy, French. Population: ~28.9 million. Currency: Malagasy Ariary (MGA). Known for its unique wildlife (lemurs), vanilla production, and island biodiversity. Also famous for: baobab trees, rainforests, and beaches. Food: Romazava (meat and vegetable stew). Religion: Traditional beliefs, Christianity. Climate: Tropical; varied with altitude. Brief History: Island nation off the coast of Africa; unique wildlife and ecosystems; faces challenges with deforestation and poverty.",
    "Malawi": "Capital: Lilongwe. Languages: English, Chichewa. Population: ~19.6 million. Currency: Malawian Kwacha (MWK). Known for being the Warm Heart of Africa, its freshwater lake, and tobacco production. Also famous for: Lake Malawi, wildlife, and friendly people. Food: Nsima (maize flour porridge). Religion: Christianity, Islam. Climate: Tropical; hot and humid with a rainy season (November to May). Brief History: British colony; gained independence in 1964; known for its warm people and Lake Malawi.",
    "Malaysia": "Capital: Kuala Lumpur. Languages: Malay. Population: ~33.6 million. Currency: Malaysian Ringgit (MYR). Known for its multicultural society, rainforests, and electronics manufacturing. Also famous for: Petronas Towers, beaches, and food. Food: Nasi lemak (coconut rice dish). Religion: Islam, Buddhism, Christianity, Hinduism. Climate: Tropical; hot and humid year-round. Brief History: British colony; gained independence in 1957; multicultural society; known for its economic development and tourism.",
    "Maldives": "Capital: Malé. Languages: Dhivehi. Population: ~521,000. Currency: Maldivian Rufiyaa (MVR). Known for luxury resorts, climate change threat, and coral atolls. Also famous for: diving, beaches, and marine life. Food: Mas huni (shredded smoked fish with coconut). Religion: Islam. Climate: Tropical monsoon; warm and humid year-round. Brief History: Island nation in the Indian Ocean; known for its luxury resorts and vulnerability to climate change.",
    "Mali": "Capital: Bamako. Languages: French. Population: ~21.9 million. Currency: West African CFA franc (XOF). Known for its ancient Mali Empire, music traditions, and desert landscapes. Also famous for: Timbuktu, the Niger River, and the Dogon people. Food: Tô (millet porridge). Religion: Islam. Climate: Arid to semiarid; hot and dry. Brief History: Ancient Mali Empire; French colony; gained independence in 1960; faces challenges with desertification and conflict.",
    "Malta": "Capital: Valletta. Languages: Maltese, English. Population: ~520,000. Currency: Euro (€). Known for the Knights of Malta, Game of Thrones filming locations, and Mediterranean history. Also famous for: beaches, Mdina, and baroque architecture. Food: Rabbit stew. Religion: Christianity (Catholic). Climate: Mediterranean; hot, dry summers and mild, wet winters. Brief History: Strategic location in the Mediterranean; ruled by the Knights of Malta; British colony; gained independence in 1964; member of the European Union.",
    "Marshall Islands": "Capital: Majuro. Languages: Marshallese, English. Population: ~59,000. Currency: US Dollar (USD). Known for nuclear testing legacy, climate change vulnerability, and atoll islands. Also famous for: traditional stick navigation, WWII wrecks, and compact with USA. Food: Seafood, breadfruit. Religion: Christianity (majority). Climate: Tropical marine; hot and humid. Brief History: US trust territory; nuclear testing 1946-1958; independence 1986; faces rising sea levels.",
    "Mauritania": "Capital: Nouakchott. Languages: Arabic. Population: ~4.6 million. Currency: Mauritanian Ouguiya (MRU). Known for its Saharan landscapes, slavery issues, and being an Islamic republic. Also famous for: iron ore mining, Chinguetti, and nomadic culture. Food: Thieboudienne (fish and rice dish). Religion: Islam. Climate: Arid; hot and dry. Brief History: French colony; gained independence in 1960; faces challenges with desertification and slavery.",
    "Mauritius": "Capital: Port Louis. Languages: English, French, Creole. Population: ~1.3 million. Currency: Mauritian Rupee (MUR). Known for sugar production, its multicultural society, and luxury tourism. Also famous for: beaches, wildlife, and sugarcane fields. Food: Dholl puri (flatbread with lentils). Religion: Hinduism, Christianity, Islam. Climate: Tropical; warm and humid year-round. Brief History: French and British colony; gained independence in 1968; known for its multicultural society and luxury tourism.",
    "Mexico": "Capital: Mexico City. Languages: Spanish. Population: ~128.9 million. Currency: Mexican Peso (MXN). Known for its ancient civilizations (Aztec, Maya), tequila, and vibrant culture. Also famous for: beaches, food, and Mariachi music. Food: Tacos, mole. Religion: Christianity (Catholic). Climate: Varied; tropical to desert. Brief History: Ancient civilizations (Aztec, Maya); Spanish colony; gained independence in 1821; known for its culture, food, and ancient history.",
    "Micronesia": "Capital: Palikir. Languages: English. Population: ~115,000. Currency: US Dollar (USD). Known for being a Pacific island nation, WWII history, and traditional navigation. Also famous for: Nan Madol ruins, diving spots, and compact with USA. Food: Seafood, taro. Religion: Christianity (majority). Climate: Tropical; warm and humid. Brief History: US trust territory; independence 1986; relies on US aid; traditional chiefdoms still influential.",
    "Moldova": "Capital: Chisinau. Languages: Romanian. Population: ~2.6 million. Currency: Moldovan Leu (MDL). Known for its wine production, the breakaway Transnistria region, and agricultural economy. Also famous for: Cricova winery, monasteries, and folk music. Food: Mămăligă (cornmeal porridge). Religion: Orthodox Christianity. Climate: Continental; warm summers and cold winters. Brief History: Part of Romania and the Soviet Union; independent republic; faces challenges with poverty and the Transnistria region.",
    "Monaco": "Capital: Monaco. Languages: French. Population: ~39,000. Currency: Euro (€). Known for being a wealthy microstate, the Grand Prix, tax haven status, and the Grimaldi family. Also famous for: casinos, luxury, and the Mediterranean coast. Food: Barbagiuan (stuffed fritters). Religion: Christianity (Catholic). Climate: Mediterranean; mild winters and warm, dry summers. Brief History: Ruled by the Grimaldi family for centuries; known for its wealth and status as a tax haven.",
    "Mongolia": "Capital: Ulaanbaatar. Languages: Mongolian. Population: ~3.3 million. Currency: Mongolian Tögrög (MNT). Known for its nomadic culture, vast steppes, and Genghis Khan legacy. Also famous for: Gobi Desert, horses, and throat singing. Food: Buuz (steamed dumplings). Religion: Buddhism, Shamanism. Climate: Continental; cold winters and hot summers. Brief History: Mongol Empire; part of China; independent republic; known for its nomadic culture and vast landscapes.",
    "Montenegro": "Capital: Podgorica. Languages: Montenegrin. Population: ~620,000. Currency: Euro (€) (unilaterally adopted). Known for its stunning Adriatic coastline, medieval walled city of Kotor (UNESCO site), and dramatic mountain landscapes. Also famous for: being one of the world's newest independent countries (2006), luxury marina in Porto Montenegro, and Ostrog Monastery carved into cliffs. Food: Njeguški pršut (smoked ham), kačamak (cornmeal porridge), and seafood along the coast. Religion: Orthodox Christianity (majority), with significant Muslim and Catholic minorities. Climate: Mediterranean on coast; continental inland with cold winters in northern mountains. Brief History: Part of medieval Serbian kingdom; Ottoman vassal (15th-19th century); independent principality (1878); united with Serbia (1918); part of Yugoslavia; remained with Serbia until peaceful independence referendum (2006); NATO member (2017); EU candidate.",
    "Morocco": "Capital: Rabat. Languages: Arabic, Berber. Population: ~37.1 million. Currency: Moroccan Dirham (MAD). Known for the Atlas Mountains, the Sahara Desert, imperial cities, and souks. Also famous for: Marrakech, Casablanca, and mint tea. Food: Tagine. Religion: Islam. Climate: Mediterranean along the coast, arid in the interior. Brief History: Ancient civilization; part of the Islamic world; French and Spanish protectorate; independent kingdom.",
    "Mozambique": "Capital: Maputo. Languages: Portuguese. Population: ~32.1 million. Currency: Mozambican Metical (MZN). Known for its Indian Ocean coastline, Portuguese influence, and post-war recovery. Also famous for: beaches, wildlife, and islands. Food: Piri-piri chicken. Religion: Christianity, Islam, Traditional beliefs. Climate: Tropical; hot and humid with a rainy season (November to March). Brief History: Portuguese colony; gained independence in 1975; civil war; recovering from conflict; relies on natural resources and agriculture.",
    "Myanmar": "Capital: Naypyidaw. Languages: Burmese. Population: ~54.4 million. Currency: Burmese Kyat (MMK). Known for its military rule, Buddhist culture, golden pagodas, and Aung San Suu Kyi. Also famous for: Bagan, Inle Lake, and gems. Food: Mohinga (fish noodle soup). Religion: Buddhism. Climate: Tropical monsoon; hot and humid with a rainy season (May to October). Brief History: British colony; gained independence in 1948; military rule; known for its Buddhist culture and political challenges.",
    "Namibia": "Capital: Windhoek. Languages: English. Population: ~2.6 million. Currency: Namibian Dollar (NAD). Known for desert landscapes, German colonial heritage, and wildlife conservation. Also famous for: Sossusvlei, Etosha National Park, and the Skeleton Coast. Food: Biltong (dried meat). Religion: Christianity. Climate: Arid to semiarid; hot and dry. Brief History: German colony; South African mandate; gained independence in 1990; known for its desert landscapes and wildlife conservation.",
    "Nauru": "Capital: Yaren (de facto). Languages: Nauruan, English. Population: ~11,000. Currency: Australian Dollar (AUD). Known for being world's smallest republic, phosphate mining, and obesity issues. Also famous for: remote location, detention center for Australia, and economic challenges. Food: Imported processed foods. Religion: Christianity (majority). Climate: Tropical; hot and humid. Brief History: Rich from phosphate mining; environmental degradation; economic collapse; relies on foreign aid.",
    "Nepal": "Capital: Kathmandu. Languages: Nepali. Population: ~30 million. Currency: Nepalese Rupee (NPR). Known for the Himalayas, being the birthplace of Buddha, and a trekking destination. Also famous for: Mount Everest, temples, and culture. Food: Dal bhat (lentils and rice). Religion: Hinduism, Buddhism. Climate: Varied; subtropical to alpine. Brief History: Ancient kingdom; known for its Himalayas and Buddhist culture.",
    "Netherlands": "Capital: Amsterdam. Languages: Dutch. Population: ~17.5 million. Currency: Euro (EUR). Known for windmills, tulips, cycling culture, and liberal policies. Also famous for: Canals, cheese (Gouda, Edam), dikes, art (Rembrandt, Van Gogh), international courts (The Hague). Food: Stamppot, Herring (haring). Religion: Historically Christian (Catholic/Protestant), large non-religious population. Climate: Temperate maritime. Brief History: Maritime trade power (Dutch Golden Age); known for reclaiming land from the sea (polders).",
    "New Caledonia": "Capital: Nouméa. Languages: French (official), 28 Melanesian-Polynesian languages. Population: ~290,000. Currency: CFP Franc (XPF). Known for its nickel reserves (25% of world's known supply), stunning lagoons (UNESCO World Heritage), and unique biodiversity. Also famous for: being a French overseas territory with ongoing independence movements, Kanak culture, and as a South Pacific paradise. Food: Bougna (traditional Melanesian dish with chicken/fish and root vegetables cooked in banana leaves). Religion: Christianity (majority), indigenous beliefs. Climate: Tropical; warm and humid with cooler dry season (May-November). Brief History: Inhabited by Kanak people for 3,000 years; French colony since 1853; important WWII base; special collectivity status since 1998; independence referendums held in 2018-2021 (all rejecting independence).",
    "New Zealand": "Capital: Wellington. Languages: English, Māori, NZ Sign Language. Population: ~5.1 million. Currency: New Zealand Dollar (NZD). Known for Lord of the Rings filming locations, rugby (All Blacks), and kiwi birds. Also famous for: Māori culture (Haka), stunning natural landscapes (fjords, mountains), sheep farming, geothermal activity. Food: Hangi, Lamb, Pavlova. Religion: Historically Christian, large non-religious population. Climate: Temperate maritime; diverse across islands. Brief History: Polynesian Māori settlement, British colonization (Treaty of Waitangi), known for natural beauty and adventure tourism.",
    "Nicaragua": "Capital: Managua. Languages: Spanish. Population: ~6.7 million. Currency: Nicaraguan Córdoba (NIO). Known for lakes and volcanoes, being the largest Central American country, and recent political unrest. Also famous for: Poet Rubén Darío, Sandinista history, Lake Nicaragua (largest in Central America). Food: Gallo Pinto (rice and beans), Nacatamal. Religion: Predominantly Roman Catholic. Climate: Tropical with wet and dry seasons. Brief History: Spanish colony, history of political instability including US interventions, Sandinista revolution and Contra War.",
    "Niger": "Capital: Niamey. Languages: French (official), Hausa, Zarma. Population: ~25.1 million. Currency: West African CFA franc (XOF). Known for Saharan landscapes, uranium mining, and high fertility rate. Also famous for: Niger River, Tuareg culture, ancient Kouré giraffes. Food: Djerma Stew, Rice dishes. Religion: Predominantly Sunni Islam. Climate: Primarily hot and dry desert; tropical in extreme south. Brief History: Part of various West African empires, French colony, independence in 1960, faces challenges with poverty and instability.",
    "Nigeria": "Capital: Abuja. Languages: English (official), Hausa, Yoruba, Igbo (major). Population: ~219 million. Currency: Nigerian Naira (NGN). Known for being Africa's largest economy, Nollywood film industry, oil production, and diverse cultures. Also famous for: Music (Afrobeats), literature (Chinua Achebe, Wole Soyinka), vast population. Food: Jollof rice, Fufu, Suya. Religion: Roughly equal split between Islam (mostly North) and Christianity (mostly South), indigenous beliefs. Climate: Varies from tropical rainforest (south) to savanna and Sahel (north). Brief History: Nok culture, various kingdoms (Oyo, Benin), British colonization, independence 1960, periods of military rule, significant ethnic diversity.",
    "North Macedonia": "Capital: Skopje. Languages: Macedonian, Albanian. Population: ~2.1 million. Currency: Macedonian Denar (MKD). Known for ancient history (Alexander the Great association), name dispute resolution with Greece, and Lake Ohrid. Also famous for: Ottoman-era architecture, mountains, Orthodox monasteries. Food: Tavče Gravče (baked beans), Ajvar. Religion: Predominantly Macedonian Orthodoxy, significant Muslim minority (mainly Albanian). Climate: Transitional from Mediterranean to continental. Brief History: Part of ancient Macedon, Roman, Byzantine, Ottoman empires, Yugoslavia; gained independence 1991; changed name from Macedonia to North Macedonia in 2019.",
    "Norway": "Capital: Oslo. Languages: Norwegian (Bokmål and Nynorsk), Sámi. Population: ~5.4 million. Currency: Norwegian Krone (NOK). Known for fjords, Vikings, oil wealth, midnight sun, and winter sports. Also famous for: High standard of living, salmon fishing/farming, Edvard Munch (The Scream), polar exploration. Food: Fårikål (mutton stew), Lutefisk, Salmon. Religion: Predominantly Lutheran Christianity (Church of Norway), growing secularism. Climate: Temperate coastal climate due to Gulf Stream; colder inland and north. Brief History: Viking Age, Kalmar Union, union with Sweden, independence 1905, discovered oil in North Sea, known for peace initiatives (Nobel Peace Prize).",
    "Oman": "Capital: Muscat. Languages: Arabic. Population: ~5.1 million. Currency: Omani Rial (OMR). Known for frankincense trade history, desert forts, maritime history, and peaceful diplomacy. Also famous for: Wadis (valleys/gorges), unique Ibadi branch of Islam, traditional dhow boats. Food: Shuwa (slow-cooked lamb/goat), Majboos (spiced rice). Religion: Predominantly Ibadi Islam, Sunni minority. Climate: Hot and arid; humid along coast, monsoon (Khareef) in Dhofar region. Brief History: Ancient maritime trading hub, Portuguese influence, independent Sultanate, known for modernization under Sultan Qaboos.",
    "Pakistan": "Capital: Islamabad. Languages: Urdu (national), English (official), Punjabi, Sindhi, Pashto, Balochi. Population: ~231 million. Currency: Pakistani Rupee (PKR). Known for Indus Valley civilization, nuclear power status, and Kashmir conflict with India. Also famous for: K2 (second highest mountain), cricket passion, Mughal architecture, diverse landscapes (mountains, deserts, plains). Food: Biryani, Nihari, Kebabs. Religion: Predominantly Sunni Islam, Shia minority. Climate: Mostly hot and dry; temperate in northwest; arctic in mountains. Brief History: Part of British India, created 1947 as Muslim homeland, history of military rule and political instability, key US ally in War on Terror.",
    "Palau": "Capital: Ngerulmud. Languages: Palauan, English. Population: ~18,000. Currency: US Dollar (USD). Known for marine biodiversity, Jellyfish Lake, and conservation efforts. Also famous for: Rock Islands, WWII wrecks, and compact with USA. Food: Seafood, taro. Religion: Christianity (majority). Climate: Tropical; warm year-round. Brief History: Spanish, German, Japanese rule; US trust territory; independence 1994; pioneer in marine conservation.",
    "Panama": "Capital: Panama City. Languages: Spanish. Population: ~4.4 million. Currency: Panamanian Balboa (PAB), US Dollar (USD widely used). Known for the Panama Canal connecting oceans, biodiversity, and offshore banking. Also famous for: Geographically strategic location, rainforests, San Blas Islands (Guna Yala). Food: Sancocho (chicken soup), Ropa Vieja, Ceviche. Religion: Predominantly Roman Catholic. Climate: Tropical maritime; hot, humid, cloudy; prolonged rainy season. Brief History: Spanish colony, part of Gran Colombia, independence aided by US (for canal), US control of Canal Zone until 1999.",
    "Papua New Guinea": "Capital: Port Moresby. Languages: English, Tok Pisin, Hiri Motu (official), over 800 indigenous languages. Population: ~9.9 million. Currency: Papua New Guinean Kina (PGK). Known for extreme cultural diversity, rainforests, tribal traditions, and bird of paradise. Also famous for: Kokoda Track (WWII site), highlands culture, linguistic diversity, resource wealth (mining, gas). Food: Mumu (earth oven cooking), Sago, Taro, Kaukau (sweet potato). Religion: Predominantly Christian, indigenous beliefs often syncretized. Climate: Tropical monsoon; hot and humid. Brief History: Colonized by Germany and Britain, administered by Australia, independence 1975, known for rugged terrain and isolated communities.",
    "Paraguay": "Capital: Asunción. Languages: Spanish, Guarani (both official). Population: ~7.3 million. Currency: Paraguayan Guaraní (PYG). Known for being landlocked, bilingualism (Spanish/Guarani), and yerba mate production/consumption. Also famous for: Itaipu Dam (one of world's largest), Chaco region, Jesuit missions history. Food: Sopa Paraguaya (cornbread), Chipa, Asado (barbecue). Religion: Predominantly Roman Catholic. Climate: Subtropical to temperate; substantial rainfall in east, semi-arid in west (Chaco). Brief History: Spanish colony, devastating War of the Triple Alliance (1860s), Alfredo Stroessner dictatorship (1954-1989), known for hydro-electric power.",
    "Peru": "Capital: Lima. Languages: Spanish (official), Quechua, Aymara. Population: ~33.7 million. Currency: Peruvian Sol (PEN). Known for Inca Empire (Machu Picchu), Andean landscapes, Amazon rainforest, and diverse cuisine. Also famous for: Nazca Lines, Lake Titicaca, llamas and alpacas, rich pre-Columbian history. Food: Ceviche, Lomo Saltado, Cuy (guinea pig). Religion: Predominantly Roman Catholic. Climate: Varies greatly; arid coast, temperate Andes, tropical Amazon. Brief History: Center of Inca Empire, Spanish conquest, independence early 19th century, periods of political instability, recent economic growth.",
    "Philippines": "Capital: Manila. Languages: Filipino (based on Tagalog), English (both official). Population: ~113.9 million. Currency: Philippine Peso (PHP). Known for being an archipelago nation, overseas Filipino workers (OFWs), Catholicism in Asia, and karaoke culture. Also famous for: Beautiful beaches and islands (Palawan, Boracay), rice terraces (Banaue), boxing (Manny Pacquiao), Spanish colonial influence. Food: Adobo, Sinigang, Lechon. Religion: Predominantly Roman Catholic, significant Muslim minority in Mindanao. Climate: Tropical maritime; hot and humid; prone to typhoons. Brief History: Spanish colony for over 300 years, US territory after 1898, Japanese occupation WWII, independence 1946, Marcos dictatorship.",
    "Poland": "Capital: Warsaw. Languages: Polish. Population: ~37.8 million. Currency: Polish Złoty (PLN). Known for Solidarity movement, extensive WWII history (including Holocaust sites), and famous figures like Copernicus and Chopin. Also famous for: Medieval cities (Kraków, Gdańsk), pierogi, Białowieża Forest (bison). Food: Pierogi, Bigos (hunter's stew), Żurek (sour rye soup). Religion: Predominantly Roman Catholic. Climate: Temperate transitional; maritime west, continental east. Brief History: Powerful kingdom in Middle Ages, partitions in 18th century, regained independence 1918, devastated in WWII, Soviet bloc country, transition to democracy 1989.",
    "Portugal": "Capital: Lisbon. Languages: Portuguese. Population: ~10.3 million. Currency: Euro (EUR). Known for Age of Discovery (explorers like Vasco da Gama), fado music, cork production, and Cristiano Ronaldo. Also famous for: Port wine, azulejo tiles, beautiful coastline (Algarve), historical connection to Brazil. Food: Bacalhau (codfish) dishes, Pastel de Nata, Cozido à Portuguesa. Religion: Predominantly Roman Catholic. Climate: Mediterranean; warm temperate, influenced by Atlantic. Brief History: Roman province, Moorish influence, leading maritime power in 15th-16th centuries, Salazar dictatorship (20th century), Carnation Revolution 1974.",
    "Qatar": "Capital: Doha. Languages: Arabic. Population: ~2.9 million. Currency: Qatari Riyal (QAR). Known for vast natural gas wealth, hosting the 2022 FIFA World Cup, and Al Jazeera media network. Also famous for: High GDP per capita, large expatriate population, modern architecture, Pearl-Qatar island. Food: Machboos (spiced rice with meat/fish), Harees. Religion: Predominantly Wahhabi Sunni Islam. Climate: Hot desert; very high summer temperatures and humidity. Brief History: British protectorate, independence 1971, transformed by oil and gas discovery, plays significant regional diplomatic role.",
    "Romania": "Capital: Bucharest. Languages: Romanian. Population: ~19 million. Currency: Romanian Leu (RON). Known for Transylvania region, Dracula legend (associated with Vlad the Impaler), Carpathian Mountains, and EU membership. Also famous for: Painted monasteries of Bucovina, Nicolae Ceaușescu's regime and 1989 revolution, gymnasts (Nadia Comăneci). Food: Sarmale (cabbage rolls), Mămăligă (polenta), Mici (grilled sausages). Religion: Predominantly Eastern Orthodox. Climate: Temperate-continental; distinct seasons. Brief History: Dacian kingdom, Roman province, part of Ottoman influence, Kingdom of Romania, communist rule post-WWII, joined EU 2007.",
    "Russia": "Capital: Moscow. Languages: Russian. Population: ~143.4 million. Currency: Russian Ruble (RUB). Known for being the world's largest country by land area, vodka, space program (Sputnik, Gagarin), and rich literature (Dostoevsky, Tolstoy). Also famous for: Tsarist history, Bolshevik Revolution, Cold War superpower (Soviet Union), vast natural resources, ballet (Bolshoi). Food: Pelmeni, Borscht, Blini. Religion: Predominantly Russian Orthodox Christianity, significant Muslim minorities. Climate: Highly diverse; ranges from humid continental to subarctic and tundra. Brief History: Kievan Rus', Mongol yoke, Tsardom of Russia, Russian Empire, Soviet Union (1922-1991), post-Soviet transition, current Federation.",
    "Rwanda": "Capital: Kigali. Languages: Kinyarwanda, French, English, Swahili. Population: ~13.5 million. Currency: Rwandan Franc (RWF). Known for the 1994 genocide against the Tutsi, mountain gorillas, rapid development post-genocide, and national cleanliness. Also famous for: Volcanoes National Park, coffee and tea production, high female representation in parliament. Food: Ugali (maize porridge), Isombe (cassava leaves), Brochettes (skewers). Religion: Predominantly Christian (Catholic and Protestant). Climate: Temperate tropical highland; mild due to high elevation. Brief History: Pre-colonial kingdom, German and Belgian colonization, ethnic tensions culminating in 1994 genocide, significant recovery and development under Paul Kagame.",
    "Saint Kitts and Nevis": "Capital: Basseterre. Languages: English. Population: ~53,000. Currency: East Caribbean Dollar (XCD). Known for being smallest sovereign state in Americas, sugar plantation history, and citizenship by investment. Also famous for: Brimstone Hill Fortress, green monkeys, and beaches. Food: Saltfish and dumplings. Religion: Christianity (Anglican majority). Climate: Tropical maritime; warm year-round. Brief History: British colony; independence 1983; economy shifted from sugar to tourism/services.",
    "Saint Lucia": "Capital: Castries. Languages: English. Population: ~184,000. Currency: East Caribbean Dollar (XCD). Known for Pitons (UNESCO site), jazz festival, and luxury resorts. Also famous for: drive-in volcano, banana production, and Nobel laureates. Food: Green figs and saltfish. Religion: Christianity (Catholic majority). Climate: Tropical maritime; warm year-round. Brief History: Alternating British/French rule; British colony; independence 1979; stable democracy.",
    "Saint Vincent and the Grenadines": "Capital: Kingstown. Languages: English. Population: ~111,000. Currency: East Caribbean Dollar (XCD). Known for Grenadines islands, sailing destinations, and banana production. Also famous for: La Soufrière volcano, Pirates of the Caribbean filming, and black sand beaches. Food: Roasted breadfruit and fried jackfish. Religion: Christianity (Anglican majority). Climate: Tropical maritime; warm year-round. Brief History: British colony; independence 1979; volcanic eruptions pose ongoing risk.",
    "Samoa": "Capital: Apia. Languages: Samoan, English. Population: ~200,000. Currency: Samoan Tālā (WST). Known for Fa'a Samoa traditions, rugby teams, and being first to see new day. Also famous for: Robert Louis Stevenson's home, fire knife dancing, and tropical forests. Food: Palusami (taro leaves in coconut cream). Religion: Christianity (majority). Climate: Tropical; warm and humid. Brief History: German then New Zealand rule; first Polynesian nation to regain independence (1962); traditional matai system persists.",
    "San Marino": "Capital: San Marino. Languages: Italian. Population: ~34,000. Currency: Euro (€). Known for being world's oldest republic, Mount Titano, and philately. Also famous for: three fortress towers, Formula 1 Grand Prix nearby, and tax haven status. Food: Italian-influenced cuisine. Religion: Christianity (Catholic majority). Climate: Mediterranean; mild winters. Brief History: Founded 301 AD; maintained independence through centuries; neutral in conflicts.",
    "Sao Tome and Principe": "Capital: São Tomé. Languages: Portuguese. Population: ~223,000. Currency: Dobra (STN). Known for chocolate production, biodiversity, and Portuguese colonial architecture. Also famous for: being Africa's second smallest country, potential oil reserves, and equatorial location. Food: Calulu (fish stew). Religion: Christianity (Catholic majority). Climate: Tropical; hot and humid. Brief History: Uninhabited before Portuguese colonization; sugar then cocoa plantations; independence 1975; stable democracy.",
    "Saudi Arabia": "Capital: Riyadh. Languages: Arabic. Population: ~35.9 million. Currency: Saudi Riyal (SAR). Known for being the birthplace of Islam (Mecca and Medina), vast oil reserves, and conservative Wahhabi Islamic monarchy. Also famous for: Hajj and Umrah pilgrimages, desert landscapes, role in OPEC, recent social reforms under Vision 2030. Food: Kabsa (spiced rice and meat), Shawarma, Dates. Religion: Predominantly Sunni Islam (Wahhabism is state-sponsored). Climate: Harsh, dry desert with extreme temperatures. Brief History: Unification under House of Saud in early 20th century, discovery of oil transformed country, key player in Middle East politics.",
    "Senegal": "Capital: Dakar. Languages: French (official), Wolof (widely spoken). Population: ~17.2 million. Currency: West African CFA franc (XOF). Known for Teranga (Wolof concept of hospitality), vibrant music scene (Mbalax), and former Dakar Rally endpoint. Also famous for: Gorée Island (slave trade history, UNESCO site), stable democracy in West Africa, Léopold Sédar Senghor (poet-president). Food: Thieboudienne (fish and rice), Yassa (chicken/fish with onion sauce). Religion: Predominantly Sunni Islam (Sufi orders influential). Climate: Tropical; hot, humid; rainy season May-Nov (south), dry season Dec-Apr (north). Brief History: Part of West African empires, French colony, independence 1960 (briefly with Mali), known for relative political stability.",
    "Serbia": "Capital: Belgrade. Languages: Serbian. Population: ~6.7 million. Currency: Serbian Dinar (RSD). Known for being a Balkan crossroads, tennis star Novak Djokovic, and Orthodox Christian heritage. Also famous for: Belgrade fortress, Exit music festival, raspberry production, role in WWI and Yugoslav wars. Food: Ćevapi (grilled minced meat), Pljeskavica (meat patty), Sarma (stuffed cabbage). Religion: Predominantly Serbian Orthodox Christian. Climate: Continental; cold winters, hot summers. Brief History: Medieval Serbian kingdom, Ottoman rule, key part of Yugoslavia, central role in 1990s conflicts, became independent republic after Montenegro's secession 2006.",
    "Seychelles": "Capital: Victoria. Languages: Seychellois Creole, English, French. Population: ~99,000. Currency: Seychellois Rupee (SCR). Known for luxury tourism, Aldabra giant tortoises, and pristine beaches. Also famous for: coco de mer nut, granite islands, and conservation efforts. Food: Grilled fish with curry. Religion: Christianity (Catholic majority). Climate: Tropical marine; warm year-round. Brief History: British colony; independence 1976; socialist then multiparty democracy; high-income economy.",
    "Sierra Leone": "Capital: Freetown. Languages: English (official), Krio (lingua franca). Population: ~8.4 million. Currency: Sierra Leonean Leone (SLL - redenominated in 2022). Known for 'blood diamond' history, brutal civil war (1991-2002), and being founded as a home for freed slaves (Freetown). Also famous for: Beaches, diamond mining challenges, resilience post-war and Ebola outbreak. Food: Cassava leaves stew, Groundnut stew, Fufu. Religion: Predominantly Muslim, significant Christian minority. Climate: Tropical monsoon; hot, humid; distinct wet and dry seasons. Brief History: Province of Freedom for freed slaves, British colony, independence 1961, devastated by civil war, ongoing recovery.",
    "Singapore": "Capital: Singapore. Languages: English, Malay, Mandarin Chinese, Tamil. Population: ~5.9 million. Currency: Singapore Dollar (SGD). Known for strict laws (e.g., on chewing gum), being a major global financial hub, multicultural society, and high efficiency. Also famous for: Gardens by the Bay, Marina Bay Sands, Changi Airport, hawker centre food culture, high population density. Food: Hainanese Chicken Rice, Chilli Crab, Laksa. Religion: Diverse; Buddhism, Christianity, Islam, Taoism, Hinduism. Climate: Tropical rainforest; hot, humid, rainy year-round. Brief History: British trading post founded 1819, part of Malaysia 1963-1965, rapid development since independence under Lee Kuan Yew.",
    "Slovakia": "Capital: Bratislava. Languages: Slovak. Population: ~5.5 million. Currency: Euro (EUR). Known for Carpathian Mountains, joining the EU (2004) and Eurozone (2009), and numerous medieval castles and chateaux. Also famous for: Ice hockey passion, Tatra mountains (shared with Poland), folk traditions. Food: Bryndzové halušky (potato dumplings with sheep cheese), Kapustnica (cabbage soup). Religion: Predominantly Roman Catholic. Climate: Temperate; continental influences, cool summers, cold winters. Brief History: Part of Great Moravia, Kingdom of Hungary, Czechoslovakia; peaceful 'Velvet Divorce' from Czech Republic 1993.",
    "Slovenia": "Capital: Ljubljana. Languages: Slovene. Population: ~2.1 million. Currency: Euro (EUR). Known for stunning Alpine scenery (Julian Alps), Lake Bled, joining the EU (2004), and Triglav National Park. Also famous for: Karst region (caves like Postojna), Adriatic coastline (short but scenic), high forest cover. Food: Potica (nut roll cake), Idrijski žlikrofi (dumplings), Jota (bean and sauerkraut soup). Religion: Predominantly Roman Catholic. Climate: Mix of Alpine, Continental, and Mediterranean influences. Brief History: Part of Holy Roman Empire, Austro-Hungarian Empire, Yugoslavia; first republic to declare independence 1991 (relatively peaceful secession).",
    "Solomon Islands": "Capital: Honiara. Languages: English. Population: ~720,000. Currency: Solomon Islands Dollar (SBD). Known for WWII battles, diving spots, and Melanesian culture. Also famous for: over 900 islands, logging industry, and ethnic tensions. Food: Fish with taro. Religion: Christianity (majority). Climate: Tropical monsoon; hot and humid. Brief History: British protectorate; intense WWII fighting; independence 1978; ethnic conflict 1998-2003.",
    "Somalia": "Capital: Mogadishu. Languages: Somali, Arabic. Population: ~17.1 million. Currency: Somali Shilling (SOS), US Dollar widely used. Known for having Africa's longest coastline, decades of civil war and instability, piracy off its coast (reduced now), and strong nomadic traditions. Also famous for: Frankincense and myrrh, Al-Shabaab insurgency, distinct Horn of Africa culture. Food: Canjeero (sourdough pancake), Bariis Iskukaris (spiced rice), Suqaar (diced meat). Religion: Predominantly Sunni Islam. Climate: Principally desert; hot and dry year-round. Brief History: British and Italian Somaliland unified 1960, Siad Barre dictatorship, state collapse 1991, ongoing conflict and efforts toward stability, Somaliland declared independence (unrecognized).",
    "South Africa": "Capital: Pretoria (administrative), Cape Town (legislative), Bloemfontein (judicial). Languages: 11 official languages including Zulu, Xhosa, Afrikaans, English. Population: ~60.1 million. Currency: South African Rand (ZAR). Known for Apartheid history and transition to democracy led by Nelson Mandela, rich biodiversity (Kruger National Park), and wine production. Also famous for: Table Mountain, Robben Island, rugby and cricket teams, diverse cultures ('Rainbow Nation'). Food: Bobotie, Biltong, Braai (barbecue). Religion: Predominantly Christian, minorities of Islam, Hinduism, Judaism, indigenous beliefs. Climate: Diverse; Mediterranean (Cape Town), subtropical (Durban), semi-arid (Karoo), temperate interior. Brief History: Dutch and British colonization, Boer Wars, Apartheid regime (1948-1994), democratic transition 1994.",
    "South Sudan": "Capital: Juba. Languages: English (official), Arabic, Dinka, Nuer. Population: ~11.4 million. Currency: South Sudanese Pound (SSP). Known for being the world's newest country (independence 2011), devastating civil conflicts since independence, and significant oil reserves. Also famous for: Vast swamps (Sudd), diverse ethnic groups, humanitarian challenges. Food: Kisra (sorghum flatbread), Asida (porridge), Ful medames. Religion: Predominantly Christian and traditional animist beliefs. Climate: Tropical; high humidity and rainfall. Brief History: Part of Anglo-Egyptian Sudan, long civil wars with north, independence referendum 2011, descended into internal conflict 2013.",
    "Spain": "Capital: Madrid. Languages: Spanish (Castilian - official nationwide), Catalan, Galician, Basque (co-official in regions). Population: ~47.4 million. Currency: Euro (EUR). Known for flamenco music and dance, siesta culture (less common now), La Liga football (Real Madrid, Barcelona), and diverse regions with distinct identities. Also famous for: Tapas, paella, Moorish architecture (Alhambra), bullfighting (controversial), artists (Picasso, Dalí, Gaudí). Food: Paella, Tortilla Española, Jamón Ibérico, Tapas. Religion: Predominantly Roman Catholic, growing secularism. Climate: Diverse; Mediterranean (south/east), Oceanic (north), Continental (interior). Brief History: Roman province, Visigothic kingdom, Moorish Al-Andalus, Reconquista, Spanish Empire, Franco dictatorship, transition to democracy.",
    "Sri Lanka": "Capital: Colombo (executive), Sri Jayawardenepura Kotte (legislative). Languages: Sinhala, Tamil (official). Population: ~22.2 million. Currency: Sri Lankan Rupee (LKR). Known for tea production (Ceylon tea), long civil war (ended 2009), beautiful beaches, and rich biodiversity ('Pearl of the Indian Ocean'). Also famous for: Ancient cities (Anuradhapura, Polonnaruwa), Buddhist heritage, spices, cricket. Food: Rice and curry, Kottu Roti, Hoppers (appa). Religion: Predominantly Theravada Buddhism (Sinhalese), significant Hindu (Tamil), Muslim, Christian minorities. Climate: Tropical monsoon; distinct wet seasons. Brief History: Ancient kingdoms, Portuguese, Dutch, British colonization (Ceylon), independence 1948, ethnic conflict between Sinhalese and Tamils.",
    "Sudan": "Capital: Khartoum. Languages: Arabic, English (official). Population: ~45.7 million. Currency: Sudanese Pound (SDG). Known for ancient Nubian civilizations (Kush kingdom), Darfur conflict, and the 2011 secession of South Sudan. Also famous for: Confluence of Blue and White Nile rivers in Khartoum, pyramids of Meroë, recent political turmoil and conflict. Food: Ful medames, Kisra, Asida. Religion: Predominantly Sunni Islam. Climate: Hot and dry; arid desert north, tropical south. Brief History: Anglo-Egyptian Sudan, independence 1956, long civil wars between north and south, Omar al-Bashir regime, 2019 revolution, ongoing instability and conflict.",
    "Suriname": "Capital: Paramaribo. Languages: Dutch (official), Sranan Tongo (lingua franca). Population: ~612,000. Currency: Surinamese Dollar (SRD). Known for vast pristine rainforests, Dutch colonial heritage (Paramaribo UNESCO site), and highly diverse ethnic makeup (Indian, Creole, Javanese, Maroon). Also famous for: Being smallest South American country by population, bauxite mining (historically), unique cultural blend. Food: Pom (chicken and root vegetable casserole), Roti, Moksi Alesi (mixed rice). Religion: Diverse; Christian, Hindu, Muslim. Climate: Tropical; hot, humid, rainy. Brief History: British and Dutch colony (focus on sugar plantations), independence 1975, periods of military rule and economic difficulty.",
    "Sweden": "Capital: Stockholm. Languages: Swedish. Population: ~10.4 million. Currency: Swedish Krona (SEK). Known for IKEA, ABBA, comprehensive welfare state, Nobel Prizes, and midnight sun/northern lights. Also famous for: High levels of innovation, design, forests and lakes, pop music export, neutrality (historically). Food: Köttbullar (meatballs), Gravlax, Smörgåsbord. Religion: Historically Lutheran (Church of Sweden), highly secular society. Climate: Temperate south, subarctic north; significant influence from Gulf Stream. Brief History: Viking Age, Kalmar Union, Swedish Empire (17th century), long period of peace and neutrality, developed extensive social welfare system.",
    "Switzerland": "Capital: Bern. Languages: German, French, Italian, Romansh. Population: ~8.7 million. Currency: Swiss Franc (CHF). Known for political neutrality, high-quality watches, international banking, the Alps, and chocolate. Also famous for: Direct democracy system, cheese (fondue, raclette), Red Cross founding, efficiency, scenic railways. Food: Fondue, Raclette, Rösti, Zürcher Geschnetzeltes. Religion: Roughly equal Catholic and Protestant, growing non-religious population. Climate: Temperate, but varies greatly with altitude (Alpine). Brief History: Old Swiss Confederacy formed late 13th century, maintained neutrality through major European wars, known for stability and prosperity.",
    "Syria": "Capital: Damascus. Languages: Arabic. Population: ~21.3 million. Currency: Syrian Pound (SYP). Known for ancient civilizations (including Damascus, one of oldest continuously inhabited cities), ongoing devastating civil war since 2011, and historical Damascus steel. Also famous for: Rich archaeological sites (Palmyra, Krak des Chevaliers - many damaged/destroyed), diverse religious/ethnic groups, complex geopolitics. Food: Kibbeh, Fattoush, Shawarma, Mezze platters. Religion: Predominantly Sunni Islam, significant Alawite, Christian, Druze minorities. Climate: Mostly desert; hot summers, mild winters; Mediterranean coast. Brief History: Crossroads of civilizations, part of Ottoman Empire, French mandate, independence 1946, Ba'athist rule under Assad family since 1970, ongoing civil war.",
    "Taiwan": "Capital: Taipei. Languages: Mandarin Chinese (official), Taiwanese Hokkien, Hakka. Population: ~23.6 million. Currency: New Taiwan Dollar (TWD). Known for being a global leader in semiconductor manufacturing (TSMC), vibrant democracy, and disputed political status with China. Also famous for: Taipei 101 skyscraper, night markets, bubble tea origin, and cycling culture. Food: Beef noodle soup, xiaolongbao (soup dumplings), oyster omelet. Religion: Mix of Buddhism, Taoism, folk religions, with Christian minority. Climate: Subtropical; hot humid summers and mild winters. Brief History: Inhabited by Austronesian peoples for millennia; Dutch/Spanish colonies in 17th century; Qing Dynasty rule (1683-1895); Japanese colony (1895-1945); ROC government relocated here after Chinese Civil War (1949); developed into economic powerhouse with democratic reforms (1980s-90s).",
    "Tajikistan": "Capital: Dushanbe. Languages: Tajik (Persian dialect). Population: ~9.8 million. Currency: Tajikistani Somoni (TJS). Known for rugged mountainous terrain (Pamir Mountains cover 90%), civil war history (1990s), and strong Persian cultural influence. Also famous for: Being poorest Central Asian republic, reliance on remittances, hydro-electric potential (Nurek Dam). Food: Plov (Osh - rice pilaf), Qurutob (bread and yogurt dish), Laghman (noodles). Religion: Predominantly Sunni Islam (Hanafi school). Climate: Mid-latitude continental; harsh winters in Pamirs, hot summers in lowlands. Brief History: Part of Persian empires, Russian conquest, Soviet republic, independence 1991 followed by civil war, authoritarian rule under Emomali Rahmon.",
    "United Republic of Tanzania": "Capital: Dodoma (official), Dar es Salaam (economic). Languages: Swahili, English. Population: ~63.6 million. Currency: Tanzanian Shilling (TZS). Known for world-renowned wildlife safaris (Serengeti, Ngorongoro Crater), Mount Kilimanjaro (Africa's highest peak), and the island of Zanzibar. Also famous for: Great Rift Valley, Olduvai Gorge (paleoanthropology), diverse ethnic groups. Food: Ugali, Nyama Choma (grilled meat), Zanzibar pizza. Religion: Roughly equal Christian and Muslim populations, traditional beliefs. Climate: Varies from tropical coast to temperate highlands. Brief History: Tanganyika and Zanzibar unified 1964, German and British colonial past, socialist policies under Nyerere (Ujamaa), generally stable politically.",
    "Thailand": "Capital: Bangkok. Languages: Thai. Population: ~70.0 million. Currency: Thai Baht (THB). Known for ornate Buddhist temples, stunning beaches and islands, vibrant street food culture, and being the 'Land of Smiles'. Also famous for: Constitutional monarchy, Muay Thai (kickboxing), floating markets, tourism industry, never being formally colonized by Europeans. Food: Pad Thai, Tom Yum Goong, Green Curry. Religion: Predominantly Theravada Buddhism. Climate: Tropical monsoon; hot and humid, distinct wet and dry seasons. Brief History: Sukhothai and Ayutthaya kingdoms, Kingdom of Siam, modernization under King Chulalongkorn, periods of military rule interspersed with democracy.",
    "Togo": "Capital: Lomé. Languages: French (official), Ewe, Kabiyè. Population: ~8.6 million. Currency: West African CFA franc (XOF). Known for voodoo traditions (large fetish market in Lomé), phosphate mining, and German/French colonial architecture. Also famous for: Being a narrow country, Gnassingbé family political dynasty, Koutammakou landscape (UNESCO site). Food: Fufu, Akume (corn porridge), Gboma Dessi (spinach stew). Religion: Traditional indigenous beliefs (Voodoo prominent), Christian, Muslim minorities. Climate: Tropical; hot and humid south, semi-arid north. Brief History: German Togoland, split between Britain and France post-WWI, French Togoland gained independence 1960, long rule by Eyadéma Gnassingbé followed by his son.",
    "Tonga": "Capital: Nuku'alofa. Languages: Tongan, English. Population: ~106,000. Currency: Tongan Paʻanga (TOP). Known for being the last remaining Polynesian monarchy, strong passion for rugby union, and significant influence of Christian missionaries. Also famous for: Composed of over 170 islands (many uninhabited), traditional culture (Ta'ovala mats), recent volcanic eruption and tsunami (2022). Food: Lu Pulu (taro leaves with corned beef/lamb in coconut milk), Ota Ika (raw fish salad). Religion: Predominantly Christian (Methodist, Catholic, Mormon). Climate: Tropical maritime; warm year-round. Brief History: Never formally colonized, maintained monarchy under British protectorate status, known for large diaspora.",
    "Trinidad and Tobago": "Capital: Port of Spain. Languages: English (official), Trinidadian Creole, Tobagonian Creole. Population: ~1.4 million. Currency: Trinidad and Tobago Dollar (TTD). Known for vibrant Carnival celebrations (origin of steelpan music and calypso), significant oil and gas reserves, and rich multicultural society (African, Indian, European, Chinese heritage). Also famous for: Pitch Lake (largest natural asphalt deposit), Asa Wright Nature Centre, birthplace of limbo dance. Food: Doubles, Roti (esp. Buss-up-shut), Callaloo. Religion: Diverse; Christian (Catholic, Protestant), Hindu, Muslim. Climate: Tropical maritime; hot and humid. Brief History: Spanish colony (Trinidad), British colony (Tobago), united under British rule, independence 1962, became a republic 1976.",
    "Tunisia": "Capital: Tunis. Languages: Arabic. Population: ~11.9 million. Currency: Tunisian Dinar (TND). Known for being the birthplace of the Arab Spring (2011 Jasmine Revolution), ancient ruins of Carthage, and Mediterranean beaches popular with European tourists. Also famous for: Star Wars filming locations, olive oil production, Bardo National Museum (Roman mosaics). Food: Couscous, Brik (savory pastry), Harissa (chili paste). Religion: Predominantly Sunni Islam. Climate: Mediterranean coast (hot summers, mild winters), arid interior. Brief History: Carthaginian empire, Roman province, Arab conquest, Ottoman rule, French protectorate, independence 1956, Ben Ali dictatorship overthrown 2011.",
    "Turkey": "Capital: Ankara. Languages: Turkish. Population: ~85.0 million. Currency: Turkish Lira (TRY). Known for the legacy of the Ottoman Empire, its strategic location bridging Europe and Asia (Istanbul), and Turkish delight candy. Also famous for: Hagia Sophia, Cappadocia (fairy chimneys), Ephesus ruins, kebabs, Turkish coffee, founder Mustafa Kemal Atatürk. Food: Kebab varieties, Meze, Baklava, Börek. Religion: Predominantly Sunni Islam, significant Alevi minority, historically Christian/Jewish presence. Climate: Diverse; Mediterranean coast, oceanic Black Sea coast, continental interior. Brief History: Hittite/Greek/Roman presence, Byzantine Empire, Seljuk Turks, Ottoman Empire, Republic founded 1923 by Atatürk.",
    "Turkmenistan": "Capital: Ashgabat. Languages: Turkmen. Population: ~6.3 million. Currency: Turkmenistani Manat (TMT). Known for vast natural gas reserves, highly authoritarian government and personality cults (past and present), and extravagant white marble architecture in Ashgabat. Also famous for: Darvaza gas crater ('Gates of Hell'), neutrality policy, Akhal-Teke horses, intricate carpets. Food: Plov, Shurpa (soup), Manty (dumplings). Religion: Predominantly Sunni Islam. Climate: Extreme continental desert; very hot summers, cold winters. Brief History: Part of ancient empires, Russian conquest, Soviet republic, independence 1991, ruled by Saparmurat Niyazov ('Turkmenbashi') then Gurbanguly Berdimuhamedow (now his son).",
    "Tuvalu": "Capital: Funafuti. Languages: Tuvaluan, English. Population: ~11,000. Currency: Tuvaluan Dollar, Australian Dollar (AUD). Known for extreme vulnerability to climate change and sea-level rise, leasing its '.tv' internet domain for revenue, and being one of the world's smallest and most remote nations. Also famous for: Composed of low-lying coral atolls, Polynesian culture, reliance on international aid. Food: Pulaka (swamp taro), Fish, Coconut-based dishes. Religion: Predominantly Christian (Church of Tuvalu). Climate: Tropical maritime; hot and humid, affected by cyclones. Brief History: British colony (Gilbert and Ellice Islands), separated from Kiribati, independence 1978.",
    "Uganda": "Capital: Kampala. Languages: English, Swahili (official), Luganda widely spoken. Population: ~47.1 million. Currency: Ugandan Shilling (UGX). Known for mountain gorillas (Bwindi Impenetrable Forest), being the 'Pearl of Africa' (as named by Churchill), and the source of the Nile River (Lake Victoria). Also famous for: Idi Amin dictatorship history, diverse wildlife (including tree-climbing lions), significant refugee hosting. Food: Matoke (steamed plantain), Rolex (chapati roll), Groundnut stew. Religion: Predominantly Christian (Catholic and Anglican). Climate: Tropical; generally rainy with dry seasons, semi-arid northeast. Brief History: Buganda kingdom and others, British protectorate, independence 1962, Idi Amin's reign of terror, Yoweri Museveni in power since 1986.",
    "Ukraine": "Capital: Kyiv. Languages: Ukrainian. Population: ~43.8 million (pre-2022 full invasion). Currency: Ukrainian Hryvnia (UAH). Known for being a major agricultural producer ('breadbasket of Europe'), the ongoing full-scale war with Russia (since Feb 2022, preceded by 2014 conflict), and historic Orthodox churches (Kyiv Pechersk Lavra). Also famous for: Chernobyl disaster (1986), Carpathian Mountains, Black Sea coast, borscht (often claimed national dish). Food: Borscht, Varenyky (dumplings), Holubtsi (cabbage rolls). Religion: Predominantly Eastern Orthodox Christianity. Climate: Mostly temperate continental; Mediterranean on Crimean coast. Brief History: Kyivan Rus', part of Polish-Lithuanian Commonwealth/Russian Empire/Austria-Hungary, Soviet republic, independence 1991, Orange Revolution (2004), Euromaidan Revolution (2014), Russian annexation of Crimea (2014) and full invasion (2022).",
    "United Arab Emirates": "Capital: Abu Dhabi. Languages: Arabic. Population: ~9.9 million. Currency: UAE Dirham (AED). Known for vast oil wealth (especially Abu Dhabi), luxury shopping and futuristic architecture (especially Dubai - Burj Khalifa), large expatriate majority population, and major airline hubs (Emirates, Etihad). Also famous for: Man-made islands (Palm Jumeirah), desert safaris, being a federation of seven emirates. Food: Al Machboos, Harees, Shawarma. Religion: Predominantly Sunni Islam. Climate: Hot desert; extremely high summer temperatures and humidity. Brief History: Trucial States under British protection, federation formed 1971, rapid transformation fueled by oil discovery.",
    "United Kingdom": "Capital: London. Languages: English. Population: ~67.3 million. Currency: Pound Sterling (GBP). Known for the former British Empire, the Royal Family (monarchy), Shakespeare, The Beatles, Premier League football, and Brexit. Also famous for: Pub culture, iconic landmarks (Big Ben, Stonehenge), diverse accents, historical influence on global language/law/culture. Food: Fish and Chips, Sunday Roast, Full English Breakfast, Afternoon Tea. Religion: Historically Christian (Anglican, Catholic), increasingly diverse/secular. Climate: Temperate maritime; mild winters, cool summers, changeable weather. Brief History: Roman Britain, Anglo-Saxons, Norman Conquest, union of England/Scotland/Wales/Northern Ireland, global empire, major role in World Wars, post-war welfare state.",
    "United States": "Capital: Washington, D.C.. Languages: English (de facto). Population: ~331 million. Currency: US Dollar (USD). Known for being a global superpower, Hollywood film industry, diverse landscapes (Grand Canyon, Yellowstone), major tech innovation hub (Silicon Valley), and cultural exports (jazz, rock, hip-hop). Also famous for: Declaration of Independence/Constitution, Civil War, Great Depression, role in World Wars/Cold War, national parks system. Food: Hamburger, Hot Dog, Apple Pie, Barbecue variations. Religion: Predominantly Christian (diverse denominations), growing non-religious population, various minority faiths. Climate: Extremely diverse; ranges from arctic (Alaska) and tropical (Hawaii) to arid desert and humid continental. Brief History: Indigenous peoples, European colonization, independence 1776, westward expansion, industrialization, emerged as world power post-WWII.",
    "Uruguay": "Capital: Montevideo. Languages: Spanish. Population: ~3.5 million. Currency: Uruguayan Peso (UYU). Known for progressive social policies (legalized cannabis, same-sex marriage early), strong football tradition (won first World Cup, Suárez, Forlán), and high consumption of yerba mate. Also famous for: Beef production and export, stable democracy, beautiful beaches (Punta del Este). Food: Asado (barbecue), Chivito (steak sandwich), Dulce de Leche. Religion: Historically Catholic, highly secular society. Climate: Humid subtropical; mild winters, warm summers. Brief History: Contested by Spain/Portugal, independence influenced by José Artigas, known for stability and social development compared to neighbors.",
    "Uzbekistan": "Capital: Tashkent. Languages: Uzbek. Population: ~35.6 million. Currency: Uzbekistani So'm (UZS). Known for stunning Silk Road cities (Samarkand, Bukhara, Khiva) with intricate Islamic architecture, significant cotton production (historically controversial labor practices), and being doubly landlocked. Also famous for: Rich history involving Timur (Tamerlane), Soviet legacy, recent reforms opening the country. Food: Plov (national dish), Samsa (savory pastry), Laghman (noodles). Religion: Predominantly Sunni Islam. Climate: Continental desert; hot summers, cool winters. Brief History: Center of ancient empires/trade routes, Russian conquest, Soviet republic, independence 1991, authoritarian rule under Islam Karimov, recent period of cautious reform.",
    "Vanuatu": "Capital: Port Vila. Languages: Bislama, English, French. Population: ~315,000. Currency: Vanuatu Vatu (VUV). Known for its active volcanic islands, being ranked high on the Happy Planet Index, and the unique land diving ritual (naghol) on Pentecost Island (inspiration for bungee jumping). Also famous for: Strong kastom (traditional culture), over 100 indigenous languages, vulnerability to natural disasters (cyclones, earthquakes). Food: Laplap (root vegetable pudding), Simboro (stuffed cabbage rolls), Coconut Crab. Religion: Predominantly Christian (various denominations), traditional beliefs influential. Climate: Tropical maritime; hot, rainy season Nov-Apr. Brief History: Jointly ruled by Britain and France (New Hebrides Condominium), independence 1980.",
    "Vatican City": "Capital: Vatican City. Languages: Italian, Latin. Population: ~800. Currency: Euro (EUR). Known for being the world's smallest independent state (both area and population), the global headquarters of the Roman Catholic Church, home to the Pope, and guarded by the Swiss Guard. Also famous for: St. Peter's Basilica, St. Peter's Square, Vatican Museums (including Sistine Chapel), its unique status as an enclave within Rome, Italy. Food: Italian cuisine. Religion: Roman Catholic. Climate: Temperate Mediterranean (same as Rome). Brief History: Established by Lateran Treaty 1929 with Italy, successor to Papal States, center of Catholic faith for centuries.",
    "Venezuela": "Capital: Caracas. Languages: Spanish. Population: ~28.4 million. Currency: Venezuelan Bolívar (VEF/VES - subject to hyperinflation and changes). Known for possessing the world's largest proven oil reserves, severe ongoing economic and political crisis leading to mass emigration, numerous Miss Universe winners, and baseball passion. Also famous for: Angel Falls (world's highest waterfall), diverse landscapes (Andes, Amazon, Caribbean coast), Hugo Chávez's 'Bolivarian Revolution'. Food: Arepas, Pabellón Criollo (national dish), Hallacas (Christmas dish). Religion: Predominantly Roman Catholic. Climate: Tropical; hot and humid, varies with altitude. Brief History: Spanish colony, independence led by Simón Bolívar, periods of dictatorship and democracy, oil wealth boom, recent political/economic collapse.",
    "Vietnam": "Capital: Hanoi. Languages: Vietnamese. Population: ~98.2 million. Currency: Vietnamese Đồng (VND). Known for the Vietnam War (American War), rapid economic growth (Doi Moi reforms), traditional ao dai dresses, and strong coffee culture (esp. Robusta). Also famous for: Ha Long Bay (UNESCO site), Mekong Delta, pho noodle soup, French colonial architecture (Hanoi, Ho Chi Minh City), resilience and unification. Food: Pho, Banh Mi, Goi Cuon (spring rolls). Religion: Officially atheist state, but folk traditions, Buddhism, Taoism, Confucianism widely practiced; Catholic minority. Climate: Tropical monsoon south; subtropical north; varies significantly. Brief History: Chinese domination, independent kingdoms, French Indochina, partition North/South, Vietnam War, reunification 1975, economic liberalization since 1986.",
    "West Bank": "Capital: Ramallah (administrative), Jerusalem (claimed). Languages: Arabic, Hebrew. Population: ~3 million (including Israeli settlers). Currency: Israeli shekel (ILS), Jordanian dinar (JOD). Known for its geopolitical significance in the Israeli-Palestinian conflict, holy sites (including Bethlehem and Hebron), and ongoing territorial disputes. Also famous for: ancient olive groves, separation barrier, and divided governance (Palestinian Authority areas vs. Israeli settlements). Food: Musakhan (roasted chicken with sumac), maqluba (upside-down rice dish), olive oil. Religion: Islam (majority), Judaism (settlements), Christianity (historic communities). Climate: Mediterranean; hot, dry summers and cool, rainy winters. Brief History: Part of Ottoman Empire; British Mandate (1920-1948); Jordanian control (1948-1967); Israeli occupation since 1967; partial Palestinian self-rule since Oslo Accords (1990s).",
    "Western Sahara": "Capital: Laayoune (controlled by Morocco), Tifariti (proclaimed by Polisario Front). Languages: Arabic, Hassaniya dialect, Spanish. Population: ~600,000. Currency: Moroccan dirham (MAD) in controlled areas, Algerian dinar (DZD) and Mauritanian ouguiya (MRU) in refugee camps. Known for being a disputed territory in North Africa with ongoing conflict between Morocco and the Sahrawi Arab Democratic Republic (SADR). Also famous for: vast phosphate reserves, nomadic Berber heritage, and one of the world's longest minefield barriers (Berm). Food: Camel milk, couscous with lamb, and traditional Sahrawi tea ceremony. Religion: Sunni Islam. Climate: Harsh desert; extremely arid with minimal rainfall. Brief History: Former Spanish colony (Spanish Sahara until 1975); contested by Morocco, Mauritania, and Polisario Front; UN-administered since 1991 ceasefire; approximately 80% controlled by Morocco, with remaining areas administered by SADR or as buffer zones.",
    "Yemen": "Capital: Sana'a (Houthi-controlled), Aden (internationally recognized govt.). Languages: Arabic. Population: ~33 million. Currency: Yemeni Rial (YER). Known for its ancient civilizations (Sabaean kingdom), ongoing devastating civil war involving regional powers, being a historical origin point for coffee, and unique architecture (Sana'a Old City - UNESCO). Also famous for: Socotra island (unique biodiversity), frankincense and myrrh trade history, Qat chewing habit, humanitarian crisis. Food: Saltah (meat stew - national dish), Mandi (rice and meat), Fattah. Religion: Predominantly Islam (split between Sunni Shafi'i and Shia Zaydi). Climate: Mostly desert; hot and humid coast, temperate mountains, extremely hot desert east. Brief History: Ancient kingdoms, Ottoman/British influence, North and South Yemen unified 1990, Houthi rebellion escalated into civil war 2014.",
    "Zambia": "Capital: Lusaka. Languages: English (official), Bemba, Nyanja, Tonga (major regional). Population: ~19.5 million. Currency: Zambian Kwacha (ZMW). Known for significant copper mining industry, Victoria Falls (shared with Zimbabwe), diverse wildlife safaris (South Luangwa, Lower Zambezi), and the Zambezi River. Also famous for: Being landlocked, peaceful transitions of power (relative to region), Kafue National Park. Food: Nshima (maize porridge - staple), Ifisashi (greens in peanut sauce), Kapenta (dried fish). Religion: Predominantly Christian (various denominations). Climate: Tropical; modified by altitude; distinct wet and dry seasons. Brief History: British protectorate (Northern Rhodesia), independence 1964 led by Kenneth Kaunda, reliance on copper prices, transition to multi-party democracy.",
    "Zimbabwe": "Capital: Harare. Languages: 16 official languages including English, Shona, Ndebele. Population: ~15.1 million. Currency: Zimbabwean Dollar (ZWL), multi-currency system often used (esp. USD). Known for periods of extreme hyperinflation, the long rule and legacy of Robert Mugabe, and significant wildlife conservation areas (Hwange National Park). Also famous for: Victoria Falls (shared with Zambia), Great Zimbabwe ruins (ancient city, namesake), Balancing Rocks, land reform controversy. Food: Sadza (maize porridge - staple), Nyama (meat stews), Mopane worms. Religion: Predominantly Christian (syncretic with traditional beliefs). Climate: Subtropical; moderated by altitude; rainy season Oct-Mar. Brief History: British colony (Southern Rhodesia), Unilateral Declaration of Independence (UDI) by white minority 1965, Bush War, recognized independence 1980, Mugabe era marked by political/economic challenges, 2017 coup."
}