{
    "Afghanistan": "Capital: Kabul. Population: ~40.1 million. Known for rugged mountainous terrain, historic Silk Road location, and decades of conflict.",
    "Albania": "Capital: Tirana. Population: ~2.8 million. Known for beautiful beaches, bunkers from communist era, and unique language isolate.",
    "Algeria": "Capital: Algiers. Population: ~44.6 million. Known for being the largest country in Africa, Sahara Desert, and oil and gas reserves.",
    "Andorra": "Capital: Andorra la Vella. Population: ~77,000. Known for ski resorts, tax haven, and tiny mountainous principality.",
    "Angola": "Capital: Luanda. Population: ~34.5 million. Known for oil production, Portuguese colonial architecture, and long civil war.",
    "Antigua and Barbuda": "Capital: Saint John's. Population: ~98,000. Known for 365 beaches, sailing destinations, and Carnival celebrations.",
    "Argentina": "Capital: Buenos Aires. Population: ~45.8 million. Known for tango, beef production, Patagonia region, and Maradona and Messi.",
    "Armenia": "Capital: Yerevan. Population: ~2.9 million. Known for being the first Christian nation, chess masters, and Armenian Genocide memory.",
    "Australia": "Capital: Canberra. Population: ~26.0 million. Known for the Outback, kangaroos, Great Barrier Reef, and surfing culture.",
    "Austria": "Capital: Vienna. Population: ~9.0 million. Known for the Alps, classical music (Mozart, Strauss), skiing, and coffeehouse culture.",
    "Azerbaijan": "Capital: Baku. Population: ~10.1 million. Known for oil reserves, fire mountain (Yanar Dag), and Eurovision 2011 winner.",
    "Bahamas": "Capital: Nassau. Population: ~400,000. Known for crystal clear waters, luxury resorts, and swimming pigs.",
    "Bahrain": "Capital: Manama. Population: ~1.5 million. Known for pearl diving history, Formula 1 Grand Prix, and financial hub.",
    "Bangladesh": "Capital: Dhaka. Population: ~169.4 million. Known for the world's largest river delta, garment industry, and frequent flooding.",
    "Barbados": "Capital: Bridgetown. Population: ~287,000. Known for Rihanna, rum production, cricket, and British colonial history.",
    "Belarus": "Capital: Minsk. Population: ~9.3 million. Known for being the last dictatorship in Europe, vast forests, and IT outsourcing hub.",
    "Belgium": "Capital: Brussels. Population: ~11.6 million. Known for EU headquarters, chocolate, beer, and comic books (Tintin, Smurfs).",
    "Belize": "Capital: Belmopan. Population: ~400,000. Known for the barrier reef, being an English-speaking country in Central America, and jungle wildlife.",
    "Benin": "Capital: Porto-Novo. Population: ~12.5 million. Known for being the birthplace of voodoo, slave coast history, and cotton production.",
    "Bhutan": "Capital: Thimphu. Population: ~780,000. Known for Gross National Happiness index, Buddhist culture, and Himalayan landscapes.",
    "Bolivia": "Capital: Sucre (official), La Paz (administrative). Population: ~11.8 million. Known for the highest capital city (La Paz), indigenous cultures, and lithium reserves.",
    "Bosnia and Herzegovina": "Capital: Sarajevo. Population: ~3.3 million. Known for 1990s war, ethnic diversity, and beautiful old towns.",
    "Botswana": "Capital: Gaborone. Population: ~2.4 million. Known for diamond mining, stable democracy, and wildlife safaris.",
    "Brazil": "Capital: Brasília. Population: ~214 million. Known for Carnival, soccer (Pelé, Ronaldo), samba, and vast biodiversity.",
    "Brunei": "Capital: Bandar Seri Begawan. Population: ~440,000. Known for oil wealth, absolute monarchy, and strict Islamic laws.",
    "Bulgaria": "Capital: Sofia. Population: ~6.8 million. Known for rose oil production, Cyrillic alphabet, and yogurt.",
    "Burkina Faso": "Capital: Ouagadougou. Population: ~21.5 million. Known for gold production, film festival, and Sahel region droughts.",
    "Burundi": "Capital: Gitega. Population: ~12.6 million. Known for coffee production, ethnic conflicts, and being one of world's poorest countries.",
    "Cambodia": "Capital: Phnom Penh. Population: ~16.9 million. Known for the Khmer Empire, Killing Fields, and traditional Apsara dance.",
    "Cameroon": "Capital: Yaoundé. Population: ~27.2 million. Known for diverse geography (beaches, deserts, mountains), and football team.",
    "Canada": "Capital: Ottawa. Population: ~38.0 million. Known for maple syrup, hockey, politeness, and vast wilderness areas.",
    "Cape Verde": "Capital: Praia. Population: ~560,000. Known for Creole culture, morna music, and Atlantic archipelago.",
    "Central African Republic": "Capital: Bangui. Population: ~4.9 million. Known for diamonds, political instability, and rainforests.",
    "Chad": "Capital: N'Djamena. Population: ~16.9 million. Known for desert landscapes, oil reserves, and being one of poorest countries.",
    "Chile": "Capital: Santiago. Population: ~19.5 million. Known for long narrow shape, Atacama Desert, and wine production.",
    "China": "Capital: Beijing. Population: ~1.4 billion. Known for ancient civilization, manufacturing hub, pandas, and rapid economic growth.",
    "Colombia": "Capital: Bogotá. Population: ~51.5 million. Known for coffee, emeralds, Gabriel García Márquez, and diverse landscapes.",
    "Comoros": "Capital: Moroni. Population: ~900,000. Known for volcanic islands, perfume production, and political instability.",
    "Congo (Democratic Republic)": "Capital: Kinshasa. Population: ~95.2 million. Known for rainforests, mineral wealth, and long civil conflicts.",
    "Congo (Republic)": "Capital: Brazzaville. Population: ~5.8 million. Known for oil production, rainforests, and French colonial architecture.",
    "Costa Rica": "Capital: San José. Population: ~5.2 million. Known for ecotourism, no standing army, and high quality of life.",
    "Croatia": "Capital: Zagreb. Population: ~4.0 million. Known for Dalmatian Coast, Game of Thrones filming locations, and football talent.",
    "Cuba": "Capital: Havana. Population: ~11.3 million. Known for communist revolution, classic cars, cigars, and salsa music.",
    "Cyprus": "Capital: Nicosia. Population: ~1.2 million. Known for divided capital, Aphrodite's birthplace, and strategic Mediterranean location.",
    "Czech Republic": "Capital: Prague. Population: ~10.7 million. Known for Pilsner beer, Bohemian culture, and medieval architecture.",
    "Denmark": "Capital: Copenhagen. Population: ~5.8 million. Known for LEGO, Andersen's fairy tales, hygge, and bicycle culture.",
    "Djibouti": "Capital: Djibouti City. Population: ~1.0 million. Known for strategic port location, salt lakes, and French military base.",
    "Dominica": "Capital: Roseau. Population: ~72,000. Known for Nature Island, volcanic features, and lush rainforests.",
    "Dominican Republic": "Capital: Santo Domingo. Population: ~11.1 million. Known for baseball talent, merengue music, and all-inclusive resorts.",
    "Ecuador": "Capital: Quito. Population: ~17.8 million. Known for biodiversity, equatorial line monument, and Panama hats (actually Ecuadorian).",
    "Egypt": "Capital: Cairo. Population: ~109 million. Known for ancient civilization, Nile River, Suez Canal, and Arab Spring.",
    "El Salvador": "Capital: San Salvador. Population: ~6.5 million. Known for pupusas, surfing spots, and gang violence challenges.",
    "Equatorial Guinea": "Capital: Malabo. Population: ~1.5 million. Known for oil wealth, being a Spanish-speaking African country, and authoritarian government.",
    "Eritrea": "Capital: Asmara. Population: ~3.6 million. Known for military conscription, Red Sea location, and Italian colonial heritage.",
    "Estonia": "Capital: Tallinn. Population: ~1.3 million. Known for digital society, medieval architecture, and Baltic singing tradition.",
    "Eswatini": "Capital: Mbabane (administrative), Lobamba (royal). Population: ~1.2 million. Known for absolute monarchy, HIV/AIDS challenges, and traditional reed dance.",
    "Ethiopia": "Capital: Addis Ababa. Population: ~120 million. Known for coffee origin, ancient Christian tradition, and African Union headquarters.",
    "Fiji": "Capital: Suva. Population: ~900,000. Known for rugby team, tropical paradise, and Indo-Fijian culture.",
    "Finland": "Capital: Helsinki. Population: ~5.5 million. Known for saunas, education system, Nokia, and Santa Claus Village.",
    "France": "Capital: Paris. Population: ~67.8 million. Known for wine, fashion, art museums, revolution, and haute cuisine.",
    "Gabon": "Capital: Libreville. Population: ~2.3 million. Known for oil wealth, rainforests, and low population density.",
    "Gambia": "Capital: Banjul. Population: ~2.5 million. Known for being the smallest mainland African country, river Gambia, and ecotourism.",
    "Georgia": "Capital: Tbilisi. Population: ~3.7 million. Known for wine birthplace, Caucasus mountains, and unique alphabet.",
    "Germany": "Capital: Berlin. Population: ~83.2 million. Known for beer, cars (BMW, Mercedes), Oktoberfest, and Berlin Wall history.",
    "Ghana": "Capital: Accra. Population: ~32.1 million. Known for Gold Coast history, stable democracy, and kente cloth.",
    "Greece": "Capital: Athens. Population: ~10.7 million. Known for ancient philosophy, mythology, island beauty, and financial crisis.",
    "Grenada": "Capital: St. George's. Population: ~113,000. Known for Spice Island (nutmeg), Caribbean beauty, and 1983 US invasion.",
    "Guatemala": "Capital: Guatemala City. Population: ~17.6 million. Known for Mayan heritage, coffee, volcanoes, and colorful textiles.",
    "Guinea": "Capital: Conakry. Population: ~13.5 million. Known for bauxite reserves, Ebola outbreak, and West African music.",
    "Guinea-Bissau": "Capital: Bissau. Population: ~2.0 million. Known for cashew production, political instability, and Creole culture.",
    "Guyana": "Capital: Georgetown. Population: ~790,000. Known for being the only English-speaking South American country, Caribbean culture, and rainforests.",
    "Haiti": "Capital: Port-au-Prince. Population: ~11.4 million. Known for being the first black republic, voodoo religion, and poverty and natural disasters.",
    "Honduras": "Capital: Tegucigalpa. Population: ~10.1 million. Known for banana exports, violence challenges, and Mayan heritage.",
    "Hungary": "Capital: Budapest. Population: ~9.6 million. Known for thermal spas, paprika, 1956 revolution, and Rubik's cube.",
    "Iceland": "Capital: Reykjavik. Population: ~370,000. Known for volcanoes, geysers, Nordic welfare model, and small population.",
    "India": "Capital: New Delhi. Population: ~1.4 billion. Known for Bollywood, IT industry, spices, and diverse cultures and religions.",
    "Indonesia": "Capital: Jakarta. Population: ~276 million. Known for being the world's largest archipelago, diverse cultures, and Komodo dragons.",
    "Iran": "Capital: Tehran. Population: ~85 million. Known for ancient Persian Empire, Islamic Revolution, and nuclear program.",
    "Iraq": "Capital: Baghdad. Population: ~42 million. Known for Mesopotamia cradle of civilization, oil reserves, and recent conflicts.",
    "Ireland": "Capital: Dublin. Population: ~5.0 million. Known for Celtic culture, pubs, literature (Yeats, Joyce), and emigration history.",
    "Israel": "Capital: Jerusalem (disputed). Population: ~9.3 million. Known for Holy Land, tech startup nation, kibbutzim, and Israeli-Palestinian conflict.",
    "Italy": "Capital: Rome. Population: ~60.3 million. Known for Roman Empire, Renaissance art, fashion, opera, and cuisine.",
    "Jamaica": "Capital: Kingston. Population: ~2.8 million. Known for reggae music (Bob Marley), sprint athletes, and all-inclusive resorts.",
    "Japan": "Capital: Tokyo. Population: ~125 million. Known for technology, anime, bullet trains, cherry blossoms, and longevity.",
    "Jordan": "Capital: Amman. Population: ~11 million. Known for ancient Nabatean civilization, refugee hosting, and desert landscapes.",
    "Kazakhstan": "Capital: Nur-Sultan (Astana). Population: ~19 million. Known for being the largest landlocked country, oil reserves, and Borat stereotypes.",
    "Kenya": "Capital: Nairobi. Population: ~55 million. Known for safari destinations, marathon runners, and Great Rift Valley.",
    "Kiribati": "Capital: South Tarawa. Population: ~120,000. Known for being first to see new year, climate change vulnerability, and Pacific atolls.",
    "Korea, North": "Capital: Pyongyang. Population: ~25 million. Known for isolated communist regime, nuclear program, and DMZ border.",
    "Korea, South": "Capital: Seoul. Population: ~51 million. Known for K-pop, technology (Samsung), rapid development, and Korean Wave.",
    "Kosovo": "Capital: Pristina. Population: ~1.8 million. Known for 2008 independence declaration, ethnic tensions, and young population.",
    "Kuwait": "Capital: Kuwait City. Population: ~4.3 million. Known for oil wealth, Gulf War, high temperatures, and expat majority population.",
    "Kyrgyzstan": "Capital: Bishkek. Population: ~6.7 million. Known for nomadic traditions, mountain landscapes, and Silk Road history.",
    "Laos": "Capital: Vientiane. Population: ~7.4 million. Known for being a landlocked Southeast Asian country, Buddhist culture, and UXO legacy.",
    "Latvia": "Capital: Riga. Population: ~1.9 million. Known for Art Nouveau architecture, Baltic culture, and song and dance festivals.",
    "Lebanon": "Capital: Beirut. Population: ~5.6 million. Known for cedar trees, diverse religious groups, civil war history, and cuisine.",
    "Lesotho": "Capital: Maseru. Population: ~2.1 million. Known for mountain kingdom, being entirely surrounded by South Africa, and textiles.",
    "Liberia": "Capital: Monrovia. Population: ~5.2 million. Known for being founded by freed American slaves, civil wars, and Ebola outbreak.",
    "Libya": "Capital: Tripoli. Population: ~6.9 million. Known for oil reserves, 2011 revolution, desert landscapes, and Roman ruins.",
    "Liechtenstein": "Capital: Vaduz. Population: ~39,000. Known for being a microstate, banking, alpine scenery, and constitutional monarchy.",
    "Lithuania": "Capital: Vilnius. Population: ~2.8 million. Known for being a Baltic state, basketball passion, and medieval old towns.",
    "Luxembourg": "Capital: Luxembourg City. Population: ~640,000. Known for being a wealthy EU country, finance sector, and multilingual population.",
    "Madagascar": "Capital: Antananarivo. Population: ~28.9 million. Known for unique wildlife (lemurs), vanilla production, and island biodiversity.",
    "Malawi": "Capital: Lilongwe. Population: ~19.6 million. Known for being the Warm Heart of Africa, freshwater lake, and tobacco production.",
    "Malaysia": "Capital: Kuala Lumpur. Population: ~33.6 million. Known for multicultural society, rainforests, and electronics manufacturing.",
    "Maldives": "Capital: Malé. Population: ~521,000. Known for luxury resorts, climate change threat, and coral atolls.",
    "Mali": "Capital: Bamako. Population: ~21.9 million. Known for ancient Mali Empire, music traditions, and desert landscapes.",
    "Malta": "Capital: Valletta. Population: ~520,000. Known for Knights of Malta, Game of Thrones filming locations, and Mediterranean history.",
    "Marshall Islands": "Capital: Majuro. Population: ~59,000. Known for nuclear testing legacy, climate change vulnerability, and atoll nation.",
    "Mauritania": "Capital: Nouakchott. Population: ~4.6 million. Known for Saharan landscapes, slavery issues, and Islamic republic.",
    "Mauritius": "Capital: Port Louis. Population: ~1.3 million. Known for sugar production, multicultural society, and luxury tourism.",
    "Mexico": "Capital: Mexico City. Population: ~128.9 million. Known for ancient civilizations (Aztec, Maya), tequila, and vibrant culture.",
    "Micronesia": "Capital: Palikir. Population: ~115,000. Known for being a Pacific island nation, WWII wrecks, and traditional navigation.",
    "Moldova": "Capital: Chisinau. Population: ~2.6 million. Known for wine production, breakaway Transnistria region, and agricultural economy.",
    "Monaco": "Capital: Monaco. Population: ~39,000. Known for being a wealthy microstate, Grand Prix, tax haven, and Grimaldi family.",
    "Mongolia": "Capital: Ulaanbaatar. Population: ~3.3 million. Known for nomadic culture, vast steppes, and Genghis Khan legacy.",
    "Montenegro": "Capital: Podgorica. Population: ~620,000. Known for Adriatic coastline, mountainous terrain, and recent independence (2006).",
    "Morocco": "Capital: Rabat. Population: ~37.1 million. Known for Atlas Mountains, Sahara desert, imperial cities, and souks.",
    "Mozambique": "Capital: Maputo. Population: ~32.1 million. Known for Indian Ocean coastline, Portuguese influence, and post-war recovery.",
    "Myanmar": "Capital: Naypyidaw. Population: ~54.4 million. Known for military rule, Buddhist culture, golden pagodas, and Aung San Suu Kyi.",
    "Namibia": "Capital: Windhoek. Population: ~2.6 million. Known for desert landscapes, German colonial heritage, and wildlife conservation.",
    "Nauru": "Capital: Yaren (de facto). Population: ~11,000. Known for being the world's smallest republic, phosphate mining, and obesity issues.",
    "Nepal": "Capital: Kathmandu. Population: ~30 million. Known for the Himalayas, birthplace of Buddha, and trekking destination.",
    "Netherlands": "Capital: Amsterdam. Population: ~17.5 million. Known for windmills, tulips, cycling culture, and liberal policies.",
    "New Zealand": "Capital: Wellington. Population: ~5.1 million. Known for Lord of the Rings films, rugby (All Blacks), and kiwi birds.",
    "Nicaragua": "Capital: Managua. Population: ~6.7 million. Known for being the largest Central American country, lakes and volcanoes, and political unrest.",
    "Niger": "Capital: Niamey. Population: ~25.1 million. Known for Saharan landscapes, uranium mining, and high fertility rate.",
    "Nigeria": "Capital: Abuja. Population: ~219 million. Known for being Africa's largest economy, Nollywood, oil production, and diverse cultures.",
    "North Macedonia": "Capital: Skopje. Population: ~2.1 million. Known for ancient history (Alexander the Great), and name dispute with Greece.",
    "Norway": "Capital: Oslo. Population: ~5.4 million. Known for fjords, Vikings, oil wealth, midnight sun, and winter sports.",
    "Oman": "Capital: Muscat. Population: ~5.1 million. Known for frankincense trade, desert forts, maritime history, and peaceful diplomacy.",
    "Pakistan": "Capital: Islamabad. Population: ~231 million. Known for Indus Valley civilization, nuclear power, and Kashmir conflict.",
    "Palau": "Capital: Ngerulmud. Population: ~18,000. Known for marine biodiversity, WWII wrecks, and pristine diving spots.",
    "Panama": "Capital: Panama City. Population: ~4.4 million. Known for the canal connecting oceans, biodiversity, and offshore banking.",
    "Papua New Guinea": "Capital: Port Moresby. Population: ~9.9 million. Known for cultural diversity, rainforests, tribal traditions, and bird of paradise.",
    "Paraguay": "Capital: Asunción. Population: ~7.3 million. Known for being landlocked, Guarani culture, and yerba mate production.",
    "Peru": "Capital: Lima. Population: ~33.7 million. Known for Inca Empire, Andean landscapes, Amazon rainforest, and diverse cuisine.",
    "Philippines": "Capital: Manila. Population: ~113.9 million. Known for being an island nation, overseas workers, Catholicism in Asia, and karaoke culture.",
    "Poland": "Capital: Warsaw. Population: ~37.8 million. Known for Solidarity movement, WWII history, and Copernicus and Chopin.",
    "Portugal": "Capital: Lisbon. Population: ~10.3 million. Known for Age of Discovery, fado music, cork production, and Cristiano Ronaldo.",
    "Qatar": "Capital: Doha. Population: ~2.9 million. Known for natural gas wealth, 2022 FIFA World Cup, and Al Jazeera media.",
    "Romania": "Capital: Bucharest. Population: ~19 million. Known for Transylvania, Dracula legend, Carpathian Mountains, and EU membership.",
    "Russia": "Capital: Moscow. Population: ~143.4 million. Known for being the largest country, vodka, space program, and literature (Dostoevsky, Tolstoy).",
    "Rwanda": "Capital: Kigali. Population: ~13.5 million. Known for 1994 genocide, mountain gorillas, rapid development, and cleanliness.",
    "Saint Kitts and Nevis": "Capital: Basseterre. Population: ~53,000. Known for being the smallest American country, sugar plantation history, and citizenship by investment.",
    "Saint Lucia": "Capital: Castries. Population: ~184,000. Known for volcanic landscapes, jazz festival, and luxury resorts.",
    "Saint Vincent and the Grenadines": "Capital: Kingstown. Population: ~111,000. Known for Grenadines islands, sailing destinations, and banana production.",
    "Samoa": "Capital: Apia. Population: ~200,000. Known for Fa'a Samoa traditions, rugby, being first to see new day, and natural beauty.",
    "San Marino": "Capital: San Marino. Population: ~34,000. Known for being the oldest republic, microstate, Mount Titano, and philately.",
    "Sao Tome and Principe": "Capital: São Tomé. Population: ~223,000. Known for chocolate production, island biodiversity, and Portuguese colonial architecture.",
    "Saudi Arabia": "Capital: Riyadh. Population: ~35.9 million. Known for being the birthplace of Islam, oil reserves, and conservative monarchy.",
    "Senegal": "Capital: Dakar. Population: ~17.2 million. Known for Teranga hospitality, music scene, and Dakar Rally.",
    "Serbia": "Capital: Belgrade. Population: ~6.7 million. Known for Balkan crossroads, Novak Djokovic, and Orthodox Christian heritage.",
    "Seychelles": "Capital: Victoria. Population: ~99,000. Known for luxury tourism, giant tortoises, pristine beaches, and coco de mer.",
    "Sierra Leone": "Capital: Freetown. Population: ~8.4 million. Known for blood diamond history, civil war, and founding home for freed slaves.",
    "Singapore": "Capital: Singapore. Population: ~5.9 million. Known for strict laws, financial hub, multicultural society, and efficiency.",
    "Slovakia": "Capital: Bratislava. Population: ~5.5 million. Known for Carpathian Mountains, EU membership, and medieval castles.",
    "Slovenia": "Capital: Ljubljana. Population: ~2.1 million. Known for Alpine scenery, EU membership, and Triglav National Park.",
    "Solomon Islands": "Capital: Honiara. Population: ~720,000. Known for WWII history, coral reefs, and Melanesian culture.",
    "Somalia": "Capital: Mogadishu. Population: ~17.1 million. Known for long coastline, civil war, piracy, and nomadic traditions.",
    "South Africa": "Capital: Pretoria (administrative), Cape Town (legislative), Bloemfontein (judicial). Population: ~60.1 million. Known for Apartheid history, Nelson Mandela, biodiversity, and wine production.",
    "South Sudan": "Capital: Juba. Population: ~11.4 million. Known for being the world's newest country (2011), civil conflicts, and oil reserves.",
    "Spain": "Capital: Madrid. Population: ~47.4 million. Known for flamenco, siesta culture, football (La Liga), and diverse regions.",
    "Sri Lanka": "Capital: Colombo (executive), Sri Jayawardenepura Kotte (legislative). Population: ~22.2 million. Known for tea production, civil war, beaches, and biodiversity.",
    "Sudan": "Capital: Khartoum. Population: ~45.7 million. Known for ancient Nubian civilization, Darfur conflict, and recent division.",
    "Suriname": "Capital: Paramaribo. Population: ~612,000. Known for rainforests, Dutch colonial heritage, and diverse ethnic groups.",
    "Sweden": "Capital: Stockholm. Population: ~10.4 million. Known for IKEA, ABBA, welfare state, Nobel Prize, and midnight sun.",
    "Switzerland": "Capital: Bern. Population: ~8.7 million. Known for neutrality, watches, banking, Alps, and chocolate.",
    "Syria": "Capital: Damascus. Population: ~21.3 million. Known for ancient civilizations, ongoing civil war, and Damascus steel.",
    "Taiwan": "Capital: Taipei. Population: ~23.6 million. Known for semiconductor industry, disputed sovereignty, and night markets.",
    "Tajikistan": "Capital: Dushanbe. Population: ~9.8 million. Known for mountainous terrain, civil war history, and Persian culture.",
    "Tanzania": "Capital: Dodoma. Population: ~63.6 million. Known for wildlife safaris, Zanzibar, Ngorongoro Crater, and Swahili language.",
    "Thailand": "Capital: Bangkok. Population: ~70.0 million. Known for Buddhist temples, beaches, cuisine, and Land of Smiles.",
    "Togo": "Capital: Lomé. Population: ~8.6 million. Known for voodoo traditions, phosphate mining, and colonial architecture.",
    "Tonga": "Capital: Nuku'alofa. Population: ~106,000. Known for being the last Polynesian monarchy, rugby, and missionary influence.",
    "Trinidad and Tobago": "Capital: Port of Spain. Population: ~1.4 million. Known for Carnival, steelpan music, oil and gas, and diverse culture.",
    "Tunisia": "Capital: Tunis. Population: ~11.9 million. Known for Arab Spring origin, ancient Carthage, and Mediterranean beaches.",
    "Turkey": "Capital: Ankara. Population: ~85.0 million. Known for Ottoman Empire, bridge between continents, and Turkish delight.",
    "Turkmenistan": "Capital: Ashgabat. Population: ~6.3 million. Known for gas reserves, authoritarian government, and white marble buildings.",
    "Tuvalu": "Capital: Funafuti. Population: ~11,000. Known for climate change vulnerability, .tv domain, and remote Pacific atolls.",
    "Uganda": "Capital: Kampala. Population: ~47.1 million. Known for mountain gorillas, Pearl of Africa, and Nile River source.",
    "Ukraine": "Capital: Kyiv. Population: ~43.8 million. Known for being the breadbasket of Europe, ongoing war with Russia, and Orthodox churches.",
    "United Arab Emirates": "Capital: Abu Dhabi. Population: ~9.9 million. Known for oil wealth, luxury shopping, expat majority, and futuristic cities.",
    "United Kingdom": "Capital: London. Population: ~67.3 million. Known for British Empire, monarchy, Shakespeare, The Beatles, and football.",
    "United States": "Capital: Washington, D.C.. Population: ~331 million. Known for being a global superpower, Hollywood, diverse landscapes, and innovation hub.",
    "Uruguay": "Capital: Montevideo. Population: ~3.5 million. Known for progressive policies, football (Suárez, Forlán), and mate drinking.",
    "Uzbekistan": "Capital: Tashkent. Population: ~35.6 million. Known for Silk Road cities, Islamic architecture, and cotton production.",
    "Vanuatu": "Capital: Port Vila. Population: ~315,000. Known for volcanic islands, happy planet index, and land diving ritual.",
    "Vatican City": "Capital: Vatican City. Population: ~800. Known for being the smallest country, center of Catholicism, Pope, and Swiss Guard.",
    "Venezuela": "Capital: Caracas. Population: ~28.4 million. Known for oil reserves, economic crisis, Miss Universe winners, and baseball.",
    "Vietnam": "Capital: Hanoi. Population: ~98.2 million. Known for Vietnam War, economic growth, ao dai dresses, and coffee culture.",
    "Yemen": "Capital: Sana'a. Population: ~33 million. Known for ancient civilization, ongoing civil war, coffee origin, and frankincense.",
    "Zambia": "Capital: Lusaka. Population: ~19.5 million. Known for copper mining, wildlife safaris, and Zambezi River.",
    "Zimbabwe": "Capital: Harare. Population: ~15.1 million. Known for hyperinflation, Robert Mugabe legacy, and wildlife conservation."
  }